{
  "epicId": "BEB2B-310",
  "title": "B2B Business Epic AlarmRuf Betrieb & Service sicherstellen",
  "ziele": {
    "gesamtziel": "Der Betrieb des Produkts AlarmRuf soll über das Jahr 2025 hinaus sichergestellt werden. Dies umfasst insbesondere die Bereitstellung eines AGB-Produkts mit einer Kündigungsfrist von über 12 Monaten und die Sicherstellung des Betriebs für die Jahre 2026 und 2027.",
    "einzelziele": [
      "Keine Informationen verfügbar"
    ]
  },
  "businessValue": {
    "businessImpact": {
      "skala": 0,
      "beschreibung": "Keine Informationen verfügbar"
    },
    "strategicEnablement": {
      "skala": 0,
      "beschreibung": "AlarmRuf Betrieb über 2025 hinaus sicherstellen"
    },
    "timeCriticality": {
      "skala": 0,
      "beschreibung": "Keine Informationen verfügbar"
    }
  },
  "funktionen": [
    {
      "id": "BEB2B-310",
      "titel": "B2B Business Epic AlarmRuf Betrieb & Service sicherstellen",
      "funktionalitäten": [
        "Sicherstellung des Betriebs des Produkts AlarmRuf für die Jahre 2026 und 2027 mit einer Verfügbarkeit von 99,8 %",
        "Bereitstellung von Budget für Betrieb und Technik (IT & Technik)",
        "Bereitstellung von Budget für die Migration auf eine andere Plattform, falls die VASP 2026 ausläuft",
        "Bereitstellung einer neuen Plattform bis spätestens Ende 2025 und Migration der Kunden auf diese Plattform",
        "Betrieb der neuen Plattform durch eine B2B-Domain",
        "Barrierefreie Kundenselbstadministration und Oberfläche für den DT-Kundenservice mit entsprechendem Testat",
        "Einhaltung der Leistungsbeschreibung gemäß AGB-Produkt: https://www.telekom.de/agb/downloads/53752.pdf"
      ]
    }
  ],
  "acceptance_criteria": [
    "Den Betrieb des Produktes AlarmRuf für die Jahre 2026 und 2027 mit einer Verfügbarkeit von 99,8 % sicherstellen.",
    "Budget für Betrieb und Technik (IT & Technik) wird zu Verfügung gestellt.",
    "Budget für die Migration auf eine andere Plattform, wenn die VASP 2026 ausläuft wird zu Verfügung gestellt.",
    "Plattform bis spätestens Ende 2025 bereitgestellt und die Kunden dorthin migrieren.",
    "Der Betrieb der neuen Plattform soll durch eine B2B-Domain erfolgen.",
    "Die Kundenselbstadministration und die Oberfläche für den DT-Kundenservice müssen ein barrierefrei sein und ein entsprechendes Testat muss vorliegen.",
    "AlarmRuf ist ein AGB-Produkt. Das Produkt muss der Leistungsbeschreibung entsprechen:",
    "https://www.telekom.de/agb/downloads/53752.pdf"
  ],
  "domainsAndITApplications": [
    "B2B-Domain"
  ],
  "abhängigkeitenUndRisiken": [
    "Abhängigkeit von der Bereitstellung einer neuen Plattform bis spätestens Ende 2025.",
    "Risiko, dass die VASP 2026 ausläuft und eine Migration auf eine andere Plattform notwendig wird.",
    "Abhängigkeit von der Bereitstellung des Budgets für Betrieb, Technik und Migration.",
    "Abhängigkeit von der Einhaltung der Barrierefreiheit und dem Vorliegen eines entsprechenden Testats."
  ],
  "zeitplan": {
    "umsetzungsstart": "2025-02-14",
    "umsetzungsende": "2025-12-31",
    "fixVersions": [
      "Q3_25"
    ],
    "meilensteine": [
      {
        "id": "BEB2B-310-MS1",
        "beschreibung": "Bereitstellung der neuen Plattform und Migration der Kunden bis spätestens Ende 2025",
        "zeitraum": "bis 2025-12-31"
      }
    ]
  }
}