{
  "epicId": "BEB2B-197",
  "title": "OTC Solution Packages 2.0",
  "ziele": {
    "gesamtziel": "Aktualisierung der bestehenden OTC Solution Packages durch Weiterentwicklung von 5 Rund-um-Sorglos Servicepaketen (Managed Infrastructure, Managed Workspace, Managed Cloud Backup, Managed Cloud Connect, Managed Applikation) für KMU-/M-/L-Kunden. Die Pakete kombinieren OTC-Leistungen mit Service-Leistungen der ISP für verschiedene IT-Komponenten. Umsetzungszeitraum: 18.03.2024 bis 31.05.2024.",
    "einzelziele": [
      "Anpassung des Leistungskonfigurators in Prima+ und SeCe-IT",
      "Erweiterung des Managed Infrastructure Pakets um Exchange, Active Directory und Antivirenscanner",
      "Erweiterung des Managed Workspace Pakets um NextCloud Office, Nextcloud HA und OneClick Plattform",
      "Erweiterung des Managed Backup Pakets um Installation Veeam Backup für M365",
      "Entfernung der Silber Option im Betrieb bei Managed Cloud Connect",
      "Neueinführung des Managed Application Pakets",
      "Preisanpassung und teilweise Änderung der Leistungsstruktur"
    ]
  },
  "businessValue": {
    "businessImpact": {
      "skala": 8,
      "beschreibung": "Umsatzsteigerung von 830 Tsd. € im ersten Jahr nach Launch, bis 2028 geplanter Umsatz von 4,3 Mio. € inkl. Individualgeschäft. Einsparung von Vertriebsressourcen durch Automatisierung der Angebotserstellung."
    },
    "strategicEnablement": {
      "skala": 8,
      "beschreibung": "Mittelfristige Reduzierung von Wartungs- und Änderungsrisiken. Erhöhung der Kundenbindung und Stärkung des TD-Images. Verbesserung der Wettbewerbsfähigkeit durch Push-Verkaufsmaßnahmen der Open Telekom Cloud und Bestellprozessvereinfachung."
    },
    "timeCriticality": {
      "skala": 13,
      "beschreibung": "Hohe zeitliche Kritikalität, da Business Impact schnellstmöglich erreicht werden soll. Geplanter Umsetzungszeitraum: 18.03.2024 bis 31.05.2024."
    }
  },
  "funktionen": [
    {
      "id": "BEB2B-197",
      "titel": "OTC Solution Packages 2.0",
      "funktionalitäten": [
        "Anpassung des Leistungskonfigurators in Prima+ und SeCe-IT",
        "Hinterlegung neuer Leistungsinhalte in Prima+",
        "Optimierung des SeCe-IT Konfigurators für benutzerfreundliche und intuitive Gestaltung",
        "Erweiterung des Managed Infrastructure Pakets um Exchange, Active Directory und Antivirenscanner",
        "Erweiterung des Managed Workspace Pakets um NextCloud Office, Nextcloud HA und OneClick Plattform",
        "Erweiterung des Managed Backup Pakets um Installation Veeam Backup für M365",
        "Entfernung der Silber Option im Betrieb bei Managed Cloud Connect",
        "Neueinführung des Managed Application Pakets",
        "Preisanpassung und teilweise Änderung der Leistungsstruktur"
      ]
    }
  ],
  "acceptance_criteria": [
    "Managed Infrastructure: Anwendungen Exchange, Active Directory und Antivirenscanner müssen abgebildet werden",
    "Managed Workspace: Applikationen NextCloud Office, Nextcloud HA und OneClick Plattform müssen abgebildet werden",
    "Managed Backup: Installation Veeam Backup für M365 muss abgebildet werden",
    "Managed Cloud Connect: Silber Option in Betrieb wird gelöscht",
    "Managed Application: wird neu eingeführt"
  ],
  "domainsAndITApplications": [
    "SeCe-IT",
    "Prima+",
    "DOM0201",
    "DOM0202"
  ],
  "abhängigkeitenUndRisiken": [
    "Die Daten müssen zuerst in Prima+ hinterlegt werden, bevor der SeCe-IT Konfigurator gebaut werden kann",
    "Verbindung zwischen SeCe-IT und dem Service-Tool der ISP mySHS ist out of scope und wird separat betrachtet",
    "Der Prozessablauf (SeCe-IT - mySHS) muss getestet werden",
    "Die leistenden Delivery-Einheiten der ISP müssen hinterlegt werden"
  ],
  "zeitplan": {
    "umsetzungsstart": "2024-03-18",
    "umsetzungsende": "2025-07-30",
    "fixVersions": ["Q3_25"],
    "meilensteine": [
      {
        "id": "BEB2B-197",
        "beschreibung": "Launch der aktualisierten OTC Solution Packages",
        "zeitraum": "31.05.2024"
      }
    ]
  }
}