```json
{
  "epicId": "BEB2B-334",
  "title": "IZM 3.0 Renew Targetmanagementsystem",
  "ziele": {
    "gesamtziel": "Modernisierung, Aktualisierung und Ergänzung des über 10 Jahre alten Zielemanagementsystems (IZM), das direkten Einfluss auf die Bezahlung der Mitarbeitenden in Vertriebsfunktion hat. Das System soll durch den Aufbau einer App für mobile Geräte, Anpassung der Browseroberfläche und Integration eines Reportingtools verbessert werden, um die Attraktivität und Nutzerfreundlichkeit zu steigern sowie das verloren gegangene Vertrauen und die Akzeptanz wiederzugewinnen. Die Umsetzung ist für den Zeitraum vom 01.07.2025 bis 30.09.2025 geplant.",
    "einzelziele": [
      "Aufbau einer App für Handy und Tablet zur Ablösung der umständlichen Browsernutzung",
      "Anpassung der Browseroberfläche in Anlehnung an die App",
      "Integration in Hub und Mitarbeiter APP",
      "Ergänzende Programmierung eines Reportingtools"
    ]
  },
  "businessValue": {
    "businessImpact": {
      "skala": 0,
      "beschreibung": "Das Zielemanagementsystem (IZM) ist eines der kritischsten Systeme, da es direkt Einfluss auf die Bezahlung der Mitarbeitenden in Vertriebsfunktion hat. Nur so können wir zukünftig eine korrekte Zieleabrechnung sicher stellen."
    },
    "strategicEnablement": {
      "skala": 0,
      "beschreibung": "Hierdurch wird die Attraktivität, Nutzerfreundlichkeit des Tools verbessert und gesteigert. Das verloren gegangene Vertrauern und die Akzeptanz muss wieder gewonnen werden."
    },
    "timeCriticality": {
      "skala": 0,
      "beschreibung": "Die Umsetzung muss recht zeitnah erfolgen vor dem Hintergrund der anstehenden Cloudifizierung des (alten) Systems. Darüber hinaus ist zu bedenken, dass es nach Aussagen der System Experten ein \"End of living\" bestimmter Komponenten im Jahre 2028 gibt."
    }
  },
  "funktionen": [
    {
      "id": "BEB2B-334",
      "titel": "IZM 3.0 Renew Targetmanagementsystem",
      "funktionalitäten": [
        "Modernisierung des über 10 Jahre alten Zieletools für ca. 3.000 IZM User",
        "Aufbau einer App für Handy und Tablet zur Verbesserung der Nutzerfreundlichkeit",
        "Anpassung der Browseroberfläche in Anlehnung an die App",
        "Integration in Hub und Mitarbeiter APP",
        "Implementierung eines Reportingtools"
      ]
    }
  ],
  "acceptance_criteria": [
    "Das bestehende System/ die bestehenden Prozesse sollne als Grundlage dienen um die geplanten Veränderung für die IT so ressourcenschonend wie möglich durchführen zu können",
    "Es soll im ersten Schritt eine App programmiert werden, die die Inhalte/Funktionen der  bisherige Browseroberfläche in optisch ansprechender und vereinfachenderer Form wiedergibt",
    "Diese App muss von Mobilfunktelefonen und mobilen Tablets benutzt werden können",
    "Diese App muss sowohl in das Hub als auch in die Mitarbeiter App integriert werden bzw. von dort abrufbar sein\n-In einem zweiten Schritt muss die bisherige Browseroberfläche - die nach wie vor über myPortal erreichbar sein muss - ebenfalls der mobilen App angepasst werden",
    "Als dritter Schritt muss ein - immer wieder gefordertes aber bislang nie implementiertes -  Reportingtool integriert werden."
  ],
  "domainsAndITApplications": [
    "IZM (Zielemanagementsystem)",
    "Hub",
    "Mitarbeiter APP",
    "myPortal"
  ],
  "abhängigkeitenUndRisiken": [
    "Das System befindet sich im Status 'Funnel', was darauf hindeutet, dass es sich noch in einer frühen Planungsphase befindet",
    "Zeitliche Kritikalität aufgrund des 'End of living' bestimmter Komponenten im Jahr 2028",
    "Abhängigkeit von der anstehenden Cloudifizierung des alten Systems",
    "Das System ist kritisch für die Bezahlung von ca. 3.000 Mitarbeitenden in Vertriebsfunktionen"
  ],
  "zeitplan": {
    "umsetzungsstart": "2025-07-01",
    "umsetzungsende": "2025-09-30",
    "fixVersions": [],
    "meilensteine": []
  }
}
```