{
  "epicId": "BEIOT-189",
  "title": "IoT - Enable Service Revenue on SAP BRIM",
  "ziele": {
    "gesamtziel": "Das Ziel des Business Epics ist es, für Kunden, die Produkte mit interner Kennzeichnung als Solution und Service Revenue erwerben, eine einheitliche Abrechnung zu ermöglichen. Alle Produkte sollen auf einer Rechnung und in einem Vertrag für eine Bestellung zusammengefasst werden. Zudem soll die interne Umsatzbuchung korrekt erfolgen und die Provisionierung für den Vertrieb funktionieren. Der geplante Abschluss ist für Q3_25 vorgesehen.",
    "einzelziele": [
      "Produkte, die auf SAP Brim abgebildet sind und eher Service Revenue sind, sollen (auch gemischt mit Solution Revenue Produkten) gemeinsam auf einer Rechnung stehen und Kunden angeboten werden können. Zusätzlich muss die korrekte Umsatz- und Zielerreichungszuordnung in Smart und DKK funktionieren.",
      "DKK ist nicht für die Umsatzzuordnung zuständig. In DKK muss geprüft werden, ob diese Anpassung Auswirkungen auf das Forderungsmanagement hat.",
      "Keine Informationen verfügbar"
    ]
  },
  "businessValue": {
    "businessImpact": {
      "skala": 0,
      "beschreibung": "Erwartete Umsatzsteigerung: 2025: 150k€, 2026: 210k€, 2027: 280k€. Effizienzsteigerung: 2025: 20k€, 2026: 30k€, 2027: 50k€. Reduzierung des Aufwands für die Produktaufnahme und für Kunden durch eine einheitliche Rechnung und Vertrag."
    },
    "strategicEnablement": {
      "skala": 0,
      "beschreibung": "Steigerung der Kundenzufriedenheit und Reduzierung interner Prozesse zur Umsatzbuchung."
    },
    "timeCriticality": {
      "skala": 0,
      "beschreibung": "Keine explizite Angabe zur zeitlichen Kritikalität, jedoch ist die Umsetzung für Q3_25 geplant."
    }
  },
  "funktionen": [
    {
      "id": "DATAFAB-34734",
      "titel": "IoT - Enable Service Revenue on SAP BRIM",
      "funktionalitäten": [
        "Produkte, die als Service Revenue klassifiziert sind, können gemeinsam mit Solution Revenue Produkten auf einer Rechnung abgebildet und Kunden angeboten werden.",
        "Korrekte Umsatzzuordnung und Zielerreichungszuordnung in Smart und DKK.",
        "Prüfung, ob Anpassungen Auswirkungen auf das Forderungsmanagement in DKK haben."
      ]
    },
    {
      "id": "DATAFAB-34735",
      "titel": "IoT - Enable Service Revenue on SAP BRIM",
      "funktionalitäten": [
        "Keine Informationen verfügbar"
      ]
    }
  ],
  "acceptance_criteria": [
    "Produkte die auf SAP Brim abgebildet sind und die eher Service REvenue sind, sollten als solches (auch gemischt mit Solution REvenue Produkten gemeinsam auf einer REchnung stehen können und Kunden angeboten werden können. Zusätzlich funktioniert die korrekte Umsatzzuordung und Zielerreichungszuordnung in Smart und DKK.",
    "DKK ist nicht für die Umsatzzuordnung zuständig. in DKK muss geprüft werden ob diese Anpassung auswirkungen auf das Forderungsmanagement hat.",
    "siehe Ausfüllhilfe https://wiki.telekom.de/x/UEVbfQ>",
    "Add a comment...\nPro tip: press m to comment",
    "Add a comment...\nPro tip: press m to comment"
  ],
  "domainsAndITApplications": [
    "Smart DOM0300 (Smart SPS)",
    "DKK DOM0701 (DKK_neu)",
    "DOM0712",
    "SAP BRIM DOM0202 (ORCA)"
  ],
  "abhängigkeitenUndRisiken": [
    "Abhängigkeit von der korrekten Umsetzung der Umsatzzuordnung und Provisionierung in Smart und DKK.",
    "Prüfung erforderlich, ob Anpassungen Auswirkungen auf das Forderungsmanagement in DKK haben.",
    "Keine expliziten externen Abhängigkeiten oder Risiken genannt. Die Zieltermine der Issues sind nicht vollständig angegeben, daher ist eine vollständige Risikobewertung nicht möglich."
  ],
  "zeitplan": {
    "umsetzungsstart": "Keine Informationen verfügbar",
    "umsetzungsende": "Q3_25",
    "fixVersions": [
      "Q3_25"
    ],
    "meilensteine": [
      {
        "id": "BEIOT-189",
        "beschreibung": "Abschluss des Business Epics und Bereitstellung der Funktionalität zur einheitlichen Abrechnung von Service und Solution Revenue Produkten.",
        "zeitraum": "Q3_25"
      }
    ]
  }
}