{
  "epicId": "BEMABU-2259",
  "title": "Sales Enablement Tool",
  "ziele": {
    "gesamtziel": "Implementierung eines Sales Enablement Tools, das Vertriebsmitarbeitern ermöglicht, relevante Vertriebsinhalte schnell zu finden, Inhalte optimal zu organisieren und die Governance von Inhalten zu vereinfachen. Das Ziel soll zwischen dem 01.10.2025 und 31.12.2025 erreicht werden.",
    "einzelziele": [
      "Relevante Vertriebsinhalte schnell finden (Dokumentenmanagement)",
      "Optimierte Organisation von Inhalten",
      "Governance von Inhalten vereinfachen",
      "Nahtlose Interaktion ohne Medienbrüche",
      "Passende Inhalte zum richtigen Zeitpunkt bereitstellen",
      "Sammlungen verwandter Inhalte für verschiedene Verkaufsszenarien"
    ]
  },
  "businessValue": {
    "businessImpact": {
      "skala": 20,
      "beschreibung": "Umsatzsteigerung > 6.000 T€, Kosteneinsparung >1.500 T€, Risikoverlust >1.500 T€. Leads erreichen durch weiteres Nurturing über Outbound einen höheren Reifegrad, höheres Commitment des Vertriebs, wertvollere Leads. Prozessvereinfachung der Outboundmaßnahmen in GK-VM, GK-LE und Public ermöglicht mehr Kundenangänge."
    },
    "strategicEnablement": {
      "skala": 8,
      "beschreibung": "Mittelfristige Reduzierung von Wartungs- und Änderungsrisiken. Erhöhung der Kundenerfahrung/-bindung oder des TD-Image durch einzigartigen Login, Prozessvereinfachung oder disruptive/architektonische Innovation. Transparente E2E-Leadbearbeitung zwischen CRM und dem Callcenter-Tool."
    },
    "timeCriticality": {
      "skala": 8,
      "beschreibung": "Geplanter Umsetzungszeitraum Plan Start: 01.10.2025 Plan Ende/Launch: 31.12.2025"
    }
  },
  "funktionen": [
    {
      "id": "BEMABU-2259",
      "titel": "Sales Enablement Tool",
      "funktionalitäten": [
        "Relevante Vertriebsinhalte schnell finden mit intuitiver, KI-gestützter Suche und Empfehlungen",
        "Optimierte Organisation von Inhalten durch Sammlungen für spezifische Verkaufsszenarien",
        "Governance von Inhalten vereinfachen mit globalen Governance-Tools",
        "CRM-Integration für gezielte Content-Empfehlungen auf Account-Ebene",
        "Verteilung von Inhalten über Bildschirmfreigabe, E-Mail und Mobilgeräte",
        "Echtzeitbenachrichtigungen und handlungsorientierte Informationen"
      ]
    }
  ],
  "acceptance_criteria": [
    "Nahtlose Interaktion: keine Medienbrüche. Versenden/suchen von Dokumente direkt über MagentaForce",
    "Passende Inhalte zum richtigen Zeitpunkt bereitstellen, um Geschäftszyklen zu beschleunigen",
    "Sammlungen verwandter Inhalte, die auf die Bedürfnisse der Verkäufer in verschiedenen Verkaufsszenarien und -initiativen abgestimmt sind"
  ],
  "domainsAndITApplications": [
    "MagentaForce",
    "DOM0201"
  ],
  "abhängigkeitenUndRisiken": [
    "Das Business Epic befindet sich im Status 'Funnel', was darauf hindeutet, dass es sich noch in einer frühen Phase befindet",
    "Die Umsetzung ist für Q4 2025 geplant, was einen langen Vorlauf bedeutet und potenzielle Änderungen der Anforderungen mit sich bringen könnte",
    "Abhängigkeit von der Integration mit MagentaForce"
  ],
  "zeitplan": {
    "umsetzungsstart": "2025-10-01",
    "umsetzungsende": "2025-12-31",
    "fixVersions": [],
    "meilensteine": []
  }
}