```json
{
  "epicId": "BEMABU-1859",
  "title": "Webex X (2025)",
  "ziele": {
    "gesamtziel": "Für potenzielle GK-Kunden aller Segmente, die einen oder mehrere Webex Services nachfragen, ist es notwendig, die Marktfähigkeit und -attraktivität zu erhalten und USP auszubauen, wodurch die Kundenbedürfnisse berücksichtigt und befriedigt werden können, so dass für GK ein signifikanter, positiver Deckungsbeitrag erreicht werden kann, und nicht Portfoliolücken entstehen, die Kunden zu Vertragskündigungen veranlassen und zum Wechsel zu Wettbewerbern führen. Das Vorhaben soll bis Ende 2025 umgesetzt werden.",
    "einzelziele": [
      "Webex Go 2025: Einführung einer WxC-Zubuchoption für Webex-Calling Kunden, die auf mobilen Devices ihre FN- oder MN-Rufnummer als Unternehmensidentität verwenden sollen",
      "Webex Sovereign Control 2025: Bereitstellung eines lokalen Verwaltungssystems für Verschlüsselungs-Keys, um Datensouveränität zu ermöglichen",
      "Webex Keep Alive 2025: Umsetzung lieferantenseitiger und betrieblich/technisch & prozessualer Anpassungen, um die Marktattraktivität zu erhalten",
      "Webex Lifecycle 2025: Einführung von Cisco Services gemäß der Cisco Webex Roadmap bei DT, um Mehrwert und Kundenbindung zu verbessern"
    ]
  },
  "businessValue": {
    "businessImpact": {
      "skala": 0,
      "beschreibung": "Sicherung der Bestandsverträge und Umsatzwachstum durch vollumfängliche Cisco-Webex Portfoliobereitstellung. Für Webex Go wird ein zusätzlicher Umsatz von ca. 3 Mio. € erwartet, für Webex Sovereign Control ca. 3,7 Mio. €. Weitere Umsatzpotentiale durch Kundenweiterentwicklungsmaßnahmen. Optimierung der Produktions- und Prozesskosten durch harmonisierte, schlanke und innovative IT-Abbildung."
    },
    "strategicEnablement": {
      "skala": 0,
      "beschreibung": "Sicherstellung der IT-Wachstumsziele durch Erschließen neuer Kundengruppen & Marktpotentiale. Umsetzung der Self Service Funktionalität sowie Erweiterung des Produkt Portfolios ist zwingende Voraussetzung für eine relevante Positionierung der Telekom im Markt. Generierung von Wettbewerbsvorteilen und Ausbau der Marktpositionierung im Webex Umfeld."
    },
    "timeCriticality": {
      "skala": 0,
      "beschreibung": "Webex Go: Launch in Q1.2026 mit vorliegenden Kundenanfragen (Debeka, PoC in 2025 ca. 100 User, ab Q1/2026 ca. 6.000 bis 9.000 User, insgesamt ca. 30.000 User). Webex Sovereign Control: Umsetzungszeitraum Oktober 2024 bis März 2025. Webex Keep Alive: Ganzjährig Run the Business. Webex Lifecycle: Umsetzungszeitraum Januar 2025 bis Dezember 2025."
    }
  },
  "funktionen": [
    {
      "id": "BEMABU-1872",
      "titel": "Webex Go 2025",
      "funktionalitäten": [
        "Optionale Erweiterung von Webex Calling: fügt die Webex-Nummer als zweite Identität/Leitung auf einem Mobilgerät hinzu (Mobile-Device wird WxC managed SIP-Device)",
        "Bereitstellung einer WxC-Zubuchoption für Webex-Calling Kunden",
        "Ermöglichung der Nutzung von FN- oder MN-Rufnummer als Unternehmensidentität auf mobilen Devices"
      ]
    },
    {
      "id": "BEMABU-1881",
      "titel": "Webex Sovereign Control 2025",
      "funktionalitäten": [
        "Bereitstellung eines lokalen Verwaltungssystems für Verschlüsselungs-Keys",
        "Ermöglichung von Datensouveränität für Webex Kunden",
        "Hosting und Verwaltung von Encryption-Keys für nutzergenerierte Informationen bei Webex Meetings, Messaging und Anrufen durch vertrauenswürdige europäische Partner",
        "Schlüsselverwaltung innerhalb der EU unabhängig von der Infrastruktur von Cisco"
      ]
    },
    {
      "id": "BEMABU-1882",
      "titel": "Webex Keep Alive 2025",
      "funktionalitäten": [
        "Umsetzung lieferantenseitiger und betrieblich/technisch & prozessualer Anpassungen",
        "Erhalt der grundsätzlichen Markt- und Wettbewerbsfähigkeit des WebexX-Portfolios",
        "Sicherstellung, dass Webex Bestands- und Neukunden aktuelle Services erhalten können"
      ]
    },
    {
      "id": "BEMABU-1883",
      "titel": "Webex Lifecycle 2025",
      "funktionalitäten": [
        "Weiterentwicklung des Webex-Portfolios gemäß der Cisco Webex Roadmap",
        "Einführung von Cisco Services gemäß der Cisco Webex Roadmap bei DT",
        "Verbesserung von Mehrwert und Kundenbindung"
      ]
    }
  ],
  "acceptance_criteria": [
    "Zusammenführung zweier IT-Systeme (ZMKM und SAP/CRM- Brim)",
    "Ein Prozess- und IT-Kette für unterschiedliche Buchungskreise (DTBS & TDG).",
    "Ein Webex-Portfolio, segmentübergreifend",
    "Synchronität erhalten, zw. dem Cisco-Webex und DT-Webex Portfolio",
    "Erweiterung unseres Angebotes durch für DT exklusive Webex-Inhalte"
  ],
  "domainsAndITApplications": [
    "SAP-BRIM (DOM0202)",
    "PMA-ISEM (DOM0200)",
    "B2B Standard - Mass Market (DOM0201)",
    "BSS (DOM0600)",
    "Customer Finance & Partnering (DOM0712)"
  ],
  "abhängigkeitenUndRisiken": [
    "Abhängigkeit von Cisco für die Bereitstellung der Cisco-Software (ca. Oktober 2024 für Webex Sovereign Control)",
    "Aufbau einer gesicherten (Teil-) Plattform für Key-Mgmt. (hosted Service by DT) für Webex Sovereign Control",
    "Zeitliche Diskrepanz: Business Initiative läuft bis Ende 2025, während Webex Go erst Q1 2026 gelauncht werden soll",
    "Koordination zwischen verschiedenen Domains und IT-Applikationen erforderlich"
  ],
  "zeitplan": {
    "umsetzungsstart": "2024-07-16",
    "umsetzungsende": "2025-12-31",
    "fixVersions": ["Q3_25", "PrioQ1_25", "PrioQ2_25"],
    "meilensteine": [
      {
        "id": "BEMABU-1881",
        "beschreibung": "Webex Sovereign Control 2025",
        "zeitraum": "Oktober 2024 - März 2025"
      },
      {
        "id": "BEMABU-1883",
        "beschreibung": "Webex Lifecycle 2025",
        "zeitraum": "Januar 2025 - Dezember 2025"
      },
      {
        "id": "BEMABU-1882",
        "beschreibung": "Webex Keep Alive 2025",
        "zeitraum": "Ganzjährig 2025"
      },
      {
        "id": "BEMABU-1872",
        "beschreibung": "Webex Go 2025",
        "zeitraum": "Q2/2025 (PoC/Feasibility Study) - Q1/2026 (Launch)"
      }
    ]
  }
}
```