```json
{
  "epicId": "BEMABU-1841",
  "title": "MSFT Produktportfolio 2025 - Delivery (Q3/25)",
  "ziele": {
    "gesamtziel": "Sicherstellung eines wettbewerbsfähigen Microsoft-Produktportfolios durch Rollout von MSFT-Features in Q3/2025, die in Q2 angeliefert und vom Plattform-Partner AppDirect ausgeliefert wurden. Ziel ist die Erhaltung der Feature-Parität mit Microsoft und Verbesserung der Marktplatz-Wettbewerbsfähigkeit, um Kunden zu halten und neue zu gewinnen. Geplante Umsetzung: 01.07.2025 - 30.09.2025.",
    "einzelziele": [
      "Rollout von MSFT-Features in Q3, die in Q2 angeliefert werden",
      "Erhaltung und Verbesserung der Feature-Parität mit Microsoft",
      "Verbesserung der Marktplatz-Wettbewerbsfähigkeit",
      "Effektiver Self Service für Kunden",
      "Verbessertes Microsoft Subscription Management",
      "Reduktion von Abrechnungsanfragen",
      "UX Verbesserungen"
    ]
  },
  "businessValue": {
    "businessImpact": {
      "skala": 20,
      "beschreibung": "13,2 Mio. € Brutto-Umsatz (Q3-Anteil) - entspricht 1,55 Mio. € IFRS-Umsatz. Geplantes Brutto-Umsatzwachstum FC0 für 2025 gesamt: 53 Mio. € bzw. 6,2 Mio. € IFRS."
    },
    "strategicEnablement": {
      "skala": 8,
      "beschreibung": "Churn Reduktion durch wettbewerbsfähiges Produktportfolio. Kunden, die aktuelle Produkte und Konditionen nicht auf dem TCMP erhalten würden mit Vertragsende zum Wettbewerb wechseln. Aktuell sehr wettbewerbsintensiv, insb. Vodafone."
    },
    "timeCriticality": {
      "skala": 13,
      "beschreibung": "Umsetzung in Q3 erforderlich. Im wettbewerbsintensiven Umfeld ist es zwingend erforderlich stets unmittelbar die aktuellsten MSFT-Produkte und Feature anbieten zu können."
    }
  },
  "funktionen": [
    {
      "id": "BEMABU-1841",
      "titel": "MSFT Produktportfolio 2025 - Delivery (Q3/25)",
      "funktionalitäten": [
        "Rollout von MSFT-Features, die in Q2 angeliefert werden",
        "Bereitstellung des aktuellsten Microsoft-Portfolios/Featuresets über den Telekom Cloud Marktplatz",
        "Sicherstellung der Wettbewerbsfähigkeit im Microsoft-Produktbereich",
        "Schaffung der Grundlage für margenstarkes Cross- und Upselling (u.a. Premium Services, Co-Pilot)"
      ]
    }
  ],
  "acceptance_criteria": [
    "MSFT-/AppDirect-Feature-Deliverables aus Q2 wurden validiert, getestet und in Q3/2025 in Produktion überführt",
    "Endkundeninformation zu umgesetzten Features ist erfolgt",
    "Vertriebs- und Customer-Care Briefing abgeschlossen"
  ],
  "domainsAndITApplications": [
    "Telekom Cloud Marketplace",
    "DOM0201"
  ],
  "abhängigkeitenUndRisiken": [
    "Abhängigkeiten zum Rollout von AppDirect V2-Plattform-Funktionalitäten, die zur Nutzung neuer MSFT-Features vorausgesetzt werden",
    "Abhängigkeit von der Microsoft-Roadmap und der Roadmap des Plattform-Partners AppDirect",
    "Kurzfristige Planbarkeit der Deliverables, da diese von externen Roadmaps abhängen",
    "Status ist 'Funnel', was auf eine frühe Phase der Planung hindeutet"
  ],
  "zeitplan": {
    "umsetzungsstart": "2025-07-01",
    "umsetzungsende": "2025-09-30",
    "fixVersions": ["Q3_25"],
    "meilensteine": []
  }
}
```