```json
{
  "epicId": "BEMABU-1961",
  "title": "E-invoice (e-Rechnung) in Germany - CSB-MWL",
  "ziele": {
    "gesamtziel": "Bereitstellung einer gesetzeskonformen elektronischen Rechnung (e-Rechnung) für alle Customer Touchpoint Kunden, die Leistungen wie Contact Solutions Produkte, Servicenummern oder KI-Produkte beziehen, über die Prozessstrecke Individualmarkt (Mars → CSB) bis zum 1.1.2027.",
    "einzelziele": [
      "Entwicklung der e-Rechnung über die Prozessstrecke Individualmarkt über Mars → CSB",
      "Bereitstellung der e-Rechnungen für Kunden über ReO- oder Nachfolge-Portal (MBSP)",
      "Ermöglichung des Versands der e-Rechnung per verifizierter E-Mail an den Kunden",
      "Erfassung und Verarbeitung von verifizierten E-Mail-Adressen für Rechnungsempfänger auf BKTO-Ebene",
      "Anbindung relevanter Systeme an den Customer Contact Master der SEP",
      "Entwicklung einer Schnittstelle zwischen CSB und TMF678 für die Übermittlung von Rechnungsdaten",
      "Speicherung von MWL-Rechnungen als TMF678 CustomerBill in einer Datenbank"
    ]
  },
  "businessValue": {
    "businessImpact": {
      "skala": 20,
      "beschreibung": "Es besteht das Risiko, dass Kunden, die keine gesetzeskonforme Rechnung erhalten, diese nicht bezahlen. Annahme ist, dass 25% des Umsatzes (ca. 20,5 Mio €) gefährdet ist, weil Kunden aufgrund falscher Rechnungsstellung die Rechnungen nicht bezahlen."
    },
    "strategicEnablement": {
      "skala": 13,
      "beschreibung": "Gesetzliche Vorgabe erfordert die Einführung der e-Rechnung zum 1.1.2027. Die Umsetzung reduziert oder beseitigt rechtliche Risiken."
    },
    "timeCriticality": {
      "skala": 3,
      "beschreibung": "Gesetzliche Vorgabe: Umsetzung bis 1.1.2027. Geplanter Umsetzungszeitraum: Plan Start: 01.12.23, Plan Ende/Launch: 31.12.26."
    }
  },
  "funktionen": [
    {
      "id": "B2BCA-3911",
      "titel": "e-Rechnung MWL (TESY)",
      "funktionalitäten": [
        "Erfassung und Verarbeitung von verifizierten E-Mail-Adressen für Rechnungsempfänger auf BKTO-Ebene",
        "Bereitstellung der e-Rechnung über die Prozessstrecke Individualmarkt (Mars → CSB)",
        "Zugriff auf e-Rechnungen über ReO- oder Nachfolge-Portal (MBSP)",
        "Versand der e-Rechnung per verifizierter E-Mail an den Kunden"
      ]
    },
    {
      "id": "MAGBUS-99872",
      "titel": "SEP: Zentrale eMail-Verifikation für MWL Kunden",
      "funktionalitäten": [
        "Zentrale Verifikation von E-Mail-Adressen für MWL-Kunden",
        "Anbindung relevanter Systeme der Prozessstrecke (Mars, CSB, ReO/mBSP) an den Customer Contact Master der SEP",
        "Erstellung eines abgestimmten Ziel-Architekturbilds der Prozessstrecke",
        "Ablage der Rechnungs-E-Mail-Adresse mit BKTO-Informationen"
      ]
    },
    {
      "id": "TDGM-81",
      "titel": "E-invoice (e-Rechnung) in Germany - CSB-MWL",
      "funktionalitäten": [
        "Erfassung von verifizierten E-Mail-Adressen für Vertragspartner, Ansprechpartner und Rechnungsempfänger auf BKTO-Ebene in CRM-T",
        "Abfrage und Empfang von verifizierten E-Mail-Adressen und Leitweg-IDs bei SEP durch CSB",
        "Realisierung neuer Logiken zur Rechnungscodezuordnung der e-Rechnung für MWL in CSB",
        "Anpassung der Schnittstelle CSB zu TMF678 Bill für MWL-Rechnungsdaten",
        "Übermittlung von Rechnungs-PDF und XML an ReO MWL/MBSP (MSP)"
      ]
    },
    {
      "id": "BCCR-709",
      "titel": "ViDA: eRechnung MWL",
      "funktionalitäten": [
        "Analyse der architektonischen und prozessualen Ziellösung für die Umsetzung der E-Rechnung",
        "Abstimmung mit allen relevanten fachseitigen und IT-seitigen Stakeholdern",
        "Umsetzung der Billing-relevanten Anforderungen",
        "Bereitstellung der e-Rechnung über die Prozessstrecke Individualmarkt (Mars → CSB)"
      ]
    }
  ],
  "acceptance_criteria": [
    "Die e-Rechnung muss über alle Prozessstrecken: 1. MARS->Abili-T, 2. Individualmarkt über Mars → CSB und 3. Lösungsgeschäft über MARS→ SAP (bei TSBS) für Customer Touchpoints entwickelt werden.",
    "Die erstellten e-Rechnungen muss der Kunde über sein ReO- oder Nachfolge-Portal (MBSP) abrufbar sein",
    "Die e-Rechnung muss auf Wunsch dem Kunden per Mail zugeschickt werden können.",
    "Die e-Rechnung muss ab 1.1.2027 allen Customer Touchpoints Kunden bereit gestellt werden können.",
    "Vertragspartner",
    "Ansprechpartner beim Kunden",
    "Rechnungsempfänger auf BKTO-Ebene"
  ],
  "domainsAndITApplications": [
    "DOM0701/DOM0712 (Mars alt/neu)",
    "DOM0202 (CSB (MWL))",
    "DOM0701/DOM0712 (ReO alt/neu)",
    "DOM0201/DOM0202 (ZMKM alt/neu)",
    "DOM0201 (MBSP (MSP))",
    "DOM0201 (SEP)",
    "TMF678",
    "DOM0701/DOM0712 (KIT alt/neu)",
    "DOM0200 (TESY)",
    "DOM0600 (CRM-T)",
    "DOM0701/DOM0712 (TMF 666 alt/neu)"
  ],
  "abhängigkeitenUndRisiken": [
    "Abhängigkeit zwischen verschiedenen Systemen der Prozesskette (CRM-T, ZMKM, TESY, MARS, CSB, ReO/MBSP, SEP, TMF678, KIT, TMF 666)",
    "Risiko bei der Übermittlung von Mussfeldern für die e-Rechnung (buyer reference) und verifizierten E-Mail-Adressen, die derzeit nicht über die alte Prozesskette geliefert werden",
    "Risiko bei der Zuordnung von MARS-BKTO'n aus einem TESY-Nummernkontingent für die Abrechnung von Individualkunden",
    "Zeitliches Risiko: Die Umsetzung muss bis 1.1.2027 abgeschlossen sein, während einige Teilprojekte erst in Q2-Q3/2025 oder sogar bis Q1/2026 geplant sind",
    "Abhängigkeit von der Entscheidung über die Zielarchitektur, die noch diskutiert wird"
  ],
  "zeitplan": {
    "umsetzungsstart": "2023-12-01",
    "umsetzungsende": "2026-12-31",
    "fixVersions": ["Q3_25", "PrioQ1_25", "PrioQ2_25", "PI 27", "PI 28 stretch", "2025-1", "2025-2", "2025-1_committed", "2025-2_committed", "2025-1_PSB_PI06", "2025-2_PSB_PI07"],
    "meilensteine": [
      {
        "id": "BCCR-751",
        "beschreibung": "Analyse: Abstimmung der architektonischen und prozessualen Ziellösung für die E-Rechnung",
        "zeitraum": "Q1/2025"
      },
      {
        "id": "MAB-2090",
        "beschreibung": "Analyse eRechnung: MWL",
        "zeitraum": "2025-01-02 bis 2025-06-30"
      },
      {
        "id": "PSB-970",
        "beschreibung": "E-Rechnung: Analyse zur Lösungsfindung für MWL (TMF666)",
        "zeitraum": "2025-01-08 bis 2025-03-11"
      },
      {
        "id": "PSB-974",
        "beschreibung": "E-Rechnung: Analyse zur Lösungsfindung für MWL (MARS)",
        "zeitraum": "2025-05-07 bis 2025-06-17"
      },
      {
        "id": "TDGM-81",
        "beschreibung": "E-invoice (e-Rechnung) in Germany - CSB-MWL",
        "zeitraum": "2024-11-14 bis 2025-10-31"
      },
      {
        "id": "BCCR-751",
        "beschreibung": "Umsetzung der Billing-relevanten Anforderungen",
        "zeitraum": "Q2-Q3/2025 (bzw. bis spätestens Q1/2026)"
      }
    ]
  }
}
```