```json
{
  "epicId": "BEMABU-2266",
  "title": "OnNet Security - Fixed - Comfort/Advanced Package - Touchpoints",
  "ziele": {
    "gesamtziel": "Implementierung von OnNet Security Festnetz Comfort/Advanced Paketen für GK Festnetz Kunden, die sich vor Cyber-Angriffen schützen wollen. Das Ziel ist, einen eingebauten Security Schutzschild für Festnetzanschlüsse zu schaffen, sodass Kunden keine zusätzlichen Komponenten für ihre Cyber-Sicherheit benötigen. Die Umsetzung ist für den Zeitraum 01.07.2025 bis 30.09.2026 geplant.",
    "einzelziele": [
      "Realisierung von Comfort/Advanced Paketen als neue kostenpflichtige BMPs, die unabhängig vom Festnetz-Tarif gebucht werden können",
      "Bereitstellung individueller Beratungsleistungen im Comfort-Paket, die über das SecurityPortal konfiguriert und abgerufen werden können",
      "Implementierung eines individuellen Schutzes für Endgeräte im Advanced-Paket mit konfigurierbaren Blocking-Profilen",
      "Befähigung aller Sales-Channels zur Arbeit mit den neuen BMPs",
      "Schaffung von Kunden- und Service-Touchpoints zur vertragsrelevanten Steuerung (Zu/Abbuchen) und Feature-Konfiguration"
    ]
  },
  "businessValue": {
    "businessImpact": {
      "skala": 20,
      "beschreibung": "Adressierung des Business und Company Festnetzportfolio mit Umsatzeffekten von > 6.000 T€ durch Upselling in die Pakete Comfort und Advanced."
    },
    "strategicEnablement": {
      "skala": 13,
      "beschreibung": "Schaffung eines USP am Markt durch in den Festnetzanschluss integrierte Cyber-Sicherheits-Features, was einen relevanten Wettbewerbsvorteil darstellt."
    },
    "timeCriticality": {
      "skala": 1,
      "beschreibung": "Geplanter Umsetzungszeitraum: Start 01.07.2025, Ende 30.09.2025, Launch Basic Q4 2025, Comfort Q4 2025, Advanced Q2 2026."
    }
  },
  "funktionen": [
    {
      "id": "BEMABU-2266",
      "titel": "OnNet Security - Fixed - Comfort/Advanced Package - Touchpoints",
      "funktionalitäten": [
        "Comfort-Paket mit individuellen Beratungsleistungen, die über das SecurityPortal konfiguriert und abgerufen werden können",
        "Advanced-Paket mit individuellem Schutz für Endgeräte und konfigurierbaren Blocking-Profilen",
        "Implementierung eines SecurityGateways (Network Firewall) zur Analyse und Filterung des Kundentraffics",
        "Tunnelverbindung von Endgeräten zum SecurityGateway mit zusätzlicher Applikation",
        "Konfigurationsmöglichkeiten für Security-Pakete durch Kunden",
        "Anbindung verschiedener Kunden-Touchpoints (MMKC 2.0, OneShop, BSPClassic, OneApp)",
        "Anbindung von Service-Touchpoints (MagentaView)",
        "Integration mit Sales-Channels (Flamingo, SeceIT, T-VPP, TCK, BPP, MagentaForce)",
        "Berücksichtigung der Glasfaser-Kette (AVIA)"
      ]
    },
    {
      "id": "TDGM-440",
      "titel": "B2B OnNet Security - Fixed - Comfort/Advanced Package",
      "funktionalitäten": [
        "Umsetzung der OnNet Security Fixed Comfort/Advanced Pakete für B2B-Kunden"
      ]
    }
  ],
  "acceptance_criteria": [
    "Mit dem Comfort Paket bekommt jeder Kunde individuelle Beratungsleistungen, die er via SecurityPortal konfigurieren und abrufen kann.",
    "Mit dem Advanced Paket bekommt jeder Kunde einen individuellen Schutz für seine End-Geräte, d.h. die Blocking-Profile können individuell konfiguriert werden.",
    "Die Latenzzeiten welche durch Analyse des Datenverkkehrs entsteht darf nicht die Nutzung der Data und Voices Services beeinträchtigen",
    "Die Kunden müssen die notwendige Konfigurationen des Security Paketes durchführen können",
    "Das Comfort und Advanced Paket werden als kostenpflichtige Pakete angeboten.",
    "Die Comfort und Advanced Pakete können unabhängig vom Festnetz Tarif gebucht werden.",
    "Comfort und Advanced Pakete werden als separate BMP realisiert.",
    "Comfort/Advanced Pakete müssen als neue Produkte abgebildet werden und der Kunde muss diese buchen und managen können.",
    "MMKC 2.0 - Verlinkung zu dem Security Portal, in dem die Leistungen von dem Comfort/Advanced Produkt abgerufen werden können.",
    "OneShop - Buchung von neuem BMP. Noch offen: Kündigung BMP",
    "BSPClassic - Verlinkung zu dem Security Portal, in dem die Leistungen von dem Comfort/Advanced Produkt abgerufen werden können, durch die Kunden, die BSP Classic nutzen (z.B. CoFlex Kunden)",
    "MagentaView - Portal für DT Service, um die Ansicht zu dem Kundenbestand zu haben und Konfigurationen am Sec Comfort/Advanced Paket vorzunehmen bzw. Bestand zu ändern.",
    "Flamingo - Vertragsverwaltung inkl. BMP Zubuchung/Abbuchung durch Vertrieb",
    "SeceIT - Vertragsverwaltung inkl. BMP Zubuchung/Abbuchung durch Vertrieb",
    "T-VPP - Vertragsverwaltung inkl. BMP Zubuchung/Abbuchung durch Partner-Vertriebssysteme",
    "TCK - Übersetzung Produktdaten aus Prima+ für T-VPP",
    "BPP / Angebotskonfigurator - Vertragsverwaltung inkl. BMP Zubuchung/Abbuchung durch Partner-Vertriebe",
    "MagentaForce - Vertragsverwaltung inkl. BMP Zubuchung/Abbuchung durch Vertrieb",
    "AVIA - Auswirkungen von OnNet Sec Comfort/Advanced auf AVIA Kette, genauer noch zu definieren",
    "Sicherstellung der Entstörbarkeit eines Festnetzanschlusses mit aktiviertem Security Paket",
    "Notwendige AfterSales und Beratungs Prozesse für die Security Pakete"
  ],
  "domainsAndITApplications": [
    "Flamingo (DOM0201)",
    "EOS (DOM0201)",
    "O3 (DOM0201)",
    "SECEIT (DOM0201)",
    "MMKC 2.0",
    "OneShop",
    "BSPClassic",
    "OneApp",
    "MagentaView",
    "T-VPP",
    "TCK",
    "BPP / Angebotskonfigurator",
    "MagentaForce",
    "AVIA",
    "SDSB"
  ],
  "abhängigkeitenUndRisiken": [
    "Abhängigkeit von Magenta OnNet Security Mobile - MVP",
    "Abhängigkeit von Magenta OnNet Security RFQ",
    "Abhängigkeit von Fiber-Ressourcen",
    "Abhängigkeit von IT und Prozess Ressourcen",
    "Abhängigkeit von NonStopNetz - Bugfixing und Nacharbeiten",
    "Abhängigkeit von NonStopNetz - Nachlieferung Voice Backup",
    "Risiko: Latenzzeiten durch Datenverkehrsanalyse könnten Services beeinträchtigen",
    "Risiko: Komplexität der Integration mit zahlreichen Touchpoints und Systemen",
    "Risiko: Zeitliche Verzögerungen durch viele Abhängigkeiten"
  ],
  "zeitplan": {
    "umsetzungsstart": "2025-07-01",
    "umsetzungsende": "2026-09-30",
    "fixVersions": ["Q3_25"],
    "meilensteine": [
      {
        "id": "Basic-Launch",
        "beschreibung": "Launch des Basic Pakets",
        "zeitraum": "Q4 2025"
      },
      {
        "id": "Comfort-Launch",
        "beschreibung": "Launch des Comfort Pakets",
        "zeitraum": "Q4 2025"
      },
      {
        "id": "Advanced-Launch",
        "beschreibung": "Launch des Advanced Pakets",
        "zeitraum": "Q2 2026"
      }
    ]
  }
}
```