{
  "epicId": "BEMABU-1869",
  "title": "FTTH Solution by LE - FTTH Infrastruktur",
  "ziele": {
    "gesamtziel": "Entwicklung eines Prozesses für die FTTH-Infrastruktur und eines FTTH-Projekttools (FIB-Tool), wodurch der Bau der Infrastruktur anhand des jeweiligen Ausbaustatus überwacht wird, damit im Großkundenumfeld die gewünschte Infrastruktur im Zuge des generellen FTTH-Ausbaus berücksichtigt wird und nicht GK-Standorte außen vor bleiben. Das Vorhaben schafft skalierbare Plattformen, auf denen sich GK-Lokationen beim FTTH-Ausbau einbeziehen lassen. Die Umsetzung ist bis Q3/25 geplant.",
    "einzelziele": [
      "Implementierung eines FIB-Tools (FTTH Infrastructure Building) mit grundlegenden Funktionen zur Standortverwaltung und KLS-Validierung (Q4/24)",
      "Erweiterung des FIB-Tools um Schnittstellen zu PreOrder@Cloud und POM/IDB für Verfügbarkeitsabfragen und Interessentenmanagement (Q1/25)",
      "Integration des FIB-Tools in PANDA-Workflow und Daten (Q2/25)",
      "Implementierung von Infrastrukturbestellfunktionen über GIGA GS (Q2-Q3/25)",
      "Entwicklung von ServiceNow-Integration und Usability-Verbesserungen (Q3/25)",
      "Bereitstellung einer Interimslösung zur Übermittlung von FTTH-Interessenten an die Technik (Q4/24)"
    ]
  },
  "businessValue": {
    "businessImpact": {
      "skala": 0,
      "beschreibung": "Keine Informationen verfügbar"
    },
    "strategicEnablement": {
      "skala": 0,
      "beschreibung": "Keine Informationen verfügbar"
    },
    "timeCriticality": {
      "skala": 0,
      "beschreibung": "Keine Informationen verfügbar"
    }
  },
  "funktionen": [
    {
      "id": "SDN-20787",
      "titel": "FTTH_FIB-Tool Implement the Basics (Q4/24)",
      "funktionalitäten": [
        "Aufbau einer zentralen Standortdatenbank für FIB zur Speicherung von Kundenstandorten nach AGP/GP ID",
        "Anzeige von Standorten in der Datenbank pro Kunde und Möglichkeit, diese zu einem FIB-Projekt/Angebot hinzuzufügen",
        "Manuelle Hinzufügung von Standorten über inkrementelle Eingabe, KLS-Suche oder Freitextsuche",
        "Excel-Upload und -Download von Standortdaten mit Unterstützung für große Datenmengen",
        "KLS-Validierung für nationale Standorte mit automatischer Ergänzung von KLS-Daten (KLS ID, ONKZ, ASB, Google Maps)",
        "Prüfung auf Dubletten bei hinzugefügten Standorten",
        "Filter- und Anpassungsfunktionen für die FIB-Benutzeroberfläche"
      ]
    },
    {
      "id": "SDN-20788",
      "titel": "FTTH_FIB-Tool Design Package 2 (Q4/24)",
      "funktionalitäten": [
        "UX-Design für Standortverwaltung (Import, Export, KLS, Projektkenner)",
        "UX-Design und Prozessworkflow innerhalb von FIB für Standortverwaltung, Verfügbarkeitsabfrage, Eintrag in Technik-Interessentendatenbank, Quality Gate für Status \"VVMongoing\", HTN-Erfassung, Bestellprozesse und Benachrichtigungen",
        "UX-Design für Usability-Funktionen (Vorschläge, Fehler- und Dubletten-Behandlung)",
        "Überprüfung der API für technische Integration mit PreOrder@Cloud (TMF 645)",
        "Überprüfung der API für technische Integration mit GIGA (TMF 641)",
        "Überprüfung der API für Landlord-Portal bei GIGA",
        "Analyse zur Nutzung der Standorte im FIB für CPQ-Konfiguratoren"
      ]
    },
    {
      "id": "SDN-20907",
      "titel": "FTTH_Interims solution send FTTH interests (Q4/24)",
      "funktionalitäten": [
        "Erweiterung der Auswahl für \"Verfügbarkeit abfragen\" um Button \"FTTH-Interessen senden\"",
        "Eingabe einer FMB-E-Mail-Adresse pro Standort als Pflichtfeld für die Übermittlung an POM",
        "Übermittlung ausgewählter Standorte (einzeln und Masse) an POM (Technik) zur Benachrichtigung über Kundeninteresse für FTTH-Ausbauplanung",
        "Speicherung einer Erfolgsmeldung über den Datenversand in PANDA für den Benutzer",
        "Unterstützung für den Versand von mindestens 1500 Standorten in einer Anfrage",
        "Tägliche Statusprüfung durch POM und E-Mail-Benachrichtigung bei Statusänderung zu \"VVMongoing\""
      ]
    },
    {
      "id": "SDN-22480",
      "titel": "FTTH_FIB-Tool concept and implementation further requirements (Q1/25)",
      "funktionalitäten": [
        "Verfügbarkeit des FIB-Tool-Konzepts und Login über Panda-Microservices",
        "GUI-Funktionalität ähnlich der Panda-Standortlösung",
        "Button und Funktionalität für manuellen Upload von Standortdaten zu POM",
        "Button und Funktionalität für manuelle Aktualisierung markierter Standorte mit PreOrder@Cloud-Daten",
        "Import aller angeforderten Attribute aus TMF645 in das FIB-Tool",
        "Automatische Aktualisierung von PreOrder@Cloud bei Excel-Import oder manueller Änderung von Standortdaten",
        "Möglichkeit zur manuellen Datenaktualisierung über Button für markierte Standorte",
        "Automatische Aktualisierung über PreOrder@Cloud-Schnittstelle bei Standortaktualisierung über POM-Schnittstelle",
        "Upload von Standortdaten über FIB-Tool-Excelformat zu POM",
        "Konzept für POM-Rückschnittstelle zur Übertragung der Ergebnisse in die FIB-DB",
        "Anzeige täglicher Updates von POM in der GUI"
      ]
    },
    {
      "id": "SDN-22481",
      "titel": "FTTH_FIB-Tool concept and implementation GUI, location mgt & IDB topics (Q2/25)",
      "funktionalitäten": [
        "Nahtlose Verbindung zwischen dem Tool, das das FIB-Tool aufruft (derzeit PANDA), auf Basis der EntraID und der für den Benutzer festgelegten Rechte",
        "Unterstützung des Golive des FIB-Tools mit Bereitstellung in UAT, Migrationstest, Interface-Vereinbarungen und Rollout-Plan",
        "Implementierung der TechPOM-Schnittstelle für Verfügbarkeitsabfragen und Interessentenmanagement",
        "Erweiterung der PreOrder@Cloud-Schnittstelle um zusätzliche Daten",
        "Integration des FIB-Tools in den PANDA-Workflow und die Daten",
        "Implementierung eines Event-Mechanismus für die TechPOM-Schnittstelle",
        "Automatisches Hinzufügen von Standorten in FIB",
        "Implementierung von Änderungsprotokoll und Usability-Funktionen"
      ]
    },
    {
      "id": "SDN-24218",
      "titel": "FTTH_FIB-Tool concept implementation infrastructure order topics (Q2/25)",
      "funktionalitäten": [
        "Konzeption und Implementierung der Schnittstelle zu GIGA GS für Infrastrukturbestellungen",
        "Konzeption und Implementierung von Schnittstellen zur Aktualisierung der FIB-Tool-Daten (Standortstatusänderungen)",
        "Design-Anforderungen für Infrastrukturbestellung mit Prozess zur Auswahl eines spezifischen GFTA für einen spezifischen Posten",
        "Abbildung des manuellen NIMBUS-Prozesses im UX-Design",
        "Klärung der Anforderungen für Infrastrukturbestellung einschließlich Voraussetzungen vom FTTH-Produkt in PANDA",
        "Entscheidung über die zu verwendende Schnittstelle für die Bestellung in GIGA für Standardbauweise",
        "Evaluierung von TMF641 bezüglich der an GIGA zu sendenden Daten für eine Bestellung"
      ]
    },
    {
      "id": "SDN-24358",
      "titel": "FTTH_FIB-Tool implementation infrastructure order GIGA GS topics (Q3/25)",
      "funktionalitäten": [
        "Anforderungen für das FIB-Tool bezüglich der Fähigkeit zur Infrastrukturbestellung, deren Konzept und Implementierung in Q3/2025 erfolgen soll",
        "Themen im Zusammenhang mit der Infrastrukturbestellung über GIGA GS"
      ]
    },
    {
      "id": "SDN-25384",
      "titel": "FTTH_FIB-Tool SNP ServiceNow & usability & GoLive topics (Q3/25)",
      "funktionalitäten": [
        "Erweiterung des Änderungsprotokolls zur Anzeige von Änderungen in Adressdaten",
        "Behandlung des deutschen \"Straße\" als \"Str.\" für die KLS-Integration",
        "Anzeige eines Hinweises für Kupferverfügbarkeit",
        "Vorbereitung des FIB-Tools für den Rollout mit abgestimmter Funktionalität"
      ]
    },
    {
      "id": "SDN-22913",
      "titel": "IT Enabler Integration FTTH and FIB Tool into our architecture",
      "funktionalitäten": [
        "Vorbereitung der CaaS-Infrastruktur (UAT & Prod-Umgebung) für die FIB-Microservices",
        "Bestellung und Bereitstellung der benötigten Postgres-DBaaS",
        "Erstellung und Funktionsfähigkeit des Helm-Charts für FIB",
        "Integration des Deployments über das Panda-Deploy-Repository",
        "Vorbereitung von Schnittstellen für Q1/25"
      ]
    }
  ],
  "acceptance_criteria": [
    "Build central location database for FIB to store customer's locations: Customer's locations are stored according to a customer AGP/GP ID",
    "Customer's locations are stored according to a customer AGP/GP ID",
    "Locations in the database per customer can be viewed and added to a FIB project/offer => should be possible with an order ??? Ist das ein Thema für ServiceNow (dieses Thema kommt später) => Abstimmung FS / Realisierung notwendig Customer's locations are shown according to a quote/oppty (if already set up)",
    "Customer's locations are shown according to a quote/oppty (if already set up)",
    "Locations can be added by the user in a fronted: manually (via incremental, KLS search or free text search) excel Upload (inkl. Nachladefunktion, Behandlung von Kunden mit mehr als 15T Standorten (z.B. Siemens mit 40T Standorten) Information für User hinsichtlich max. Anzahl von Standortorten pro Upload / Fehlermeldung / Abbruch / Lösungshinweis geben => es gibt vermutlich keine Limitierung hinsichtlich Anzahl Standorteanzahl, es dauert halt vermutlich dann nur länger * For national Site a KLS validation is done. The KLS data (KLS ID, ONKZ, ASB, Google Maps)  is added accordingly. When locations are added uploaded, the KLS validation is done via the upload. If a national cannot be found within KLS, the location is added at the top of the location list (red) * Excel Download of existing FIB Data can be done * Added locations are checked for dublettes. A location is a dublette if following information are already available in the database. => eine Dublette liegt dann vor, wenn eine Adresse an einer  aGP-ID bereits vorhanden ist. Eine Adresse mit unterschiedlichen aGP-ID's ist keine Dublette, Umgang mit Dubletten beschreiben * attributes of uploaded locations can be edited => editierbare Attribute definieren * Filter and customize function is implemented on the GUI for FIB usability purpose Link Excel: https://telekom.sharepoint.de/:x:/r/sites/B2B_OfferManagementSolution_all/_layouts/15/Doc.aspx?sourcedoc=%7B4B85D3F7-9485-4DFD-A83F-E1C68A14985B%7D&file=FIB%20Tool%20Daten.xlsx&action=default&mobileredirect=true Link UX Design: https://miro.com/app/board/uXjVKk4uJGA=/ NFRs Upload locations * 0-100 locations - Upload 10 seconds * 100-1000 locations - Upload 1 Minutes * 1000-5.000 locations -  Upload 2 Minutes * 5000-10000 locations - Upload 3 Minutes * 10.000-15.000 locations -  Upload 5 Minutes => Wartescreen für Benutzer ab wann, Umgang mit Massenupload in FIB => vermutlich nicht nötig, mehr Standorte dauern einfach nur länger",
    "manually (via incremental, KLS search or free text search)",
    "excel Upload (inkl. Nachladefunktion, Behandlung von Kunden mit mehr als 15T Standorten (z.B. Siemens mit 40T Standorten)",
    "Information für User hinsichtlich max. Anzahl von Standortorten pro Upload / Fehlermeldung / Abbruch / Lösungshinweis geben => es gibt vermutlich keine Limitierung hinsichtlich Anzahl Standorteanzahl, es dauert halt vermutlich dann nur länger * For national Site a KLS validation is done. The KLS data (KLS ID, ONKZ, ASB, Google Maps)  is added accordingly. When locations are added uploaded, the KLS validation is done via the upload. If a national cannot be found within KLS, the location is added at the top of the location list (red) * Excel Download of existing FIB Data can be done * Added locations are checked for dublettes. A location is a dublette if following information are already available in the database. => eine Dublette liegt dann vor, wenn eine Adresse an einer  aGP-ID bereits vorhanden ist. Eine Adresse mit unterschiedlichen aGP-ID's ist keine Dublette, Umgang mit Dubletten beschreiben * attributes of uploaded locations can be edited => editierbare Attribute definieren * Filter and customize function is implemented on the GUI for FIB usability purpose Link Excel: https://telekom.sharepoint.de/:x:/r/sites/B2B_OfferManagementSolution_all/_layouts/15/Doc.aspx?sourcedoc=%7B4B85D3F7-9485-4DFD-A83F-E1C68A14985B%7D&file=FIB%20Tool%20Daten.xlsx&action=default&mobileredirect=true Link UX Design: https://miro.com/app/board/uXjVKk4uJGA=/ NFRs Upload locations * 0-100 locations - Upload 10 seconds * 100-1000 locations - Upload 1 Minutes * 1000-5.000 locations -  Upload 2 Minutes * 5000-10000 locations - Upload 3 Minutes * 10.000-15.000 locations -  Upload 5 Minutes => Wartescreen für Benutzer ab wann, Umgang mit Massenupload in FIB => vermutlich nicht nötig, mehr Standorte dauern einfach nur länger",
    "For national sites: expand selection for \"request availability\" to button \"send FTTH interests\" Email always FMB needs to be entered per locations and is mandatory in order to send locations via POM selected locations (single and mass) - only DE - will be send to POM (technic) in order to notify technic about a site interests by customer for ther FTTH rollout plans success notification about data load will be saved within PANDA for the user",
    "expand selection for \"request availability\" to button \"send FTTH interests\"",
    "Email always FMB needs to be entered per locations and is mandatory in order to send locations via POM",
    "selected locations (single and mass) - only DE - will be send to POM (technic) in order to notify technic about a site interests by customer for ther FTTH rollout plans",
    "success notification about data load will be saved within PANDA for the user",
    "NFRs: at least 1500 sites shell be send within one request",
    "location data (which where imported via Panda Excelformat) can be uploaded to POM",
    "POM is daily checking the status of the location and sends update via mail when location status >= VVMongoing",
    "Generate UX Design for location management (Import, Export, KLS, Projektkenner)",
    "Generate UX Design and process workflow within FIB, including: location management request fibe availability status Entry in technik database of interested parties Quality gate for state \"VVMongoing\" Anstoß der HTN Erfassung Order removal, comply with HTN if necessary Order Standardbauweise or additional GF-TAs if necessary Order notifications/updates",
    "Generate a UX Design for needed usability functions (Suggestion, error and duplicate handling etc.)",
    "Review API for technical integration for Preorder@cloud TMF 645 (for 2)",
    "Review API for technical integration with GIGA TMF 641 (for 7)",
    "Anbindung Landlord Portal bei GIGA (before 5)",
    "Review APIs for technical integration of FIB Tool",
    "Analyze how to use the locations in the FIB for the cpq configurators",
    "Concept FIB-Tool is available and logon via Panda microservices is possible",
    "GUI functionality is similar to Panda location solution available",
    "Button and functionality for manual upload of location data to POM is available",
    "Button and functionality for manual update of marked location with PreOrder@Cloud date is available",
    "all requested attributes, which currently available in TMF645, will be imported into the FIB-Tool übernommen (details see https://wiki.telekom.de/display/B2BSOM/Schnittstelle+PreOrder+at+Cloud)",
    "when location data via Excel are imported into the FIB-Tool or when data in the GUI are added/corrected, an automatic update from PreOrder@Cloud will be done",
    "location could be marked in the GUI and via button there is a manuell data update possible",
    "if there is an location update from POM-interface belonging data records will be also automatically updated via PreOrder@cloud interface",
    "location data can be uploaded via FIB-Tool Excelformat to POM",
    "concept for POM reverse interface is connected to FIB Tool to get the results into FIB-DB",
    "daily updates from POM will be marked / shown in the GUI",
    "the user can work seamlessly, changing from SAP CPQ to the FIB Tool (the locations tab) back and forth",
    "The authentication is handed over (see logs)",
    "The FIB tool is deployed in UAT and ready to be tested",
    "A migration test in done in UAT",
    "Interface Agreements are up to date and ready to be signed",
    "Testcases are in place to support the BUT",
    "Approvals (Workers' Council, SDSK) are done",
    "a rolloutplan is ready to be executed in July including migration from CPQ",
    "Interface to TechPOM is implemented: locations with FTTH status notplanned, areaplanned can be sent to the TechPOM",
    "A validation is in place that validates if mandatory fields are filled for the Interface to TechPOM (if not, show hint)",
    "The request date is added to the db and can be shown via mouseover in the respective column",
    "The instante reply by TechPOM (unique ID) is added to DB and shown in FE",
    "An event handling is in place that enables FIB to receive an event when the location FTTH status is changing to \"VVMongoing\"",
    "For operational use, approximately 50,000 address queries per day are expected.",
    "Responding to queries by the next business day is sufficient, meaning all requests can be received and answered during off-peak hours.",
    "Additionally, the NFR (Non-Functional Requirements) of TMF-645 should apply.",
    "The new version of the interface is implemented",
    "Addtionally to the FTTH status, the FTTH columns in the table are filled automatically upon creating a location with Coutrycode = DE",
    "the Mobile Status is filled too along with the FTTH columns",
    "manual update is possible",
    "Integrate FIB Tool into the PANDA workflow it can be retrieved",
    "it can be retrieved",
    "The necessary infrastructure data for a company access site configuration are send from FIB to PANDA FTTH",
    "FTTH",
    "The FIB infrastructure data of a site are shown according to the Click-dummy within the PANDA GUI when selected Figma link: https://www.figma.com/design/ZcXl4W55z31REKQaUCDSmc/FIB-tool?node-id=3003-13&p=f&t=MRKdL5MnBnRHukwE-0",
    "Figma link: https://www.figma.com/design/ZcXl4W55z31REKQaUCDSmc/FIB-tool?node-id=3003-13&p=f&t=MRKdL5MnBnRHukwE-0",
    "An event handling is in place that enables FIB to receive an event when the location FTTH status is changing to \"VVMongoing\"",
    "Automatic update of the FTTH states and columns when respective event is received from TechPOM",
    "When PANDA (CPQ or Integrated Offer Cart) gets locations connected to an AGP or a Quote from an external source, a check is done, if the locations are already added to the AGP",
    "If they are already available in the AGP, they are added to the quote",
    "If they are not yet added to the AGP, they are added to the AGP and the Quote.",
    "If they are freshly added, the KLS check is run and the FTTH status is requested automatically",
    "AC1  The solution is found and described to update the FTTH status regularely",
    "AC2 A UX design is in place and aligned with the users to copy a location with adjusted additional adress data (building, floor, room)",
    "AC1 It is possible to filter in all Columns of the FIB tool over the complete list for Customer or Quote, not only over one page.",
    "AC2 The paging is implemented acc. to UX requirements",
    "AC3 The user can show or hide the columns in the FIB Tool acc to FIGMA Screens",
    "AC4 The user can move complete blocks by moving the headline to the right or left according to FIGMA Screens",
    "AC5 Hints are added according to FIGMA Screens",
    "AC6 KLS Fuzzylogic is used for errors in DE-locations",
    "AC7 A Changelog (Changes since...) is offered to the user",
    "The Change Log is enhanced to also show changes in address data",
    "the handling of the german \"Straße\" as \"Str.\" for the KLS integration is handled",
    "A hint is shown for Copper Availability",
    "AC1 The process to choose a specific GFTA for a specific lineitem is ready for implementation",
    "AC2 The NIMBUS manual process is reflected in the UX design",
    "AC3 Initial requirements for infrastructure order are clear including prerequisites from FTTH product in PANDA",
    "AC4 A decision is met which interface will be used to set the order in GIGA for Standardbauweise",
    "AC5 TMF641 is evaluated on the question which data needs to be sent to GIGA in order to place an order",
    "CaaS infrastructure (dev & EAT environment) has been prepared for FIB MS (firewall, resource quotas, Network policies etc, Dynatrace integration)",
    "Order and provision Postgres DBaaS",
    "Helm chart for FIB has been created and is fully functional",
    "Deployment via panda-deploy repository is integrated",
    "Feedback from Vega Team that everything is working as intended.",
    "Build central location database for FIB to store customer's locations: Customer's locations are stored according to a customer AGP/GP ID",
    "Customer's locations are stored according to a customer AGP/GP ID",
    "Locations in the database per customer can be viewed and added to a FIB project/offer Customer's locations are shown according to a quote/oppty (if already set up)",
    "Customer's locations are shown according to a quote/oppty (if already set up)",
    "Locations can be added by the user in a fronted: manually (via incrementell, KLS search or free text search) excel Upload",
    "manually (via incrementell, KLS search or free text search)",
    "excel Upload",
    "For national Site a KLS validation is done. The KLS data (KLS ID, ONKZ, ASB, Google Maps)  is added accordingly. When locations are added uploaded, the KLS validation is done via the upload. If a national cannot be found within KLS, the location is added at the top of the location list (red)",
    "Excel Download of existing FIB Data can be done",
    "Added locations are checked for dublettes. A location is a dublette if following information are already available in the database.",
    "attributes of uploaded locations can be edited",
    "Filter and customize function is implemented on the GUI for FIB usability purpose",
    "0-100 locations - Upload 10 seconds",
    "100-1000 locations - Upload 1 Minutes",
    "1000-5.000 locations -  Upload 2 Minutes",
    "5000-10000 locations - Upload 3 Minutes",
    "10.000-15.000 locations -  Upload 5 Minutes",
    "Generate a UX Design for needed usability functions (Suggestion, error and dublicate handling etc.)",
    "Generate UX Design for location management (Import, Export, KLS)",
    "Generate UX Design and process workflow within FIB, including: location management request fibe availability status Entry in technik database of interested parties Order removal, comply with HTN if necessary Order additional GT-TAs if necessary Order notifications/updates",
    "Review API for technical integration for Preorder@cloud",
    "Review APIs for technical integration of FIB Tool",
    "Analyze how to use the locations in the FIB for the cpq configurators",
    "For national sites: expand selection for \"request availability\" to button \"send FTTH interests\" Email always FMB needs to be entered per locations and is mandatory in order to send locations via POM selected locations (single and mass) - only DE - will be send to POM (technic) in order to notify technic about a site interests by customer for ther FTTH rollout plans success notification will be saved within PANDA for the user Add new Field \"CRMT-Number\" to the table, this is mandatory for sending data to TechPOM The button to use the interface should only be available to dedicated users that are previously announced",
    "expand selection for \"request availability\" to button \"send FTTH interests\"",
    "Email always FMB needs to be entered per locations and is mandatory in order to send locations via POM",
    "selected locations (single and mass) - only DE - will be send to POM (technic) in order to notify technic about a site interests by customer for ther FTTH rollout plans",
    "success notification will be saved within PANDA for the user",
    "Add new Field \"CRMT-Number\" to the table, this is mandatory for sending data to TechPOM",
    "The button to use the interface should only be available to dedicated users that are previously announced",
    "NFRs: at least 1500 sites shell be send within one request",
    "Interface to Preorder@Cloud is implemented and automatically triggered upon creating a location with KLS ID",
    "manual update is possible",
    "Automatic update of the FTTH states and columns when respective event is received from TechPOM",
    "The field FTTH Status is filled/updated by the interface for the time being",
    "Integrate FIB Tool into the PANDA workflow it can be retrieved",
    "it can be retrieved",
    "The necessary infrastructure data for a company access site configuration are send from FIB to PANDA FTTH",
    "FTTH",
    "The FIB infrastructure data of a site are shown according to the Click-dummy within the PANDA GUI when selected Invision link:",
    "Invision link:",
    "On Excel Upload start GAM Service and get geolocation data",
    "When KLS is not directly available due to typos and missing mandatory data, show possible corrections (from the fuzzy search) in the FE",
    "Integrate the GAM service for the manual adding of locations",
    "CaaS infrastructure (UAT & Prod environment) has been prepared for the FIB Microservices (firewall, resource quotas, Network policies etc, Dynatrace integration)",
    "Needed order and provision Postgres DBaaS done",
    "Helm chart for FIB has been created and is fully functional",
    "Deployment via panda-deploy repository is integrated",
    "Feedback from Vega Team that everything is working as intended.",
    "Stories for Dev Teams are collected in this Epic"
  ],
  "domainsAndITApplications": [
    "PANDA",
    "FIB-Tool",
    "PreOrder@Cloud",
    "POM/IDB",
    "GIGA GS",
    "KLS",
    "ServiceNow",
    "GAM",
    "TMF645",
    "TMF641",
    "CaaS",
    "PostgreSQL DBaaS",
    "Tardis",
    "SAP CPQ",
    "B2BOC"
  ],
  "abhängig