{
  "epicId": "BEMABU-2209",
  "title": "LE - Email-Content (Weiterentwicklung EMU)",
  "ziele": {
    "gesamtziel": "Weiterentwicklung der Email-Content Erstellung (EMU) mit einem Framework gemäß CI/CD Konzernrichtlinien, integrierten Nominierungsprozess aus MagentaForce und Trigger-Journey. Ziel ist ein nutzerfreundliches Handling ohne HTML-Sprache zur Content-Aufbereitung ohne externe MMS-Kosten. Die Umsetzung ist für den Zeitraum 01.07.2025 bis 30.09.2025 geplant.",
    "einzelziele": [
      "Die Journeys sind state of the art und erfüllen die Kundenerwartungen in Handling, Nutzung, Einfachheit in der Bedienung und Usability",
      "Nutzung eines zentralen Tools zum Ausspielen von E-Mails der Vertriebskanäle",
      "Steigerung der Kundenzufriedenheit durch Bereitstellung funktionierender und relevanter Journeys",
      "Kosteneinsparung bei Ressourcen/FTE für Content-Realisierung über die Marketing-Abteilung",
      "Effizienzsteigerung im Kampagnenmanagement",
      "Self-Service für Mailvorlagen, die den CI/CD-Richtlinien entsprechen ohne HTML-Kenntnisse zu erfordern"
    ]
  },
  "businessValue": {
    "businessImpact": {
      "skala": 8,
      "beschreibung": "Erhöhung der Leadmenge auf ca. 5% im Durchschnitt. Umsatzpotenzial < 1.000 T€, Kosteneinsparung < 250 T€, Risikovermeidung < 250 T€."
    },
    "strategicEnablement": {
      "skala": 8,
      "beschreibung": "Skills liegen in Fachbereichen. Abstimmungen zwischen den Agenturen werden seltener – Ressourcen + Zeitersparnis. Mehr Kundenkontakt – beim gleichen Budget. Erhöht die Kundenerfahrung/-bindung oder das TD-Image in besonderem Maße durch Prozessvereinfachung."
    },
    "timeCriticality": {
      "skala": 8,
      "beschreibung": "Geplanter Umsetzungszeitraum Plan Start: 01.07.2025"
    }
  },
  "funktionen": [
    {
      "id": "MAGBUS-93465",
      "titel": "LE: Marketing_Email-Content",
      "funktionalitäten": [
        "Bereitstellung von Mailvorlagen für Seller innerhalb einer Kampagne",
        "Automatische Hinzufügung des ASP-Kunden als Kampagnenmitglied bei Nutzung der Mailvorlage",
        "Auswahl der Mailvorlage bei Nominierung des ASP-Kunden und Setzen des Status auf 'gesendet'",
        "Individuelle Anpassung der Mailvorlage nach Bedarf",
        "Versand im Namen des Sellers",
        "Prüfung der Email-Permission bei Email-Nominierung an die Magenta-Cloud mit Fehlermeldung bei fehlender Permission",
        "Email-Reporting (Nutzerverhalten, Öffnung, etc.) am ASP-Kunden mit Verknüpfung zur Kampagne/Mailvorlage",
        "Import von CI/CD-konformen Mailvorlagen als Anlage in MagentaForce",
        "Self-Service für Mailvorlagen gemäß CI/CD-Richtlinien ohne HTML-Kenntnisse"
      ]
    }
  ],
  "acceptance_criteria": [
    "Erstellung einer nutzerfreundlichen Email-Content (ohne HTML)",
    "Erstellung im Einklang CI/CD (Telekom Framework)",
    "Möglichkeit Email-Content Versand über Trigger, Excel-Import und als Mailvorlage in MagentaForce",
    "Nominierungsprozess aus MagentaForce",
    "Individueller und personalisierter Email Versand",
    "Reporting (PowerBI)"
  ],
  "domainsAndITApplications": [
    "MarketingCloud DOM0201",
    "MagentaForce DOM0201"
  ],
  "abhängigkeitenUndRisiken": [
    "Abhängigkeit von CI/CD-konformen Mailvorlagen, die meist von Agenturen eingekauft werden müssen",
    "Risiko durch fehlende HTML-Fähigkeiten der meisten Nutzer",
    "Komplexität des Email-Lightning-Tools wird als zu hoch eingestuft",
    "Das Business Epic ist im Status 'Funnel', während das zugehörige Epic bereits 'Closed' ist - mögliche Inkonsistenz in der Planung",
    "Zeitliche Diskrepanz: Das Business Epic ist für 2025 geplant, während das zugehörige Epic bereits abgeschlossen ist"
  ],
  "zeitplan": {
    "umsetzungsstart": "2025-07-01",
    "umsetzungsende": "2025-09-30",
    "fixVersions": [],
    "meilensteine": []
  }
}