```json
{
  "epicId": "BEMABU-2254",
  "title": "SAP 002 Kundenummer beantragen für ISS 1.2 u. AcM TK/IT/MK/IoT",
  "ziele": {
    "gesamtziel": "Erweiterung der Funktionalität 'SAP002 Kundenummer beantragen' bei der Stammdatenbearbeitung für die Rollen 'GK-Midmarket Inside Sales 1 (Hunting), GK-Midmarket Inside Sales 2 (Farming), GK-AcM TK, IoT, IT, MK', um eine effizientere Pflege der Kundendaten sicherzustellen. Die Umsetzung ist für den Zeitraum vom 01.07.2025 bis 30.09.2025 geplant.",
    "einzelziele": [
      "Verbesserung der Kundenbindung durch eine optimierte Pflege von Kundendaten",
      "Steigerung der Effizienz und Benutzerfreundlichkeit für Inside Sales 1, 2 und AcM TK/IoT/MK/IT",
      "Entlastung des AcM1 und AcM2 zur Schaffung von vertriebsaktiver Zeit"
    ]
  },
  "businessValue": {
    "businessImpact": {
      "skala": 20,
      "beschreibung": "Umsatzsteigerung von 1-2 Mio € und Kosteneinsparung von 1-2 Mio € p.a. durch selbständige Beauftragung der Rollen und Entlastung des AcM1 und AcM2. Im Segment Midmarket gibt es über 219.000 Kunden, davon 50.000 ohne SAP-002 Kundennummer. Monatlich werden ca. 40 Anlagen erstellt, was zu 480 neuen SAP 002 Kundenummern p.a. führt (11.520 h p.a. bei 24h pro Anlage)."
    },
    "strategicEnablement": {
      "skala": 3,
      "beschreibung": "Strategischer Nutzen durch Reduktion von fehlerhaften D!VE-Auftragsprozessierungen"
    },
    "timeCriticality": {
      "skala": 13,
      "beschreibung": "Geplanter Umsetzungszeitraum mit noch zu bestimmendem Start und Ende/Launch"
    }
  },
  "funktionen": [
    {
      "id": "BEMABU-2254",
      "titel": "SAP 002 Kundenummer beantragen für ISS 1.2 u. AcM TK/IT/MK/IoT",
      "funktionalitäten": [
        "Funktionalität 'SAP002 Kundenummer beantragen' bei der Stammdatenbearbeitung für die Rollen GK-Midmarket Inside Sales 1 (Hunting)",
        "Funktionalität 'SAP002 Kundenummer beantragen' bei der Stammdatenbearbeitung für die Rollen GK-Midmarket Inside Sales 2 (Farming)",
        "Funktionalität 'SAP002 Kundenummer beantragen' bei der Stammdatenbearbeitung für die Rollen GK-AcM TK, IoT, IT, MK"
      ]
    }
  ],
  "acceptance_criteria": [
    "Keine Informationen verfügbar"
  ],
  "domainsAndITApplications": [
    "Magenta Force",
    "DOM0201"
  ],
  "abhängigkeitenUndRisiken": [
    "Das Business Epic befindet sich im Status 'Funnel', was darauf hindeutet, dass es sich noch in einer frühen Phase befindet",
    "Die geplante Umsetzung ist für den Zeitraum 01.07.2025 bis 30.09.2025 vorgesehen, was auf einen längeren Planungshorizont hindeutet",
    "Keine spezifischen Abhängigkeiten oder Risiken sind im Detail dokumentiert"
  ],
  "zeitplan": {
    "umsetzungsstart": "2025-07-01",
    "umsetzungsende": "2025-09-30",
    "fixVersions": [],
    "meilensteine": []
  }
}
```