{
  "epicId": "BEMABU-1790",
  "title": "OnNet Security - Fixed - Basic Package - Touchpoints",
  "ziele": {
    "gesamtziel": "Für GK Festnetz Kunden, die sich vor Cyber Angriffen schützen wollen, wird Magenta OnNet Security Fixed als Zusatzfeature implementiert, wodurch der Festnetz Anschluss einen eingebauten Security Schutzschild erhält. Dadurch benötigt der Kunde keine zusätzlichen Komponenten für seine Cyber Sicherheit. Das Vorhaben schafft einen USP am Festnetzmarkt und stärkt das Security Portfolio. Die Umsetzung ist für den Zeitraum 01.07.2025 bis 30.09.2026 geplant.",
    "einzelziele": [
      "Implementierung von OnNet Security Fixed für Festnetzanschlüsse",
      "Befähigung aller Sales Channels zur Arbeit mit dem neuen zMP (zubuchbares Marktprodukt)",
      "Ermöglichung der vertragsrelevanten Steuerung (Zu/Abbuchen) des zMP über verschiedene Kunden- und Service-Touchpoints",
      "Ermöglichung der vertrags-irrelevanten Konfiguration (ON/OFF) auf Feature-Ebene",
      "Integration des OnNet Security Basic Features in das MMKC 2.0 Kundenportal",
      "Bereitstellung von Self-Service-Funktionen für Security Add-on"
    ]
  },
  "businessValue": {
    "businessImpact": {
      "skala": 20,
      "beschreibung": "Adressierung des Business und Company Festnetzportfolio. Umsatzeffekte werden mit Upselling in die Pakete Comfort und Advanced erzielt. Erwarteter Umsatz > 6.000 T€."
    },
    "strategicEnablement": {
      "skala": 13,
      "beschreibung": "Mit der in den Festnetzanschluss integrierten Cyber Sicherheit-Features wird ein USP am Markt geschaffen und dadurch ein Wettbewerbsvorteil erzielt. Dies stellt einen relevanten Wettbewerbsvorteil dar."
    },
    "timeCriticality": {
      "skala": 1,
      "beschreibung": "Geplanter Umsetzungszeitraum: Plan Start Produkt: 01.07.2025, Plan Ende: 30.09.2025, Launch Basic Q4 2025, Comfort Q4 2025, Advanced Q2 2026"
    }
  },
  "funktionen": [
    {
      "id": "MAGBUS-104136",
      "titel": "OnNet Security Fixed: Implementierung",
      "funktionalitäten": [
        "Implementierung der OnNet Security Fixed Lösung",
        "Koordination der verschiedenen Pakete (Basic, Comfort, Advanced)",
        "Umsetzung der technischen Grundlagen für die Security-Funktionalität"
      ]
    },
    {
      "id": "BEDC-192",
      "titel": "Enable Self-Service for Security Add-on",
      "funktionalitäten": [
        "Integration des OnNet Security Basic Features in das MMKC 2.0 Kundenportal",
        "Anzeige der Verfügbarkeit und des Buchungsstatus des Features",
        "Ermöglichung der ON/OFF-Konfiguration des Features",
        "SSO-basierter Zugang zum Security Portal",
        "Kündigung des Features über CRM-T-Auftragsintegration"
      ]
    },
    {
      "id": "MAGBUS-104175",
      "titel": "OnNet Security - Fixed - Basic Package - Flamingo",
      "funktionalitäten": [
        "Anpassung der Abbildung (OnNet Security, Produkte und Beziehungslogik) in Flamingo",
        "Vertragsverwaltung inkl. zMP Zubuchung/Abbuchung durch Vertrieb",
        "Integration in die Vertriebssysteme",
        "Unterstützung der verschiedenen Preismodelle je nach Tarif"
      ]
    }
  ],
  "acceptance_criteria": [
    "Mit dem Basic Paket bekommt jeder Kunde den gleichen Schutz, d.h. die Blocking-Profile sind nicht individuell und werden für alle Kunden gleich verwendet. Die Realisierung von dem Schutz erfolgt mittels einer neuen Komponente im Netz - SecurityGateway (=Network Firewall), über die der Kundentraffic im Netz geleitet wird.",
    "Die Latenzzeiten welche durch Analyse des Datenverkkehrs entsteht darf nicht die Nutzung der Data und Voices Services beeinträchtigen",
    "Das Basic Paket wird als optionale Zubuchoption in den GK Festnetz Tarifen angeboten",
    "Das Basic Paket wird als zubuchbares zMP realisiert",
    "Das Basic Paket wird als kostenpflichtige Zubuchoption (Preis 3,95€) in den Festnetz Tarifen der Familie \"Business Start\" angeboten.",
    "Das Basic Paket wird als Inklusivleistung in den Festnetz Tarifen \"Business Pro\", \"Business Start / Pro Premium\" und CompanyFlex mit angeboten.",
    "Die Funktion von dem Basic Paket kann auch auf Kundenwunsch deaktiviert werden, ohne dass zMP von dem Vertrag abgebucht wird.",
    "Das Basic Paket ist standardmäßig im Buchungsprozess für Tariffamilien \"Business Pro\", \"Business Start / Pro Premium\" und CompanyFlex vorausgewählt und kann vom Kunden Buchungsprozess abgewählt werden. (Optout)",
    "Das Basic Paket ist im Buchungsprozess in der Tariffamilie \"Business Start\" vom Kunden aktiv auszuwählen, da es zusätzliche Kosten für den Kunden verursacht (OptIn)",
    "Die Security Pakete können im Self-Service und Assisted Channel bei der Beauftragung eines Festnetzanschluss gebucht werden",
    "Bei Kündigung des Festnetz Anschluss wird das Basic Security Paket ebenfalls gekündigt und in dem SecurityGateway deprovisionirt",
    "Der Kunde kann im Self-Service über das Kundencenter den Schutz aus dem Basic Paket temporär zu sofort deaktivieren.",
    "Der Service kann über das Kundencenter den Schutz aus dem Basic Paket für den Kunden zu sofort deaktivieren"
  ],
  "domainsAndITApplications": [
    "DOM0201",
    "DOM0202",
    "Flamingo",
    "EOS",
    "O3",
    "SECEIT",
    "MMKC 2.0",
    "OneShop",
    "BSPClassic",
    "OneApp",
    "MagentaView",
    "T-VPP",
    "TCK",
    "BPP / Angebotskonfigurator",
    "MagentaForce",
    "AVIA",
    "SDSB",
    "GKV-POM",
    "TDS/xDS"
  ],
  "abhängigkeitenUndRisiken": [
    "Abhängigkeit von Magenta OnNet Security Mobile - MVP",
    "Abhängigkeit von Magenta OnNet Security RFQ",
    "Abhängigkeit von Fiber IT und Prozess Ressourcen",
    "Abhängigkeit von NonStopNetz - Bugfixing und Nacharbeiten",
    "Abhängigkeit von NonStopNetz - Nachlieferung Voice Backup",
    "Risiko: Latenzzeiten durch Analyse des Datenverkehrs könnten die Nutzung der Data und Voice Services beeinträchtigen",
    "Risiko: Komplexe Integration in zahlreiche IT-Systeme und Touchpoints",
    "Risiko: Zeitliche Verzögerungen durch die Vielzahl der beteiligten Systeme und Domains"
  ],
  "zeitplan": {
    "umsetzungsstart": "2025-07-01",
    "umsetzungsende": "2026-09-30",
    "fixVersions": ["Q3_25"],
    "meilensteine": [
      {
        "id": "ECC-9444",
        "beschreibung": "DOM0201 OnNet Security - Fixed Business DSL / Glasfaser Pro",
        "zeitraum": "2025-10-01 bis 2026-05-31"
      },
      {
        "id": "ECC-9455",
        "beschreibung": "DOM0202 OnNet Security - Fixed Business DSL / Glasfaser Pro",
        "zeitraum": "2025-10-01 bis 2026-05-31"
      },
      {
        "id": "BEMABU-1790",
        "beschreibung": "Launch Basic Package",
        "zeitraum": "Q4 2025"
      }
    ]
  }
}