```json
{
  "epicId": "BEMABU-1990",
  "title": "IT AE Netto",
  "ziele": {
    "gesamtziel": "Implementierung eines IT AE Netto Wertes in MagentaForce, der den Auftragseingang abzüglich der Marge darstellt, um eine transparente Salesfunnel-Betrachtung zu ermöglichen und aussagekräftiges Reporting für die Steuerung zu gewährleisten. Die Umsetzung soll bis PrioQ2_25 abgeschlossen sein.",
    "einzelziele": [
      "Automatische Berechnung des IT Netto AE Wertes aus dem ausgewählten Produktbetrag im Vorhaben",
      "Berücksichtigung der entsprechenden Margen bei der Berechnung",
      "Anpassung der Berichte GK-VM Vorhaben-Export, GK-VM InSa Vorhaben-Export und GK-VM Vorhaben Partner-Export mit zusätzlichen Spalten für Netto-Beträge"
    ]
  },
  "businessValue": {
    "businessImpact": {
      "skala": 0,
      "beschreibung": "Transparente Salesfunnelbetrachtung unter Berücksichtigung der IT Marge."
    },
    "strategicEnablement": {
      "skala": 0,
      "beschreibung": "Keine Informationen verfügbar"
    },
    "timeCriticality": {
      "skala": 0,
      "beschreibung": "Momentan haben wir keine IT Netto Betrachtung in MF Vorhaben, somit wäre eine zeitnahe Umsetzung wünschenswert."
    }
  },
  "funktionen": [
    {
      "id": "MAGBUS-99535",
      "titel": "MF: IT Netto AE",
      "funktionalitäten": [
        "Neues Feld 'IT AE Netto' auf Vorhaben-Ebene in MagentaForce",
        "Aufsummierung der Marge der Vorhaben-Produkte im neuen Feld",
        "Ausgewählte TDG-Produkte werden in der VPO-Liste mit einer Zielmarge versehen",
        "Anpassung der Berichte mit Ergänzung der Spalte 'Betrag Netto' bzw. 'Gesamtpreis Netto'"
      ]
    }
  ],
  "domainsAndITApplications": [
    "MagentaForce (MF)"
  ],
  "abhängigkeitenUndRisiken": [
    "Abhängigkeit zum Magentaforce Pricebook",
    "Principal-Agent (Reselling) Kontext der Bilanzierung im Zusammenspiel mit Partnern (wie z.B. Microsoft)"
  ],
  "zeitplan": {
    "umsetzungsstart": "Keine Informationen verfügbar",
    "umsetzungsende": "Keine Informationen verfügbar",
    "fixVersions": ["PrioQ2_25", "PI 27", "MF 4.400", "MF 4.500"],
    "meilensteine": []
  }
}
```