{
  "epicId": "BEMABU-2085",
  "title": "B2B Integration into MMKC 2.0 (Interims Solution)",
  "ziele": {
    "gesamtziel": "Integration der Standard-B2B-Order-Systeme in MMKC 2.0 als Interimslösung für SME+ Mobilfunkkunden, damit diese Verträge verlängern oder Tarife ändern können, ohne dass sie einen Systemwechsel bemerken. Die Umsetzung ist für den Zeitraum vom 01.04.2025 bis 30.09.2025 geplant.",
    "einzelziele": [
      "Nahtlose Integration der B2B-Funktionalitäten in MMKC 2.0 für SME+ Kunden",
      "Ermöglichung von Vertragsverlängerungen und Tarifwechseln für B2B-Mobilfunkkunden",
      "Verhinderung von Kundenabwanderung zum Wettbewerb",
      "Erhöhung der Kundenzufriedenheit und Förderung von Cross-Selling"
    ]
  },
  "businessValue": {
    "businessImpact": {
      "skala": 8,
      "beschreibung": "Umsatzsteigerung >786 T€ und Kosteneinsparungen durch Self-Service anstelle von Kundenservice-Aktivitäten. Das zusätzliche Churning-Risiko wurde nicht bewertet."
    },
    "strategicEnablement": {
      "skala": 8,
      "beschreibung": "Sicherung des SME+ Mobilfunkgeschäftswachstums in den B2B-Systemen bis zur DOT-Bereitschaft. Das bestehende Unterebenenmodell muss aufgrund des begrenzten Implementierungsumfangs von DOT weiterhin in MBSP und anderen B2B-Systemen betrieben werden. Dies verhindert die Verlagerung von Kunden und Umsatz von B2B zu B2C."
    },
    "timeCriticality": {
      "skala": 20,
      "beschreibung": "Zeitkritisch für PI 25.2. Die Integration des mobilen B2B-Geschäfts für SME+ Kunden in DOT-Systeme wurde auf 2026 verschoben. Daher bleiben die bestehenden B2B-Systeme 2025 die Heimatbasis sowohl für SME-Kunden, die überhaupt nicht zu DOT migrieren, als auch für SME+ Kunden mit B2B-Mobilfunkverträgen."
    }
  },
  "funktionen": [
    {
      "id": "BEMABU-2085",
      "titel": "B2B Integration into MMKC 2.0 (Interims Solution)",
      "funktionalitäten": [
        "Nahtlose Integration der Standard-B2B-Systeme in MMKC 2.0",
        "Single Sign-On (SSO) für Benutzer, die zum Standard-System weitergeleitet werden",
        "Nutzung aller nativen Journeys aus dem Standard-System, insbesondere Vertragsverlängerung und Tarifwechsel",
        "Verfügbarkeit und Download-Möglichkeit von Rechnungen",
        "Vermeidung der Weiterleitung zum Dashboard oder Erkennung einer Umleitung zu einem anderen System",
        "Anzeige einer Zurück-Schaltfläche auf jeder Seite für die Rückkehr zu MMKC",
        "Ausblendung von Menü, Footer etc. vom Standard-System, damit der Benutzer nicht merkt, dass er sich in einem anderen System befindet"
      ]
    }
  ],
  "acceptance_criteria": [
    "A seamless journey is provided to MMKC2.0 and MMA by the standard B2B system.",
    "Redirected users are logged into the standard system via SSO",
    "All native journeys from the standard system can be used, especially contract prolongation and tariff change",
    "Invoices are available and ready to download",
    "The user should not be lead to the dashboard nor recognize a redirection to another system at all",
    "A return button is displayed on each page so that the user can return to MMKC at any time.",
    "No menu, footer etc. from the standard system shall be displayed on the page so that the user does not realise that he is in a different system",
    "The standard system provides everything needed for the acceptance criteria mentioned above regarding the customer experince within MMKC 2.0"
  ],
  "domainsAndITApplications": [
    "MMKC 2.0",
    "MMA",
    "DOM0602",
    "MBSP",
    "BEO"
  ],
  "abhängigkeitenUndRisiken": [
    "Abhängigkeit von BEDC-77 Integration of KMU in MMKC 2.0 (deep-links in MMKC 2.0)",
    "Abhängigkeit von BEMABU-2171 MBSP: Deep-links for Sales-Journeys needed",
    "Die Integration des mobilen B2B-Geschäfts für SME+ Kunden in DOT-Systeme wurde auf 2026 verschoben",
    "Risiko der Kundenabwanderung und Umsatzverlagerung von B2B zu B2C ohne diese Interimslösung"
  ],
  "zeitplan": {
    "umsetzungsstart": "2025-04-01",
    "umsetzungsende": "2025-09-30",
    "fixVersions": ["Keine Informationen verfügbar"],
    "meilensteine": [
      {
        "id": "PI 25.2",
        "beschreibung": "Geplante Implementierung in MMKC",
        "zeitraum": "Keine genauen Datumsangaben verfügbar"
      }
    ]
  }
}