```json
{
  "epicId": "BEMABU-2147",
  "title": "GKPV: Implementierung von Partner Sales Management in Magenta Force",
  "ziele": {
    "gesamtziel": "Implementierung eines Partner Sales Managements in Magenta Force, um Partner Account Managern (PAMs) Transparenz über Aktivitäten und vereinbarte Maßnahmen zu bieten, wodurch das Sales Management verbessert wird und gesteckte Ziele und Umsätze erreicht werden können. Die Umsetzung ist für den Zeitraum vom 01.07.2025 bis 30.09.2025 geplant.",
    "einzelziele": [
      "Schaffung einer gemeinsamen Sicht auf Unternehmen, die sowohl Kunde als auch Vertriebspartner sind",
      "Verbesserung der Koordination zwischen PAMs und Direktvertrieb bei Ausschreibungen und Kundenansprache",
      "Erhöhung der vertriebsaktiven Zeit der PAMs durch Reduzierung des Abstimmungsaufwands",
      "Unterstützung des vom T Business Board beschlossenen Partner Boosts"
    ]
  },
  "businessValue": {
    "businessImpact": {
      "skala": 1,
      "beschreibung": "Umsatzsteigerung von 120.000 € durch mehr vertriebsaktive Zeit der PAMs. 24 betroffene PAMs x 10 Stunden Abstimmung/Jahr x 500 € Umsatz durch geringeren Zeitaufwand bei Abstimmungen mit dem Direktvertrieb."
    },
    "strategicEnablement": {
      "skala": 3,
      "beschreibung": "Komplexitätsreduzierung durch eine einheitliche Sicht auf Unternehmen, die sowohl Kunde als auch Partner sind. Zahlt auf das Wachstumsfeld 'Effizienzsteigerung und Digitalisierung' ein."
    },
    "timeCriticality": {
      "skala": 8,
      "beschreibung": "Je früher eine gemeinsame Sicht auf Kunden und Partner erfolgen kann, desto besser können sich PAMs und Direktvertrieb koordinieren, um einen abgestimmten Kundenangang zu gewährleisten. Geplanter Umsetzungszeitraum: Q3/2025 bis Ende 2025."
    }
  },
  "funktionen": [
    {
      "id": "BEMABU-2147",
      "titel": "GKPV: Implementierung von Partner Sales Management in Magenta Force",
      "funktionalitäten": [
        "Doppelte Darstellung eines Unternehmens in Magenta Force - als Kunde des Direktvertriebs und als Sales Partner",
        "Nutzung von Magenta Force durch Partner Account Manager zur Pflege der zugeordneten Partner",
        "Sichtbarkeit von Unternehmen sowohl als Partner als auch als Kunde für PAMs",
        "Regionale Sicht für Regionalleiter auf alle Unternehmen ihrer Region als Partner und Kunde",
        "Administrative Sicht für Partner Sales Admins auf alle Partner",
        "Übertragung von Partnerbeziehungen und relevanten Daten aus SPRM an Magenta Force"
      ]
    }
  ],
  "acceptance_criteria": [
    "Ein Unternehmen kann zweimal in Magenta Force existieren- einmal als Kunde des Direktvertriebes, einmal als Sales Partner für Partner Sales",
    "Die Partner Account Manager (PAM) können Magenta Force zur Pflege der zugeordneten Partner nutzen",
    "Die PAMs können jeweils ihre zugeordneten Unternehmen als Partner und als Kunde sehen",
    "Die Regionalleiter können alle Unternehmen der jeweiligen Region als Partner und Kunde sehen (Rolle: tbd.)",
    "Eine Sicht für Partner Sales Admins erlaubt die Sicht auf alle Partner (Rolle: tbd.)",
    "Die Partnerbeziehungen und relevanten Daten wurden aus SPRM an Magenta Force übertragen"
  ],
  "domainsAndITApplications": [
    "MagentaForce",
    "DOM0201",
    "SPRM"
  ],
  "abhängigkeitenUndRisiken": [
    "Die Rollen für Regionalleiter Partner Sales und Partner Sales Admins müssen noch definiert werden",
    "Datenübertragung aus SPRM an Magenta Force muss sichergestellt werden",
    "Das Business Epic befindet sich im Status 'Funnel', was auf eine frühe Planungsphase hindeutet",
    "Die Umsetzung ist erst für Q3/2025 geplant, was ein Risiko für die zeitkritische Implementierung darstellen könnte"
  ],
  "zeitplan": {
    "umsetzungsstart": "2025-07-01",
    "umsetzungsende": "2025-09-30",
    "fixVersions": [],
    "meilensteine": []
  }
}
```