{
  "epicId": "BEMABU-1927",
  "title": "Zoom X TCMP Add-On Onboarding 2025",
  "ziele": {
    "gesamtziel": "Bereitstellung eines Zoom X Portfolios im TCMP mit verbesserter UX für kleinere und mittlere Unternehmen sowie Reseller, die Einzellizenzen bis zu 499 Lizenzen von Zoom X Produkten und Add-Ons benötigen. Dadurch wird die Vertriebsoberfläche erweitert und der Partnervertrieb erhält neben Microsoft ein weiteres attraktives Angebot. Reseller können Zoom X Lizenzen im Self-Service für ihre Kunden buchen und provisionieren, ohne einen manuell aufwändigen Prozess über ZMKM. Das Ziel soll bis zum 30.06.2025 erreicht werden.",
    "einzelziele": [
      "Onboarding von neuen Add-ons im TCMP (Zoom X PowerPack, Common Area, Translation)",
      "Bereitstellung von aktuellen und neuen Add-ons im TCMP-R",
      "Implementierung neuer APIs von Zoom im Connector zur UX-Steigerung",
      "Onboarding eines neuen Non-MSFT Partners inklusive Know-how Transfer zu Nearshore"
    ]
  },
  "businessValue": {
    "businessImpact": {
      "skala": 0,
      "beschreibung": "Das Vorhaben schafft die Möglichkeit, dass Zoom X massenmarktfähig bereitgestellt werden kann."
    },
    "strategicEnablement": {
      "skala": 0,
      "beschreibung": "Keine detaillierte Beschreibung verfügbar"
    },
    "timeCriticality": {
      "skala": 0,
      "beschreibung": "Keine detaillierte Beschreibung verfügbar"
    }
  },
  "funktionen": [
    {
      "id": "BEMABU-1927",
      "titel": "Zoom X TCMP Add-On Onboarding 2025",
      "funktionalitäten": [
        "Bereitstellung eines Zoom X Portfolios im TCMP mit verbesserter UX",
        "Ermöglichung von Self-Service für Reseller zur Buchung und Provisionierung von Zoom X Lizenzen",
        "Onboarding weiterer Add-ons (Zoom X PowerPack, Common Area, Translation)",
        "Implementierung neuer APIs zur UX-Steigerung"
      ]
    },
    {
      "id": "BEMABU-2031",
      "titel": "Onboarding of new Non-MSFT partner (incl. know-how transfer towards Nearshore)",
      "funktionalitäten": [
        "Onboarding eines neuen Non-MSFT Partners",
        "Know-how Transfer zu Nearshore"
      ]
    }
  ],
  "acceptance_criteria": [
    "Die Add-ons wurden in Produktion getestet und sind live im TCMP",
    "Die neue API zur UX Steigerung (Emailadresse bereits für Zoom Basic Account in Nutzung und ist daher für Zoom X gesperrt) ist im Connector implementiert und eine bessere UX geschaffen."
  ],
  "domainsAndITApplications": [
    "TCMP",
    "TCMP-R",
    "DOM0201"
  ],
  "abhängigkeitenUndRisiken": [
    "Abhängigkeit von AppDirect für die Integration neuer APIs von Zoom",
    "Abhängigkeit von der Bereitstellung neuer APIs durch Zoom",
    "Risiko: Das Enddatum des Business Epics (30.06.2025) liegt nach dem Enddatum des realisierten Issues BEMABU-2031 (25.03.2025), was auf eine mögliche Phasenplanung hindeutet"
  ],
  "zeitplan": {
    "umsetzungsstart": "2025-01-15",
    "umsetzungsende": "2025-06-30",
    "fixVersions": ["Q3_25", "Q1_25"],
    "meilensteine": [
      {
        "id": "BEMABU-2031",
        "beschreibung": "Onboarding of new Non-MSFT partner (incl. know-how transfer towards Nearshore)",
        "zeitraum": "bis 2025-03-25"
      }
    ]
  }
}