{
  "epicId": "BEMABU-1814",
  "title": "Q1 Weiterentwicklung Case-Management API",
  "ziele": {
    "gesamtziel": "Entwicklung einer API-Anbindung für Case-Management, um FEAs anzubinden. Insbesondere soll DMS angebunden werden, um Scans von Faxen und Briefen direkt als Case in MagentaForce abzubilden. Zudem sollen Kündigungs-FEAs EN und FN sowie der Bereitstellungs-FEA 'Intraselect' per API angebunden werden. Ziel ist die vollständige Abbildung aller Works in MagentaForce und die Bearbeitung weniger komplexer Themen über FEAs. Die Umsetzung ist für Q1 2025 (01.01.2025 - 31.03.2025) geplant.",
    "einzelziele": [
      "Bereitstellung einer API für DMS, um Work-Items (Scans, Fax) in MagentaForce zu verarbeiten und als Cases zu transformieren",
      "Anbindung der Kündigungs-FEAs EN und FN per API",
      "Anbindung des Bereitstellungs-FEA 'Intraselect' per API",
      "Ermöglichung der Archivierung und Anzeige von Dokumenten zum Case in DMS",
      "Bereitstellung von Produktinformationen über API für BSP"
    ]
  },
  "businessValue": {
    "businessImpact": {
      "skala": 0,
      "beschreibung": "Dies ermöglicht zum Einen die komplette Abbildung aller Works in MagentaForce (DMS) und zum Anderen die Möglichkeit weniger komplexe Themen wie z.B. Kündigungen über FEAs bearbeiten zu können."
    },
    "strategicEnablement": {
      "skala": 0,
      "beschreibung": "Für die Weiterentwicklung von Case-Management benötigen wir für die FEAs eine API Anbindung."
    },
    "timeCriticality": {
      "skala": 0,
      "beschreibung": "Keine Informationen verfügbar"
    }
  },
  "funktionen": [
    {
      "id": "MOFUDHS-4339",
      "titel": "GK: Product information - API access for BSP",
      "funktionalitäten": [
        "Bereitstellung von Produktinformationen über API",
        "Abruf von Basisprodukten/Optionen mit Product-ID zum Matchcode",
        "Abbildung von Beziehungen zwischen Tarifen (Vorgänger/Nachfolger)",
        "Bereitstellung von Rabatt- und Preisinformationen für Optionen",
        "Export aller Produkte für GK inklusive Vermarktungsstatus"
      ]
    },
    {
      "id": "MAGBUS-92765",
      "titel": "MF: Dokumente zum Service GrK Case in DMS",
      "funktionalitäten": [
        "Archivierung von Dokumenten zum Case in DMS",
        "Anzeige von Dokumenten zum Case in DMS"
      ]
    },
    {
      "id": "MAGBUS-92769",
      "titel": "MF: Bereitstellung Case API",
      "funktionalitäten": [
        "Verarbeitung von Work-Items aus DMS in MagentaForce",
        "Automatisierte Transformation von Work-Items in Cases in MagentaForce",
        "Gezieltes Routing von Cases an Bearbeiter von Service GrK",
        "Bereitstellung einer API für die Case-Erstellung für andere Systeme",
        "Implementierung von Prüfungen zur Weiterverarbeitung oder Abweisung von Work-Items",
        "Unterstützung von getCase und updateCase Funktionen für RPKNeu, EN (OREO) und EOS"
      ]
    }
  ],
  "domainsAndITApplications": [
    "MagentaForce (MF)",
    "DMS",
    "FEAs",
    "EN",
    "FN",
    "Intraselect",
    "RPKNeu",
    "OREO",
    "EOS",
    "TARDIS"
  ],
  "abhängigkeitenUndRisiken": [
    "Abhängigkeit von DMS für die Übergabe von Work-Items (Scans, Fax)",
    "Abhängigkeit von RPKNeu, EN (OREO) und EOS für die Nutzung der getCase bzw. updateCase Funktionen",
    "Das Epic MAGBUS-92769 ist bereits geschlossen, während MAGBUS-92765 noch in Bearbeitung ist",
    "Business Requirement für MAGBUS-92769 wurde am 31.01.2025 freigegeben, was nach dem geplanten Umsetzungsende des Business Epics (31.03.2025) liegt"
  ],
  "zeitplan": {
    "umsetzungsstart": "2025-01-01",
    "umsetzungsende": "2025-03-31",
    "fixVersions": ["PrioQ1_25", "PI 27", "PI 28", "MF 4.500", "MF 4.600", "MPP_25.3"],
    "meilensteine": [
      {
        "id": "MAGBUS-92769",
        "beschreibung": "MF: Bereitstellung Case API",
        "zeitraum": "PI 27, MF 4.500"
      },
      {
        "id": "MAGBUS-92765",
        "beschreibung": "MF: Dokumente zum Service GrK Case in DMS",
        "zeitraum": "PI 27, PI 28, MF 4.500, MF 4.600"
      },
      {
        "id": "MOFUDHS-4339",
        "beschreibung": "GK: Product information - API access for BSP",
        "zeitraum": "MPP_25.3"
      }
    ]
  }
}