{
  "epicId": "BEMABU-2261",
  "title": "Bericht MF Terminauswertung für Inside Sales Leiter",
  "ziele": {
    "gesamtziel": "Entwicklung eines Berichts in Magenta Force zur Terminauswertung für Inside Sales Leiter im Midmarket, um Transparenz über die erreichten Termine zu schaffen und eine effiziente Steuerung der Terminierung zu ermöglichen. Ziel ist es, 15 Außendiensttermine pro Woche pro AcM 1 zu erreichen. Die Umsetzung ist für den Zeitraum 01.07.2025 bis 30.09.2025 geplant.",
    "einzelziele": [
      "Schaffung von Transparenz über den Kundenangang im C-Segment",
      "Ermöglichung eines Überblicks/Monitorings für erreichte Termine",
      "Unterstützung bei der Steuerung der Terminvergabe",
      "Verbesserung der Nachvollziehbarkeit der Zielerreichung",
      "Reduzierung des manuellen Aufwands für Leiter Inside Sales"
    ]
  },
  "businessValue": {
    "businessImpact": {
      "skala": 3,
      "beschreibung": "80 AcM1 mit 15 Terminen/Woche * 40 KW = 48.000 Termine p.a. mit einer Winrate von 40% und einem durchschnittlichen Win von 3.000€ führen zu 30-40 Mio. € p.a. Umsatzpotenzial. Die Maßnahme unterstützt den Angang des C-Segments und reduziert den manuellen Aufwand für Leiter Inside Sales."
    },
    "strategicEnablement": {
      "skala": 3,
      "beschreibung": "Strategische Bedeutung durch Verbesserung der Transparenz und effiziente Austeuerung des Kundenangangs bei 110.000 Kunden (2/3 aller Kunden im MM Vertical). Ermöglicht Quartalsplanung und wöchentliches Monitoring über alle Vertriebsaktivitäten und verhindert ineffiziente Austeuerung, fehlende Absätze und Reduzierung der Kundenzufriedenheit."
    },
    "timeCriticality": {
      "skala": 3,
      "beschreibung": "Die Verzielung der auszuwertenden Mitarbeiter und deren Aussteuerung ist bereits für 2025 geplant. Trotz eines gefundenen Workarounds bleibt das Thema strategisch wichtig für eine effiziente Anwendungsarchitektur im Vertrieb und zur Verbesserung des NPS."
    }
  },
  "funktionen": [
    {
      "id": "BEMABU-2261",
      "titel": "Bericht MF Terminauswertung für Inside Sales Leiter",
      "funktionalitäten": [
        "Wöchentliche Terminauswertung für Inside Sales in Magenta Force",
        "Monitoring der erreichten Termine für Inside Sales 1 und 2",
        "Überblick über aktuelle Termine zur Unterstützung bei gefährdeter Zielerreichung",
        "Transparenz im Zusammenhang mit der Verzielung der operativ arbeitenden Kollegen"
      ]
    }
  ],
  "acceptance_criteria": [
    "Wenn der Leiter Inside je Region die Terminauswertung wöchentlich in Magenta Force für Inside Sales abrufen und zur Steuerung nutzen kann, ist die Anforderung erfüllt."
  ],
  "domainsAndITApplications": [
    "Magenta Force",
    "DOM0201"
  ],
  "abhängigkeitenUndRisiken": [
    "Das Business Epic befindet sich im Status 'Funnel', was darauf hindeutet, dass es sich noch in einer frühen Planungsphase befindet",
    "Die Umsetzung ist erst für 07/2025 bis 09/2025 geplant, während im Business Value von einer Umsetzung bis 07/2026 gesprochen wird - hier besteht eine Inkonsistenz in der Zeitplanung",
    "Es wurde bereits ein Workaround gefunden, was die Priorisierung reduziert hat, aber die strategische Wichtigkeit bleibt bestehen"
  ],
  "zeitplan": {
    "umsetzungsstart": "2025-07-01",
    "umsetzungsende": "2025-09-30",
    "fixVersions": [],
    "meilensteine": []
  }
}