{
  "epicId": "BEMABU-2171",
  "title": "Deep-links for Sales-Journeys from MMKC2.0 (Interims Solution)",
  "ziele": {
    "gesamtziel": "Implementierung einer Interimslösung für B2B-Mobilfunk-Journeys, die 2025 nicht auf OneX-Plattformen verfügbar sind. Bestehende B2B-KMU-Mobilfunkkunden sollen direkt aus dem MMKC 2.0 zu speziellen Bereichen im entsprechenden B2B-System weitergeleitet werden, um ihre Anliegen sofort bearbeiten zu können, ohne sich erneut einloggen zu müssen. Die Umsetzung ist für den Zeitraum vom 01.04.2025 bis 31.10.2025 geplant.",
    "einzelziele": [
      "Bereitstellung von Deep-Links für alle nativen Journeys im entsprechenden B2B-System",
      "Direkte Weiterleitung zu speziellen Bereichen ohne erneute Login-Anforderung",
      "Ermöglichung von Self-Service-Funktionen für B2B-Mobilfunkkunden",
      "Reduzierung von Kundenservice-Aktivitäten durch Self-Service-Optionen",
      "Sicherstellung der Geschäftskontinuität für KMU+ Mobilfunkkunden bis zur DOT-Bereitschaft in 2026"
    ]
  },
  "businessValue": {
    "businessImpact": {
      "skala": 8,
      "beschreibung": "Umsatzsteigerung von >786 T€ sowie Kosteneinsparungen durch Self-Service anstelle von Kundenservice-Aktivitäten. Das zusätzliche Churning-Risiko wurde nicht bewertet."
    },
    "strategicEnablement": {
      "skala": 8,
      "beschreibung": "Risikominimierung und relevanter Wettbewerbsvorteil. Sicherung des KMU+ Mobilfunkgeschäftswachstums in den B2B-Systemen bis zur DOT-Bereitschaft. Das bestehende Unterebenenmodell muss aufgrund des begrenzten Implementierungsumfangs von DOT weiterhin in MBSP und anderen B2B-Systemen betrieben werden, um Kunden- und Umsatzverlagerungen von B2B zu B2C zu vermeiden."
    },
    "timeCriticality": {
      "skala": 20,
      "beschreibung": "Zeitkritisch für PI 25.2. Die Integration des mobilen B2B-Geschäfts für KMU+ Kunden in DOT-Systeme wurde auf 2026 verschoben. Daher bleiben die bestehenden B2B-Systeme 2025 die Heimatbasis sowohl für KMU-Kunden, die nicht zu DOT migrieren, als auch für KMU+ Kunden mit B2B-Mobilfunkverträgen."
    }
  },
  "funktionen": [
    {
      "id": "BEMABU-2171",
      "titel": "Deep-links for Sales-Journeys from MMKC2.0 (Interims Solution)",
      "funktionalitäten": [
        "Bereitstellung von Deep-Links für alle nativen Journeys im entsprechenden B2B-System",
        "Direkte Weiterleitung zu speziellen Funktionen ohne erneute Login-Anforderung",
        "Weiterleitung zur 'Tarifwechsel'-Funktion im entsprechenden B2B-System bei Klick auf den 'Tarifwechsel'-Button in MMKC 2.0",
        "Weiterleitung zur 'Vertragsverlängerung'-Funktion im entsprechenden B2B-System bei Klick auf den 'Vertragsverlängerung'-Button in MMKC 2.0",
        "Weiterleitung zum Rechnungsbereich im entsprechenden B2B-System bei Aufruf einer Rechnungsübersicht"
      ]
    }
  ],
  "acceptance_criteria": [
    "A list of DeepLinks for all native journeys in the corresponding B2B system (to be define with development team) has been provided.",
    "Redirection leads directly to the respective use case via correct deep-link without log in request.",
    "At least the following acceptance criteria are met:\nIf the mobile customer clicks on the 'change tariff' button in MMKC 2.0, he is forwarded directly to the 'change tariff' function in the corresponding B2B system.\nIf the mobile customer clicks on the 'contract prolongation' button in MMKC 2.0, he is forwarded directly to the 'tariff change' function in the corresponding B2B system.\nIf mobile customer wants to call up an invoice overview, they are forwarded directly to the invoice area in the corresponding B2B system.",
    "If the mobile customer clicks on the 'change tariff' button in MMKC 2.0, he is forwarded directly to the 'change tariff' function in the corresponding B2B system.",
    "If the mobile customer clicks on the 'contract prolongation' button in MMKC 2.0, he is forwarded directly to the 'tariff change' function in the corresponding B2B system.",
    "If mobile customer wants to call up an invoice overview, they are forwarded directly to the invoice area in the corresponding B2B system."
  ],
  "domainsAndITApplications": [
    "MMKC 2.0",
    "B2B-Systeme",
    "MBSP"
  ],
  "abhängigkeitenUndRisiken": [
    "Die Integration des mobilen B2B-Geschäfts für KMU+ Kunden in DOT-Systeme wurde auf 2026 verschoben",
    "Die Implementierung der Anforderung in MMKC wurde bereits für PI 25.2 (oder später) geplant",
    "Die nahtlose Integration in MMKC 2.0 ist nicht im Scope (wird durch BEMAU-2085 abgedeckt)",
    "Das Business Epic befindet sich im Status 'Funnel', was auf eine frühe Planungsphase hindeutet",
    "Risiko: Ohne zusätzliche Investitionen in Up- und Cross-Selling können Kunden nicht in die richtige Richtung entwickelt werden"
  ],
  "zeitplan": {
    "umsetzungsstart": "2025-04-01",
    "umsetzungsende": "2025-10-31",
    "fixVersions": [],
    "meilensteine": []
  }
}