{
  "epicId": "BEMABU-2207",
  "title": "LE - AI 4 RFP (Exploration)",
  "ziele": {
    "gesamtziel": "Exploration der Wirksamkeit von KI bei der Vertriebsunterstützung durch (a) Prüfung der KI-Wirksamkeit bei spezifischen Aufgaben und (b) Entwicklung eines datenschutzrechtlich und betriebsratskonformen Betriebsmodells. Ziel ist die Bereitstellung einer KI-basierten Sales-Unterstützung mit zwei Kernfähigkeiten: automatisierte Analyse von Angebotsanfragen auf Gewinnwahrscheinlichkeit und automatisierte Suche nach Antworten auf ähnliche Fragen in bestehenden Telekom-Dokumenten. Geplante Umsetzung von Juli bis September 2025.",
    "einzelziele": [
      "Automatisierte Analyse von eingehenden Angebotsanfragen und Ausschreibungen auf die Gewinnwahrscheinlichkeit",
      "Automatisierte Suche von Antworten auf ähnliche Fragen der Ausschreibungen in bestehenden Telekom-Dokumenten",
      "Evaluierung geeigneter Anbieter für den PoC (u.a. T-Systems, MMS, BCG, responsive.io)",
      "Sicherstellung der Datenschutzkonformität und Integration"
    ]
  },
  "businessValue": {
    "businessImpact": {
      "skala": 0,
      "beschreibung": "Steigerung von Umsatz und Deckungsbeitrag um 5-10% durch Fokussierung auf passende Angebote und deren schnellere und qualitativ bessere Beantwortung. Zeitgewinne von 30% und mehr für Fachexperten. Vermeidung von Wettbewerbsnachteilen, da die Konkurrenz bereits massiv in KI-basierte Sales-Automatisierung investiert."
    },
    "strategicEnablement": {
      "skala": 0,
      "beschreibung": "Ermöglichung der Konzentration auf die Entwicklung innovativer Lösungen statt Routine-Aufgaben. Ein schneller Einsatz hilft, die Wettbewerbsposition zu stärken und die Nase vorn zu behalten."
    },
    "timeCriticality": {
      "skala": 0,
      "beschreibung": "Hohe zeitliche Kritikalität, da ein schneller Einsatz die Wettbewerbsfähigkeit sichert, während eine Verzögerung diese schnell sinken lassen wird."
    }
  },
  "funktionen": [
    {
      "id": "BEMABU-2207",
      "titel": "LE - AI 4 RFP (Exploration)",
      "funktionalitäten": [
        "Automatisierte Bewertung eingehender Ausschreibungen",
        "KI-gestützte Suche nach passenden Antworten in Datenbanken",
        "Unterstützung bei der Formulierung treffender Antworten",
        "Matching von Kundenanfragen auf das Portfolio",
        "Vergleich von Telekom-AGB mit Ausschreibungsbedingungen",
        "Finden von Antworten auf häufig wiederkehrende Fragen",
        "Übersetzung von Fragen und Antworten in verschiedene Sprachen",
        "Verbesserung der Lesbarkeit von Antworten"
      ]
    }
  ],
  "acceptance_criteria": [
    "Die Akzeptanzkriterien sind u.a.",
    "AI Nutzung zur Angebotsbewertung: (1) Wie gut kann die AI  die Kundenanfragen auf das Portfolio matchen? (2) Wie gut  die AI die Telekom-AGB mit den Bedingungen der Aussschreibung vergleichen?",
    "AI Nutzung zur Fragenbeantwortung: (1) Wie gut kann die AI Antworten auf häufig wiederkehrende Fragen finden? (2) Wie gut dann die AI Fragen und Antworten in verschiedene Sprachen übersetzen (3) Wie gut kann die AI die Lesbarkeit von Antworten verbessern."
  ],
  "domainsAndITApplications": [
    "Keine Informationen verfügbar"
  ],
  "abhängigkeitenUndRisiken": [
    "Abhängigkeit von der Begleitung durch MMS für Datenschutzkonformität, PSA Verfahren und Integration",
    "Aufwandsabschätzung für den Proof of Concept mit MMS liegt bei ca. 100 Personentagen",
    "Das Projekt befindet sich im Status 'Funnel', was auf eine frühe Phase hindeutet",
    "Risiko der Verzögerung bei der Auswahl des geeigneten Anbieters für den PoC"
  ],
  "zeitplan": {
    "umsetzungsstart": "2025-07-01",
    "umsetzungsende": "2025-09-30",
    "fixVersions": [],
    "meilensteine": []
  }
}