{
  "key": "BEB2B-334",
  "issue_type": "Business Epic",
  "title": "IZM 3.0 Renew Targetmanagementsystem",
  "status": "Funnel",
  "description": "Business Scope:\nDas Zielemanagementsystem (IZM) ist eines der kritischsten Systeme, da es direkt Einfluss auf die Bezahlung der Mitarbeitenden in Vertriebsfunktion hat!!\n\nFür die IZM User (ca. 3.000) muss das über 10 Jahre alte Zieletool modernisiert, aktualisiert, ergänzt und auf den neuesten Stand gebracht werden.\n\nEs muss in 2 Schritte umgebaut/ausgebaut werden:\n\nAufbau einer APP um die umständliche und nicht mehr zeitgemäße Browsernutzung zu ändern. a) für Handy und Tablet, b) Browsersicht in Anlehnung an die App verändern, c) Integration in Hub und Mitarbeiter APP,\nErgänzende Programmierung eines Reportingtools.\nHierdurch wird die Attraktivität, Nutzerfreundlichkeit des Tools verbessert und gesteigert. Das verloren gegangene Vertrauern und die Akzeptanz muss wieder gewonnen werden!!\n\nNur so können wir zukünftig eine korrekte Zieleabrechnung sicher stellen\n\nDas alles muss recht zeitnah vor dem Hintergrund der anstehenden Cloudifizierung des (alten) Systems geschehen.\n\nDarüber hinaus ist zu bedenken, dass es nach Aussagen der System Experten ein \"End of living\" bestimmter Komponenten im Jahre 2028 gibt!!!",
  "business_value": {
    "business_impact": {
      "scale": 0,
      "revenue": "",
      "cost_saving": "",
      "risk_loss": "Nur so können wir zukünftig eine korrekte Zieleabrechnung sicher stellen",
      "justification": "Das Zielemanagementsystem (IZM) ist eines der kritischsten Systeme, da es direkt Einfluss auf die Bezahlung der Mitarbeitenden in Vertriebsfunktion hat!!"
    },
    "strategic_enablement": {
      "scale": 0,
      "risk_minimization": "Das verloren gegangene Vertrauern und die Akzeptanz muss wieder gewonnen werden!!",
      "strat_enablement": "Hierdurch wird die Attraktivität, Nutzerfreundlichkeit des Tools verbessert und gesteigert.",
      "justification": ""
    },
    "time_criticality": {
      "scale": 0,
      "time": "recht zeitnah",
      "justification": "Darüber hinaus ist zu bedenken, dass es nach Aussagen der System Experten ein \"End of living\" bestimmter Komponenten im Jahre 2028 gibt!!!"
    }
  },
  "assignee": "Udo Fischer",
  "priority": "",
  "target_start": "2025-07-01",
  "target_end": "2025-09-30",
  "fix_versions": [],
  "acceptance_criteria": [
    "Das bestehende System/ die bestehenden Prozesse sollne als Grundlage dienen um die geplanten Veränderung für die IT so ressourcenschonend wie möglich durchführen zu können",
    "Es soll im ersten Schritt eine App programmiert werden, die die Inhalte/Funktionen der  bisherige Browseroberfläche in optisch ansprechender und vereinfachenderer Form wiedergibt",
    "Diese App muss von Mobilfunktelefonen und mobilen Tablets benutzt werden können",
    "Diese App muss sowohl in das Hub als auch in die Mitarbeiter App integriert werden bzw. von dort abrufbar sein\n-In einem zweiten Schritt muss die bisherige Browseroberfläche - die nach wie vor über myPortal erreichbar sein muss - ebenfalls der mobilen App angepasst werden",
    "Als dritter Schritt muss ein - immer wieder gefordertes aber bislang nie implementiertes -  Reportingtool integriert werden."
  ],
  "components": [
    {
      "code": "DOM0202",
      "title": "DOM0202 Order2Cash"
    }
  ],
  "labels": [
    "Betriebsratbeteilugng",
    "Cross-vertical",
    "Variable_Vergütung",
    "Zielemanagement,"
  ],
  "realized_by": [],
  "child_issues": [],
  "attachments": [
    {
      "filename": "Kernthemen IZM 3.0.pdf",
      "url": "https://jira.telekom.de/secure/attachment/5426413/Kernthemen%20IZM%203.0.pdf",
      "mime_type": "application/pdf",
      "size": "1.62 MB",
      "date": "2025-02-21T10:50:48.596+01:00"
    }
  ]
}