{
  "key": "BEDC-192",
  "issue_type": "Business Epic",
  "title": "Enable Self-Service for Security Add-on",
  "status": "Funnel",
  "description": "Description\nOverview: \nThis epic covers the integration of the OnNet Security Basic feature into the MMKC 2.0 customer portal. The objective is to provide customers with full visibility and control over the feature, depending on its availability and booking status within the customer's contract.\nThe solution must allow:\ndisplaying availability and booking status,\ninitiating the booking journey (via external Shop channel),\nenabling ON/OFF toggling of the feature,\nproviding SSO-based access to the Security Portal, and\nenabling termination of the feature via CRM-T order integration.\nDescription:\nFor customers, who are using MMKC2.0 to review/configure their fixed line contracts it is needed to enable configuration and termination for new feature \"Security OnNet Basic Fixed\".\nThe new feature will be introduced as a zMP (Zubuchbares Marktprodukt) for all fixed line contracts listed in the attached xls list. Depending on the contract the feature is either included into the contract by default (for \"high-value\" contracts) or must be explicitely ordered by customers for the Start-line (in that case monthly costs will be charged to the customer).\nFunctional Requirements:\nUpon login to MMKC2.0 the customer should see booked features for available zMPs in its contract.\nIn case the zMP OnNet Security Basic is not booked, however is available for the contract, the ability to step in into the booking journey for the customer should be available. The booking is done then via appropriate Shop-channel and is not part of the MMKC2.0 journey. The initiation of that journey should however be possible via MMKC2.0.\nIn case the zMP OnNet Security Basic is available for the contract and is booked by the customer, the status of the feature should be shown to the customer. The configuration possibility for OnNet Security Basic is binary - either ON or OFF. \nThe customer should be able to toggle the switch for the feature, i.e. either switch it ON (in the case the status is OFF) or switch it OFF (in the case the status is ON). \nIn case the zMP OnNet Security Basic is available for the contract and is booked by the customer, the link to the security portal should be shown to customer. The placement of the link should be close to the toggle switch, in the area of the OnNet Feature name. The link should be the same for all customers. While the customer clicks on the link, the authentication session of the customer should be transferred to the Security Portal so that the customer does not need to login one more time.\nIn case the zMP OnNet Security Basic is available for the contract and is booked by the customer, the customer must be able to terminate that zMP from the contract. For that appropriate CRM-T order should be created and placed to CRM-T. How to consider MVLZ, how MMKC knows about that??\n  Acceptance Criteria (based on functional requirements): \n1. Feature Visibility & Status Display\nUpon login, customers can see if the OnNet Security Basic feature is available for their contract.\nIf the feature is booked, its current status (ON/OFF) is displayed clearly.\n2. Booking Initiation\nIf the feature is available but not yet booked, a visible CTA (e.g. button or link) is displayed to allow the customer to initiate the booking journey.\nClicking this CTA redirects the customer to the appropriate external Shop channel.\nThe actual booking process takes place outside MMKC 2.0.\n3. Feature Configuration\nIf the feature is already booked, the customer can toggle the feature ON or OFF via a UI switch.\nStatus changes are processed and persisted correctly.\nAny errors during the process result in clear error messaging to the customer.\n4. Security Portal Access (SSO)\nWhen the feature is booked, a standardized link to the Security Portal is shown near the feature name and toggle.\nClicking the link redirects the customer to the portal with the current session (SSO), without requiring a second login.\nThe link is the same for all customers.\n5. Feature Termination\nCustomers with an active booking can request termination of the feature. MVLZ should be considered.\nUpon confirmation, a CRM-T termination order is generated and sent to the CRM-T.\nA confirmation or visible status of the termination request is provided in the portal.\n  Additional information:\nThe IT architecture for all relevant systems to enable the feature for related contracts: https://wiki.telekom.de/display/GKIN/Systemkontext+OnNet+Security\nToggling ON/OFF: in order to toggle the feature two systems should be triggered via appropriate interfaces - GKV-POM and TDS/xDS. GKV-POM is used to configure the feature on the security appliance in the network as well as on the Security Portal. TDS/xDS is triggered in order to reconfigure Technik-relevant profiles for the customer IP flows in order to route them via the new security appliance in the network so that customer traffic can be secured and customer can be protected while using the new feature.\nAvailability of the feature in the contract of the customer: Read out the product specification and check, if the product 50357725 Security OnNet Basic Fixed is part of the product model \nBooking status for the feature in the customer's contract i.e. whether the feature is booked by the customer or nor: Read out the contract data of the inventory and check if the product 50357725 Security OnNet Basic Fixed is part of the contract.\nConfiguration status (ON/OFF) by booked feature: the status can be retrieved via TDS/xDS. Call the Account Life Cycle API (ALA Service) to read out the status of the feature 'f585  /feature/onnetsecurity/basic'\nEnable OnNet Security\nSet 'f585  /feature/onnetsecurity/basic' to active and set Profile-ID 'p161 - /setting/onnetsecurity/tunnelid' to a definded value (tbd) via ALA-Service\nread out the product-ID based on the TO-Number from GKV-POM\ncreate a modify order to activate OnNet Security for GKV-POM\nDisable OnNet Security\nDeactivate feature 'f585  /feature/onnetsecurity/basic'  and delete Profile-ID 'p161 - /setting/onnetsecurity/tunnelid' via ALA-Service\nread out the product-ID based on the TO-Number from GKV-POM\ncreate a modify order to deactivate OnNet Security for GKV-POM\nTermination for zMP for the contract: via MAPI (BLM-CRM) to CRM-T.\n     \n\nBusiness Scope:\nMaxDOT: 2,1 mio customers from B2B-KMU and the related products are to be integrated within DOT touchpoints and DOT processes",
  "business_value": {
    "business_impact": {
      "scale": 0,
      "revenue": "",
      "cost_saving": "",
      "risk_loss": "",
      "justification": ""
    },
    "strategic_enablement": {
      "scale": 0,
      "risk_minimization": "",
      "strat_enablement": "",
      "justification": ""
    },
    "time_criticality": {
      "scale": 0,
      "time": "",
      "justification": ""
    }
  },
  "assignee": "Unassigned",
  "priority": "",
  "target_start": "",
  "target_end": "",
  "fix_versions": [],
  "acceptance_criteria": [
    "Upon login, customers can see if the OnNet Security Basic feature is available for their contract.",
    "If the feature is booked, its current status (ON/OFF) is displayed clearly.",
    "Enable OnNet Security\nSet 'f585  /feature/onnetsecurity/basic' to active and set Profile-ID 'p161 - /setting/onnetsecurity/tunnelid' to a definded value (tbd) via ALA-Service\nread out the product-ID based on the TO-Number from GKV-POM\ncreate a modify order to activate OnNet Security for GKV-POM",
    "Set 'f585  /feature/onnetsecurity/basic' to active and set Profile-ID 'p161 - /setting/onnetsecurity/tunnelid' to a definded value (tbd) via ALA-Service",
    "read out the product-ID based on the TO-Number from GKV-POM",
    "create a modify order to activate OnNet Security for GKV-POM",
    "Disable OnNet Security\nDeactivate feature 'f585  /feature/onnetsecurity/basic'  and delete Profile-ID 'p161 - /setting/onnetsecurity/tunnelid' via ALA-Service\nread out the product-ID based on the TO-Number from GKV-POM\ncreate a modify order to deactivate OnNet Security for GKV-POM",
    "Deactivate feature 'f585  /feature/onnetsecurity/basic'  and delete Profile-ID 'p161 - /setting/onnetsecurity/tunnelid' via ALA-Service",
    "create a modify order to deactivate OnNet Security for GKV-POM",
    "Options",
    "WAITING",
    "FUNNEL",
    "Add Link",
    "All",
    "Comments",
    "History",
    "Activity",
    "Emails",
    "Transitions",
    "Smart Checklist History",
    "Estimate (async mode)",
    "Add a comment...\nPro tip: press m to comment"
  ],
  "components": [
    {
      "code": "DOM0601",
      "title": "DOM0601 Digital Omnichannel Transformation (DOT)"
    }
  ],
  "labels": [
    "MPP_Must_Do",
    "Portfolio_Breitband",
    "TP_MMA",
    "TP_MMKC"
  ],
  "realized_by": [],
  "child_issues": [],
  "attachments": [
    {
      "filename": "2025-04-11_Basisportfolio_Simplicity_OnNetBasic_zMP.xlsx",
      "url": "https://jira.telekom.de/secure/attachment/5652685/2025-04-11_Basisportfolio_Simplicity_OnNetBasic_zMP.xlsx",
      "mime_type": "application/vnd.openxmlformats-officedocument.spreadsheetml.sheet",
      "size": "44 kB",
      "date": "2025-04-29T13:45:25.907+02:00"
    }
  ]
}