{
  "key": "BEMABU-2218",
  "issue_type": "Business Epic",
  "title": "LE - AI in MagentaForce (Text to Speech to Action)",
  "status": "Funnel",
  "description": "Description\nAllgemeine Informationen zum Business Epic (BE)\nFür alle vertrieblich agierenden Mitarbeiter aller Verticals welche MagentaForce als CRM System nutzen\ndie im CRM (MagentaForce) System arbeiten und ihren Kundenangang dort durchführen,\nist es notwendig eine Verbesserung der Kundendokumentation darzustellen,\nwodurch die Zeit von manuellen Dokumentationen erleichterung bringt,\nso dass  dadurch die Datenqualität erhöht wird ,\nund nicht zu viel Zeit in manuelle Vor-/Nachbearbeitungen investiert werden muss.\nDas Vorhaben schafft mehr Zeit für relevante Vertriebstätigkeiten und dadurch bessere Gewährleitung der Zielerreichung..\n  Vertriebsmitarbeiter haben Schwierigkeiten, CRM-Daten zeitnah zu aktualisieren, da sie Zeitmangel während und nach Kundengesprächen.\nDie Lösung: Nutzen des integrierte Salesforce Mobile App, um Besprechungsnotizen per Spracheingabe Voice-to-Text direkt in Textfelder zu diktieren.\nSchnellere, mobile Dateneingabe gewährleistet aktuelle CRM Datensätze - Diktieren von Notizen von unterwegs\nErmöglicht Vertriebsmitarbeitern die schnelle Erfassung und Protokollierung von Besprechungsdetails während oder unmittelbar nach Kundeninteraktionen mit Hilfe der Voice-to-Text-Funktionalität\nVereinfachter Arbeitsablauf spart Zeit und reduziert den administrativen Verwaltungsaufwand\nEliminiert die Notwendigkeit der manuellen Dateneingabe\nDie Datengenauigkeit verbessert sich, ermöglicht rechtzeitige Folgemaßnahmen und Entscheidungen\nGewährleistet die rechtzeitige und genaue Eingabe von Kundeninformationen, reduziert das Risiko von Fehlern oder Auslassungen\n  Rahmenbedingungen\nIn Scope / Akzeptanzkriterien - Bitte Jira-Feld \"Akzeptanzkriterien\" befüllen!\nOut of Scope\n<siehe Ausfüllhilfe https://wiki.telekom.de/x/UEVbfQ>\nAbhängigkeiten/Wechselbeziehungen - Eingangsvoraussetzungen\n<siehe Ausfüllhilfe https://wiki.telekom.de/x/UEVbfQ>\nCross Funktionale Zusammenarbeit\nBeteiligte IT-Applikationen /\nTechnik-Bereiche Beteiligte\nDomains (Tel-IT) Ansprechpartner Bemerkungen                                                                  \n        MagentaForce DOM0201 Andrej Deckel  \n          BEO und ggf. Vertreter Markus Hellmol, Frank Nähring\nSponsor/Fachseite <verwende \"@Nachname, Vorname\", um weitere Beteiligte einzufügen>\nWeitere Stakeholder <weitere Bereiche, wie z. B. Service, Technik, Wholesale, etc.>\nWeitere AnsprP <z. B. Stage Gate Projektnummer/Ersteller der Vorlage>\nSonstiges \nHier ist bei Bedarf Platz für sonstige Information.\n\nBusiness Scope:\nZiel ist es, die Adoption (die Nutzbarkeit) von MagentaForce zu erhöhen. Mit der AI gestützten Specht/Text/Action Funktion ist es möglich, dass ein SalesRep adhoc Infomationen in MagentaForce hinterlegen kann und dies auch mobil von seinem Handy aus. Diese Funktion wird Sales Zeit sparen (500 Sales Mitarbeiter, 15 Min/Tag x 5Tage = 37500 Min/Woche) und motivieren, die Datenqualität in MagentaForce signifikant zu erhöhen.",
  "business_value": {
    "business_impact": {
      "scale": 13,
      "revenue": "",
      "cost_saving": "3,25 Mio EUR savings (umgerechnet gesparte Arbeitszeit 62.500 EUR / Woche)",
      "risk_loss": "",
      "justification": "Alelrdings ist dies kein Effizienzcase; Ambition ist, diese Zeit für mehr Real Selling Time zu nutzen NPS (!!!!) Mit dieser Funktion werden wir die erwartete Verbesserung des NPS (Nutzerzufriedenheit via Net Promotor Score) erhöhen (Ambition Klaus Werner war 10 Punkte je NPS Frage)."
    },
    "strategic_enablement": {
      "scale": 8,
      "risk_minimization": "",
      "strat_enablement": "NPS Steigerung (Mitarbeiterzufriedenheit)",
      "justification": "Digitale Transformation und Einsatz AI Vereinfachter Arbeitsablauf spart Zeit Verbessert Datengenauigkeit"
    },
    "time_criticality": {
      "scale": 8,
      "time": "Geplanter Umsetzungszeitraum Plan Start: 01.07.2025 Plan Ende/Launch: 30.09.2025",
      "justification": "Erhöhung der Hitrate und NPS Verbesserung"
    }
  },
  "assignee": "Frank Nähring",
  "priority": "",
  "target_start": "2025-07-01",
  "target_end": "2025-09-30",
  "fix_versions": [],
  "acceptance_criteria": [],
  "components": [
    {
      "code": "DOM0201",
      "title": "DOM0201 B2B Standard - Mass Market"
    }
  ],
  "labels": [
    "Cross-vertical",
    "GK-LEET"
  ],
  "realized_by": [],
  "child_issues": [],
  "attachments": []
}