{
  "key": "BEMABU-2341",
  "issue_type": "Business Epic",
  "title": "Mehrgewerke Angebotserstellung im Solution Business - Übergreifende Document-Engine",
  "status": "Funnel",
  "description": "Description\nAllgemeine Informationen zum Business Epic (BE)\nBusiness Epic Nutzenstatement\nFür Sales Teams\ndie integrierte Bestandteile des Warenkorbs in ein Angebot überführen möchten\nist eine halbautomatische1 Angebote-Dokumentengenerierung als auch Dokumentenablage zur Erstellung von bindenden und nicht-bindenden Angeboten sowie angebotsbegleitenden Unterlagen notwendig,\nwodurch Dokumentenpakete mit allen angebotsnotwendigen Dokumenten mittels einem Tool bereitgestellt werden\nso dass die Erstellung und Übergabe der Dokumentenpakete für den Kunden (SalesTeam) vereinfacht wird \nund nicht eine Nutzung mehrerer Tools oder eine manuelle Zusammenstellung aus Dokumentenvorlagen notwendig ist\nDas Vorhaben schafft eine Reduzierung manueller Aufwände bei der Erstellung von Angeboten für Kunden durch die Bereitstellung von (ready-to-use) Dokumentenpaketen mit allen benötigten Teildokumenten (Anschreiben, rechtliche Hinweise, Preisübersichten, Produkt- und Leistungsbeschreibungen, Sideletter) aus einem Tool UND die Voraussetzung für ein mögliches Retirement des Offer Support Tools (OST).\nNotwendige Features zur Funktionsgleichheit mit OST:\nAbsender der Angebote aus verschiedenen Org-Einheiten (TDG GK, DTBS) mit unterschiedlichen Anschreiben\nMehrsprachigkeit der Dokumentenablage und DocEngine (deutsch/englisch)\nBereits geplant:\n1halbautomatische Angebote-Dokumentengenerierung: DocEngine liest Produkte in Panda-Warenkorb aus und schlägt Teildokumente auf Basis der Produkte im Warenkorb zur Angebotserstellung vor.\n  Rahmenbedingungen\nIn Scope \nAblösung der bestehenden Dokumenten-Generierungs Funktion aus PANDA CPQ und Erstellung eines neuen Microservices\nErstellung von bindendend und nicht bindenden Angeboten\nErstellung von „Dokumentenpaketen“ die dem Kunden übergeben werden können\nErstellung von Einzeldokumenten (z.B. Sales Report)\nUpload, Editieren und Löschen von Zusatzdokumenten für bindende / nicht-bindende Angebot\nEinsprung in die DocGen-Dokumentengenerierung aus PANDA CPQ\nEinsprung in die Dokumentenablage ausgehend von der PANDA Startseite\nMöglichkeit zur Versendung erstellter Dokumente an den Kunden\nMöglichkeit zur Archivierung erstellter Dokumente die dem Kunden übergeben wurden\nRollenkonzept und Workflow zur kontinuierlichen Pflege von Dokumenten und Textbausteine\nOut of Scope\nDocGen nimmt keine Preiskalkulationen vor. Diese müssen in DocGen übergeben werden. Dies soll vom „Calc-Service“ / Deal View vom Vega-Team umgesetzt werden. (ggf. https://jira.telekom.de/browse/BEMABU-2340)\nMigration des OST-Tool ist hier nicht berücksichtigt\nIntegration von DocuSign in die Dokumenten-Erstellung\nAbhängigkeiten/Wechselbeziehungen - Eingangsvoraussetzungen\nZulieferungen von VEGA-Team notwendig. U.a. Einführung von Produkt-IDs um Produktdatensätze zuzuordnen. Aufgrund FIB-Tool Anforderungen bei VEGA und zeitlichem Druck wird hier ein mapping eingeführt, das aber zeitnah abgelöst werden sollte (https://jira.telekom.de/browse/SDN-21212)\nCross Funktionale Zusammenarbeit\nBeteiligte IT-Applikationen /\nTechnik-Bereiche Beteiligte\nDomains (Tel-IT) Ansprechpartner Bemerkungen                                                                  \nPANDA / SD-X DOM0204 Jupitz, Carsten  System Architect\n< ... > DOM.... <verwende \"@Vorname Nachname\">  \n< ... > DOM.... <verwende \"@Vorname Nachname\">  \n  BEO und ggf. Vertreter <verwende \"@Nachname, Vorname\", um weitere Beteiligte einzufügen>\nSponsor/Fachseite Markus Hellmold Thomas Claßen\nWeitere Stakeholder <weitere Bereiche, wie z. B. Service, Technik, Wholesale, etc.>\nWeitere AnsprP <z. B. Stage Gate Projektnummer/Ersteller der Vorlage>\nSonstiges \nHier ist bei Bedarf Platz für sonstige Information.",
  "business_value": {
    "business_impact": {
      "scale": 0,
      "revenue": "",
      "cost_saving": "Reduzierung manueller Aufwände bei der Erstellung von Angeboten für Kunden",
      "risk_loss": "",
      "justification": "Das Vorhaben schafft eine Reduzierung manueller Aufwände bei der Erstellung von Angeboten für Kunden durch die Bereitstellung von (ready-to-use) Dokumentenpaketen mit allen benötigten Teildokumenten (Anschreiben, rechtliche Hinweise, Preisübersichten, Produkt- und Leistungsbeschreibungen, Sideletter) aus einem Tool UND die Voraussetzung für ein mögliches Retirement des Offer Support Tools (OST)."
    },
    "strategic_enablement": {
      "scale": 0,
      "risk_minimization": "",
      "strat_enablement": "Voraussetzung für ein mögliches Retirement des Offer Support Tools (OST)",
      "justification": ""
    },
    "time_criticality": {
      "scale": 0,
      "time": "",
      "justification": ""
    }
  },
  "assignee": "Christine Bienias",
  "priority": "",
  "target_start": "",
  "target_end": "",
  "fix_versions": [],
  "acceptance_criteria": [],
  "components": [],
  "labels": [],
  "realized_by": [],
  "child_issues": [],
  "attachments": []
}