{
  "key": "BEMABU-1782",
  "issue_type": "Business Initiative",
  "title": "Rechtliche Sicherstellung und Schöpfung von Marktpotentialen - Konzerneinwilligungsklausel",
  "status": "Funnel",
  "description": "Description\nBeschreibung der Maßnahme\nFür  TD GK B2B (KMU, Midmarket, LargeEnterprise, Public)die eine Konzerneinwilligungsklausel abgeben oder widerrufen,\nist  ein Zentrales Mastersystem innerhalb GK notwendig um Verbesserung des KEK-Prozesses durch Automatisierung und Optimierung der Workflows umzusetzen,\nwodurch für alle Segmente (KMU, Midmarket, Large Enterprise, Public) die Konzerneinwilligungsklausel - Datenschutzeinwilligung des Geschäftspartner und Kanal-Permissionen der Ansprechpartner, rechtssicher systemisch abgebildet werden können\nso dass einer Einführung von KEK-X im KMU Segment und die rechtliche Handhabe in den Segmenten Midmarket, Large Enterprise und Public nicht im Wege steht\n\nund nicht wie bisher mehrere Mastersysteme (CRM-T, Carmen, MagentaForce) mit inkonsistenten Daten existieren und wir uns innerhalb GK in einen rechtlichen Graubereich bewegen.\nDas Vorhaben schafft einen Single Point of Truth für die Konzerneinwilligungsklausel innerhalb GK mit einer konsolidierten Sicht auf die Person. Hiermit wird sichergestellt dass wir innerhalb GK alle Segmente abbilden können und die KEK rechtssicher in den Systemen abgebildet  ist und rechtssicher von den Systemen genutzt werden kann.\n    Day1Readiness KEK Large Enterprise (DTBS Kunden, Obligatory)\nIn diesem Steckbrief müsste aufgeführt werden was wir kurzfristig tun können um rechtssicher für die DTBS Kunden zu sein\nEinholung der T-Deutschland KEK für alle DTBS Kunden?\nEinführung KEK-X für KMU Kunden\nModulare Abbildung der KEK (Segmentübergreifende Abbildung)\nEinführung von KEK-X für KMU Kunden in Abhängigkeit mit PK\nZentraler Datenmaster für KEK@GK\nEtablierung eines Zentralen Datenmaster für KEK&Permissions innerhalb GK\nSynchronisation der KEK/Permissions mit den PK-Systemen (Carmen, CRM-T, CDP)\nAnpassung KEK-Set\nEinholung KEK (Datenschutzeinwilligung) durch freigegebene Rollen (Vertragspartner, Geschäftsführer) – Kann auch auf KMU adaptiert werden.\nGezielte KEK Einholung eines Geschäftspartner in Abhängigkeit der Rolle in MagentaForce\nEinholung von Permissions unabhängig der KEK (Wie gehen wir mit Interessenten um? Auswirkungen Online KEK Akquise Prozess beachten)\n Trennung zwischen „Dauer“-UWG und „Einmal“-UWG (Zweckgebunden)\nInteraktive Formulare, Live Abfrage KEK/Permission Status (Zu klären ob dies überhaupt Erfolg auf Priorisierung hat)\nLive Abfrage zur Identifizierung der Person und des Zugehörigen Segmentes\nAnzeigen der KEK Abfrage wenn die Rolle Vertragspartner/Geschäftsführer ist und KEK noch nicht abgegeben wurde\nAnzeigen/Editieren der abgegebenen Permissions (Einzelabgabe oder en Bloc?)\nAnpassung und Nutzung der KEK im Gesamten Konzern (Einbeziehen weiterer Konzerneinheiten) – Soll dies auch für KMU gelten?\nVoraussetzung modulare KEK Abbildung – Abbildung weiterer Konzerneinheiten (Einzelzustimmung oder en Bloc?)\nKonsolidierung der KEK&Permissions\nPersonenfokusierte Ausrichtung der Permissions\nErhöhung der Datenqualität und Vermeidung von Datenschutz-Verstößen durch Konsolidierung der Ansprechpartner Permissions\n\nBusiness Scope:\nSingle Point of Truth für die Konzerneinwilligungsklausel innerhalb GK mit einer konsolidierten Sicht auf die Person.",
  "business_value": {},
  "assignee": "Kevin Meigel",
  "priority": "",
  "target_start": "2025-04-01",
  "target_end": "2025-06-30",
  "fix_versions": [
    "PrioQ2_25"
  ],
  "acceptance_criteria": [
    "Mitarbeiter werden bzw. wurden geschult",
    "Kennung werden bzw. wurden an Mitarbeiter in dem benannten Bereich versandt",
    "Zugriff auf die Anwendung ist erfolgt",
    "Support-Weg beim Störungen ist aufgebaut (z.B. via NIMBUS)",
    "Rollen- und Berechtigungskonzept ist erstellt und ist aktiv",
    "Reporting ist sichergestellt --> tbd."
  ],
  "components": [
    {
      "code": "DOM0201",
      "title": "DOM0201 B2B Standard - Mass Market"
    },
    {
      "code": "Top_Demand_2025",
      "title": "Top_Demand_2025 Top Demand"
    }
  ],
  "labels": [
    "B2B_PRIO",
    "B2B_PRIO_EXPL",
    "B2B_Target",
    "Cross-vertical",
    "GK-KMC",
    "GK-LEET",
    "LaO_SEP"
  ],
  "realized_by": [
    {
      "key": "BEMABU-656",
      "title": "BEMABU-656",
      "summary": "KEK Management - Zentraler Datenmasterschaft der KEK x für GK",
      "url": "https://jira.telekom.de/browse/BEMABU-656",
      "relation_type": "realized_by"
    },
    {
      "key": "BEMABU-1129",
      "title": "BEMABU-1129",
      "summary": "Einführung KEK X im KMU-Segment",
      "url": "https://jira.telekom.de/browse/BEMABU-1129",
      "relation_type": "realized_by"
    },
    {
      "key": "BEMABU-1784",
      "title": "BEMABU-1784",
      "summary": "Erweiterung und Optimierung KEK-Set",
      "url": "https://jira.telekom.de/browse/BEMABU-1784",
      "relation_type": "realized_by"
    },
    {
      "key": "BEMABU-1786",
      "title": "BEMABU-1786",
      "summary": "Systemübergreifende Konsolidierung der KEK insbesondere Kanal-Permissionen",
      "url": "https://jira.telekom.de/browse/BEMABU-1786",
      "relation_type": "realized_by"
    },
    {
      "key": "BEMABU-1783",
      "title": "BEMABU-1783",
      "summary": "KEK Management - Analyse inkl. Entscheidung übergreifende B2B KEK",
      "url": "https://jira.telekom.de/browse/BEMABU-1783",
      "relation_type": "realized_by"
    }
  ],
  "child_issues": [],
  "attachments": []
}