{
  "key": "BEMABU-1857",
  "issue_type": "Business Epic",
  "title": "OneForecasting: LE - Forecast NextGen (Exploration Q2-25)",
  "status": "Backlog for Analysis",
  "description": "Description\nBusiness Epic Nutzenstatement\nFür  alle Vertriebsmitarbeiter Large Enterprise, welche in 11/2024 aus den Quellsegmenten GK-XL, GK-L und International zum neuen Bereich LE (Large Enterprise) verschmolzen werden\ndie heute zur Sicherstellung des Umsatzforecasts manuelle Aufwände (Order Backlog Management) und zusätzliche Aufwände (SmartFC) haben\nist eine stärkere Digitalisierung des Forecastprozesses erforderlich, möglichst auch AI gestützt\nwodurch sich die manuellen Aufwände reduzieren und durch präziseres Forecasting die Vorhersagequalität steigt\nso dass  eine bessere und schnellere Steuerung des Vertriebs möglich wird und durch den geringeren Aufwand der Vertrieb mehr Zeit für unsere Kunden hat. Die Verbesserung sollte auch für weitere Vertricals nutzbar sein\nund nicht nur eine LE Lösung werden.\nweitere Details sind hier erfasst: h3. 20241122 Business EPIC OneForecast (Neu) V2.docx\nDas Vorhaben schafft Voraussetzungen für eine bessere Steuerung des Verticals zur Erreichung der geplanten Targets und das zeitnahe agieren um auf Geschäftsentwicklungen wirksam reagieren zu können.\nRahmenbedingungen\nIn Scope / Akzeptanzkriterien - Bitte Jira-Feld \"Akzeptanzkriterien\" befüllen!\nOut of Scope\n<siehe Ausfüllhilfe https://wiki.telekom.de/x/UEVbfQ>\nAbhängigkeiten/Wechselbeziehungen - Eingangsvoraussetzungen\n<siehe Ausfüllhilfe https://wiki.telekom.de/x/UEVbfQ>\nCross Funktionale Zusammenarbeit\nBeteiligte IT-Applikationen /\nTechnik-Bereiche Beteiligte\nDomains (Tel-IT) Ansprechpartner Bemerkungen                                                                  \nMagentaForce DOM0201 Mirco Svensson  \nOne GK DOM0300 Birgit Kruckewitt   \nSmart BI DOM0300 Birgit Kruckewitt , Tom-Oliver Nolting   \nPrediction Engine ISP Conny.Pop@telekom.de, M.Schaarschmidt@telekom.de  \n  BEO und ggf. Vertreter Markus Hellmold und Vertreter Frank Nähring \nSponsor/Fachseite <verwende \"@Nachname, Vorname\", um weitere Beteiligte einzufügen>\nWeitere Stakeholder <weitere Bereiche, wie z. B. Service, Technik, Wholesale, etc.>\nWeitere AnsprP <z. B. Stage Gate Projektnummer/Ersteller der Vorlage>\nSonstiges \nHier ist bei Bedarf Platz für sonstige Informationen\nFinancial Case: Absicherung Umsatz / Neugeschäft\nSicherstellung Zielerreichung (Target Neugeschäft) gemäß iPF 2024:\nAE 2024 : 2,6 Mrd. €, davon 132 Mio. € International\nThereof: Ziel AE über Neugeschäft 2024 à 0,9 Mrd. €\nUmsetzungs-Skizze (in Scope)\nAnalyse von Möglichkeiten eines hochautomatisierten Forecastprozesses auf Basis realer Daten und Informationen aus dem Vertriebsgeschäft\nEntwicklung eines Zielbilds für den Forecastprozess in Large Enterprise (bzw. T-Business / gesamt)\nPerspektivisch: Abschaltung SmartFC (Smarter Forecast) mit Umsetzung vollständiger Forecastprozess aus den IT-Systemen (CRM, SAP)\nLösungsansatz\nUm den gewünschten Business Impact zu erzielen, ist das Business EPIC in 2 IT-Anforderungen unterteilt. Welche in der Summe den beschriebenen Bedarf abdecken.\nStufe 1: Integrierter Forecast (und Wegfall SmartFC)\nEtablierung eines integrierten und automatisierten Forecasts, umgesetzt in OneGK Reporting und provisioniert an entsprechende Zielsysteme (OneGK Reporting selbst, als auch MagentaForce). Dafür erforderlich:\n1.1 Technische Erweiterung der SAP Backendsysteme zur Detaillierung des Order Backlog Managements um angereicherte Informationen (Portfolio, VO-Nr) \n1.2 Provisionierung der Order Backlog Informationen (Umsatzwerte aus Bestandsverträgen) aus den BackEnd Systemen (SAP) nach OneGK Reporting\n1.3 Konsolidierte Sicht und Nutzbarkeit auf alle Bestandsverträge (DTBS und TDG) in MagentaForce via Schnittstelle zu CLM (ServiceNow). Im Ergebniss sollen jegliche Vorhaben zu Vertragserweiterungen / Abrufen / Veränderungen / Verlängerungen systemisch mit den dahinterliegenden Bestandsverträgen verknüpft werden können um die Auswirkungen auf den Order Backlog (Grundrauschen) automatisiert ausweisen zu können.\n1.4 Erweiterung OneGK Reporting um die Möglichkeit zur manuellen Hinterlegung notweniger Adjustments (erfordert strategische Entscheidung dies zuzulassen) um mögliche Einmaleffekte, die nicht in der Sales Pipeline/MagentaForce hinterlegt sind im Forecast gesondert ausweisen zu können.\nStufe 2: Prediction (Pilot Large Enterprise, mit Lösung der ISP und MagentaForce) -> BEMABU-2077\nWird in ein eigenes Business Epic gesplittet, da aufgrund Ressourcenengpass bei ISP aktuell nicht gestartet werden kann.\nAufwandsschätzung - T-Shirt Size\n  Tel-IT Technik sonstige\nSize M    \nS: <400 k€ / M: 400 k€ - < 1 m€ / L: 1 - 3 m€ / XL: > 3 m€\n\nBusiness Scope:\nOptimierung des Forecastprozesses in T-Business, Optimierung und Transparenz zu den für den Forecast relevanten und heute verteilten Informationen. Technische Konsolidierung der relevanten Systeme und Automatisierung des Forecastprozesses als solches. Dadurch bessere Planbarkeit / Steuerung des jeweiligen Businessbereiche.",
  "business_value": {
    "business_impact": {
      "scale": 13,
      "revenue": "",
      "cost_saving": "580 Tsd / Jahr",
      "risk_loss": "",
      "justification": "Effizienz Case, Expertenschätzung: 200 ACM, 144 TSD Minuten (60 Min Zeitersparnis/Monat) = 200 TSD EUR/JAHR 10 Finanzer, 5 Steuerer je 1 AT / Monat = 130 TSD / Jahr Savings Betrieb SMART (Smarter Forecast) = 250 TSD Summe: 580 TSD Jahr{}"
    },
    "strategic_enablement": {
      "scale": 8,
      "risk_minimization": "",
      "strat_enablement": "Erhöht die Kundenerfahrung/bindung oder das TD Image in besonderem Maße, z. B. einzigartiger Login, Prozessvereinfachung oder disruptive/architektonische Innovation",
      "justification": "Mitigieren von Risiken falscher oder ungenauer Forecastwerte / Sicherstellung der Zielerreichung über Transparenz zu OrderBacklog+Pipeline und Möglichkeit zur Ableitung von vertrieblichen Maßnahmen Schaffung zusätzlicher Sales Kapazitäten über die automatisierung des IT-gestützten Forecastprozesses und abschalten des redundanten Forecastest (SmartFC) Bessere Abstimmung zwischen Sales und Delivery betreffend Bestandsvertragsmanagement und Forecasting für Neugeschäft Enabler für optimierte Ressourcen- / Lagerplanung (OPC)"
    },
    "time_criticality": {
      "scale": 8,
      "time": "Geplanter Umsetzungszeitraum Plan Start: 2024 Plan Ende/Launch: 30.09.2025",
      "justification": "Verwirklichung der Umsetzung spätestens zum nächsten Geschäftsjahr. Ungenaue Forecasts führen zu potenziell falschen Management-Entscheidungen. Weshalb es wichtig ist, ein möglichst exaktes Bild zu bekommen, wo ich als Mitarbeiter, das Team, das Vertical aktuell steht. Wie ich / das Team / das Vertical in den verschiedenen Vertriebsthemen stehe (Portfolio Cluster IT, TK, MK; Offerings: Lizenzen, Services, Resell Geschäft etc). Über den Forecast lassen sich Handlungsbedarfe ableiten, um die gewünschten Zielsetzungen am Ende eines Zeitraums (Geschäftsjahr, Ausblick) erreichen zu können."
    }
  },
  "assignee": "Markus Hellmold",
  "priority": "",
  "target_start": "2025-07-01",
  "target_end": "2025-09-30",
  "fix_versions": [
    "PrioQ2_25"
  ],
  "acceptance_criteria": [
    "Q1: Erstanalyse mit BI-Domain\nQ2: Exploration mit Magentaforce und BI inkl. Smart\nQ3/Q4: Start der ersten Realisierungen gemäß Ergebnis der Exploration"
  ],
  "components": [
    {
      "code": "DOM0201",
      "title": "DOM0201 B2B Standard - Mass Market"
    }
  ],
  "labels": [
    "B2B_PRIO",
    "B2B_PRIO_EXPL",
    "B2B_Target",
    "Cross-vertical",
    "GK-LEET"
  ],
  "realized_by": [
    {
      "key": "MAGBUS-103797",
      "title": "MAGBUS-103797",
      "summary": "LE: Exploration OneForecasting",
      "url": "https://jira.telekom.de/browse/MAGBUS-103797",
      "relation_type": "realized_by"
    },
    {
      "key": "DATAFAB-32009",
      "title": "DATAFAB-32009",
      "summary": "LE: ONEPROCESS - One Forecasting (Day2)",
      "url": "https://jira.telekom.de/browse/DATAFAB-32009",
      "relation_type": "child"
    }
  ],
  "child_issues": [],
  "attachments": [
    {
      "filename": "20241122 Business EPIC OneForecast (Neu) V2.docx",
      "url": "https://jira.telekom.de/secure/attachment/5174299/20241122%20Business%20EPIC%20OneForecast%20%28Neu%29%20V2.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document",
      "size": "25 kB",
      "date": "2024-11-28T18:27:44.554+01:00"
    },
    {
      "filename": "OneDataDrivenSales@T-Business_Struktur_Jira.jpg",
      "url": "https://jira.telekom.de/secure/attachment/4996749/OneDataDrivenSales%40T-Business_Struktur_Jira.jpg",
      "mime_type": "image/jpeg",
      "size": "117 kB",
      "date": "2024-09-27T12:25:46.397+02:00"
    }
  ]
}