{
  "key": "BEMABU-2147",
  "issue_type": "Business Epic",
  "title": "GKPV: Implementierung von Partner Sales Management in Magenta Force",
  "status": "Funnel",
  "description": "Description\nAllgemeine Informationen zum Business Epic (BE)\nBusiness Epic Nutzenstatement\nFür Partner Account Manager,\ndie Partner und deren Sales Aktivitäten steuern,\nist eine Transparenz über die Aktivitäten und vereinbarten Maßnahmen sowie deren Umsetzung essentiell,\nwodurch das Sales Management insgesamt entscheidend verbessert wird,\nso dass die gesteckten Ziele und Umsätze erreicht werden,\nund nicht Partner und Direktvertrieb durch zu langsame Umsetzung Umsätze an den Wettbewerb verlieren.\nDas Vorhaben schafft eine Wettbewerbsfähigkeit, die es der Deutschen Telekom erlaubt, im ersten Schritt auf Augenhöhe und im zweiten Schritt vor den Wettbewerb zu kommen. Dieses Business Epic hilft allen Kanälen bei der Abstimmung mit Partner Sales.\nDieses Business Epic zahlt auf den Partner Boost ein, der Mitte 2024 vom T Business Board beschlossen wurde. \n  Rahmenbedingungen\nIn Scope / Akzeptanzkriterien - Bitte Jira-Feld \"Akzeptanzkriterien\" befüllen!\nOut of Scope\nEine funktionelle Erweiterung von Magenta Force ist zu diesem Zeitpunkt nicht Bestandteil\nAuftragssteuerung über Flamingo/ Magenta Force\nLead Management\nProvisionsaussteuerung\nAnlage der PAMs in Magenta Force- diese sind bereits angelegt\nAbhängigkeiten/Wechselbeziehungen - Eingangsvoraussetzungen\n<siehe Ausfüllhilfe https://wiki.telekom.de/x/UEVbfQ>\nCross Funktionale Zusammenarbeit\nBeteiligte IT-Applikationen /\nTechnik-Bereiche Beteiligte\nDomains (Tel-IT) Ansprechpartner Bemerkungen                                                                  \nMagentaForce DOM0201 Mirco Svensson\nMatthias Johannes Hoffmann  \n< ... > DOM....    \n< ... >      \n  BEO und ggf. Vertreter Jörg Linnemeier \nSponsor/Fachseite robert.kluetsch@telekom.de\nWeitere Stakeholder  \nWeitere AnsprP  \nSonstiges \nDie Rollen der Partner Account Manager sind aus unserer Sicht bereits passend. Die Rollen für die Regionalleiter Partner Sales und die Partner Sales Admins wären noch zu definieren. Zum jetzigen Zeitpunkt gehen wir von der Nutzung vorhandener Rollen aus.",
  "business_value": {
    "business_impact": {
      "scale": 1,
      "revenue": "120.000 €",
      "cost_saving": "Cost saving",
      "risk_loss": "",
      "justification": "Durch geringeren Zeitaufwand bei Abstimmungen mit dem Direktvertrieb haben die PAMs mehr vertriebsaktive Zeit zur Verfügung, die zu mehr Umsatz führen wird. Der Zeitaufwand betrifft vor allem Vorhaben, bei denen der Direktvertrieb und ein Partner gleichzeitig auf einen Endkunden zugehen. Hier sind Abstimmungsrunden notwendig, um das Vorgehen festzulegen und nicht die Marke Deutsche Telekom zu schädigen. 24 betroffene PAMs x 10 Stunden Abstimmung/ Jahr x 500 € Umsatz"
    },
    "strategic_enablement": {
      "scale": 3,
      "risk_minimization": "Komplexitätsreduzierungen",
      "strat_enablement": "",
      "justification": "Eine Sicht auf Unternehmen, mit dem die Deutsche Telekom in einem Kundenverhältnis und einem Partnerverhältnis im Vertrieb steht. Zahlt auf das Wachstumfeld \"Effizienzsteigerung und Digitalisierung\" ein"
    },
    "time_criticality": {
      "scale": 8,
      "time": "Geplanter Umsetzungszeitraum Plan Start: Q3/ 2025 Plan Ende/Launch: End of 2025",
      "justification": "Je früher eine gemeinsame Sicht auf Kunden und Partner erfolgen kann, desto besser können sich die PAMs und der Direktvertrieb in größeren Ausschreibungen und beim Kundenangang koordinieren, um einen abgestimmten Kundenangang zu gewährleisten."
    }
  },
  "assignee": "Jörg Linnemeier",
  "priority": "",
  "target_start": "2025-07-01",
  "target_end": "2025-09-30",
  "fix_versions": [],
  "acceptance_criteria": [
    "Ein Unternehmen kann zweimal in Magenta Force existieren- einmal als Kunde des Direktvertriebes, einmal als Sales Partner für Partner Sales",
    "Die Partner Account Manager (PAM) können Magenta Force zur Pflege der zugeordneten Partner nutzen",
    "Die PAMs können jeweils ihre zugeordneten Unternehmen als Partner und als Kunde sehen",
    "Die Regionalleiter können alle Unternehmen der jeweiligen Region als Partner und Kunde sehen (Rolle: tbd.)",
    "Eine Sicht für Partner Sales Admins erlaubt die Sicht auf alle Partner (Rolle: tbd.)",
    "Die Partnerbeziehungen und relevanten Daten wurden aus SPRM an Magenta Force übertragen"
  ],
  "components": [
    {
      "code": "DOM0201",
      "title": "DOM0201 B2B Standard - Mass Market"
    }
  ],
  "labels": [
    "2025",
    "Cross-vertical"
  ],
  "realized_by": [],
  "child_issues": [],
  "attachments": []
}