{
  "key": "BEMABU-1825",
  "issue_type": "Business Epic",
  "title": "[NGMobile] [Q1/25] Technical Enabler - New Optimized Mobile Business Order Process",
  "status": "In Progress",
  "description": "Description\n  Situation as is\nToday we have multiple ways to order a new mobile contract with our without a device.  The process is implemented in BSP, GK Portal and MBSP differently. Only in MBSP we have first functionalities that support easy booking and sales recommendations. The checkout is running via 3 different ways and is not always automated.\nUsers have the opportunity to book orders again, like they already ordered before. That helps but does not supply additional sales or easy overview of what is for free.\nNot all mobile products are supported in each order process.\nOptimized generic New Mobile Business Order Process content:\nThe optimized generic new mobile business order process supports the user in a completly new way to order mobile products:\none order process and checkout for all products including Business Flex, Business Mobil, Devices, Mobile Solutions, Business Plan, NEMO and connected Options\nthe user gets the first version of personnalized or customer specific recommendations to enable easy upsell\nopen, to be validated: we add accessories recommendations connected to the specific selected device\nthe user has an easy to understand view on tariffs and options that supports easy selction and booking. It is clearly visible what is feee and what is additionally charged\nthe user gets specific reommendations if he e.g. selects a multisim that is charged in his selected tariff, but is free in a higher tariff \nall customer individually negotiated prices are displayed\nthe portal decides by rights and roles if the user shall see a customer or professional (internal users) mode\nthis is developed in initiative Internal Role MBSP\nthe order can be parked or forwarded to a different person for release  \nOPEN COMMERCIAL DECISION and so far not part of the EPIC: additionally implementation of ratenkauf and leasing\n  Capability Overview:\nProduct Catalog (Supports all kind of products like tariffs, devices & accessories)\nBusiness Processes: New business & ContractProlongation (to be discussed if that is one or 2 microfrontends)\nGSP (for upsell recommendations)\nShoppingCart\nCheckout",
  "business_value": {
    "business_impact": {
      "scale": 3,
      "revenue": "Potenzial für Umsatzsteigerung durch Upselling-Funktionen",
      "cost_saving": "Effizienzsteigerung durch Vereinheitlichung von drei verschiedenen Bestellprozessen",
      "risk_loss": "Reduzierung von Umsatzverlusten durch verbesserte Produktempfehlungen",
      "justification": "Der neue Prozess ermöglicht personalisierte Empfehlungen und Upselling-Möglichkeiten, die im aktuellen System fehlen. Die Vereinheitlichung der drei verschiedenen Bestellprozesse (BSP, GK Portal, MBSP) reduziert Komplexität und Betriebskosten."
    },
    "strategic_enablement": {
      "scale": 4,
      "risk_minimization": "Reduzierung des Risikos von verpassten Verkaufschancen",
      "strat_enablement": "Strategische Vereinheitlichung aller Mobilfunkprodukte in einem Bestellprozess",
      "justification": "Der neue Prozess unterstützt alle Mobilfunkprodukte in einem einheitlichen System, was aktuell nicht der Fall ist. Die klare Darstellung von kostenlosen und kostenpflichtigen Optionen sowie kundenspezifischen Preisen verbessert die strategische Positionierung."
    },
    "time_criticality": {
      "scale": 3,
      "time": "Mittelfristig wichtig für Wettbewerbsfähigkeit",
      "justification": "Die aktuelle fragmentierte Implementierung in verschiedenen Systemen ist nicht zukunftsfähig. Die Vereinheitlichung und Verbesserung des Bestellprozesses ist wichtig, um mit Marktstandards Schritt zu halten."
    },
    "footnotes": [
      "Bezugszeitraum ist 12 Monate nach Launch für neue/zusätzliche Umsatzerlöse",
      "Kosten für Risiken = Schadenshöhe x Eintrittswahrscheinlichkeit"
    ]
  },
  "assignee": "Hillemacher, Thorsten",
  "priority": "",
  "target_start": "",
  "target_end": "2025-12-31",
  "fix_versions": [
    "Q1_25"
  ],
  "acceptance_criteria": [],
  "components": [
    {
      "code": "C14",
      "title": "C14 Enterprise Services und Angebots Prozesse"
    },
    {
      "code": "DOM0201",
      "title": "DOM0201 B2B Standard - Mass Market"
    }
  ],
  "labels": [
    "B2B_PRIO",
    "B2B_Target",
    "GK_Kundencenter",
    "Operations",
    "Roadmap.2025.VSDT"
  ],
  "realized_by": [
    {
      "key": "MOFUDHS-4339",
      "title": "MOFUDHS-4339",
      "summary": "GK: Product information - API access for BSP",
      "url": "https://jira.telekom.de/browse/MOFUDHS-4339",
      "relation_type": "realized_by"
    },
    {
      "key": "MAGBUS-99782",
      "title": "MAGBUS-99782",
      "summary": "New Mobile Business Order Process - Product Catalog Q1",
      "url": "https://jira.telekom.de/browse/MAGBUS-99782",
      "relation_type": "child"
    },
    {
      "key": "MAGBUS-99785",
      "title": "MAGBUS-99785",
      "summary": "New Mobile Business Order Process - Order Management Q1",
      "url": "https://jira.telekom.de/browse/MAGBUS-99785",
      "relation_type": "child"
    },
    {
      "key": "MAGBUS-99839",
      "title": "MAGBUS-99839",
      "summary": "New Mobile Business Order Process - Handling of Customer- (Data) Q1",
      "url": "https://jira.telekom.de/browse/MAGBUS-99839",
      "relation_type": "child"
    },
    {
      "key": "MAGBUS-100447",
      "title": "MAGBUS-100447",
      "summary": "New Mobile Business Order Process - Product Configuration Q1",
      "url": "https://jira.telekom.de/browse/MAGBUS-100447",
      "relation_type": "child"
    },
    {
      "key": "MAGBUS-100454",
      "title": "MAGBUS-100454",
      "summary": "New Mobile Business Order Process - New B2B Frontend System Q1",
      "url": "https://jira.telekom.de/browse/MAGBUS-100454",
      "relation_type": "child"
    }
  ],
  "child_issues": [],
  "attachments": [
    {
      "filename": "Layout_DRAFT_new_mobile_business_order_carmen_scale_down.pdf",
      "url": "https://jira.telekom.de/secure/attachment/4836400/Layout_DRAFT_new_mobile_business_order_carmen_scale_down.pdf",
      "mime_type": "application/pdf",
      "size": "176 kB",
      "date": "2024-08-22T13:04:06.565+02:00"
    }
  ]
}