{
  "key": "BEMABU-2171",
  "issue_type": "Business Epic",
  "title": "Deep-links for Sales-Journeys from MMKC2.0 (Interims Solution)",
  "status": "Funnel",
  "description": "Description\nAllgemeine Informationen zum Business Epic (BE)\n-------------------------------------------------------------------------------\nOur customers from SME use primarily the MMKC2.0.\nIn general, they can see their inventory with regards to contracts from fixed and mobile.\nThe fixed contracts are displayed per default.\nThe mobile contracts are only shown as inventory, once you successfully completed the federation/login-linker-journey inkluding 2FA.\nOnce you completed that, you are able to see mobile contracts as inventory. For starting any sales-related journey, such as \"contract prolongation\" and \"tariff change\" you need to to click on a CTA-button in oder to start the journey.\nBusiness Epic Nutzenstatement\nFor existing B2B SME+ mobile customers\nwho use self-service and are logged in MMKC 2.0\nis directly forwarded to special areas in the corresponding B2B system necessary\nthat customers can start with them issue immediately, without log in and going to dashboard,\nto achieve the necessary changes themselfes, without service help,\nand not dissapointed by the lack of functionality in MMKC 2.0.\nFür bestehende B2B-KMU-Mobilfunkkunden\ndie Selbstbedienung nutzen und im MMKC 2.0 angemeldet sind\nist eine direkte Weiterleitung zu speziellen Bereichen des korrespondierende B2B Systems notwendig\ndass die Kunden sofort mit der Bearbeitung beginnen können, ohne sich einzuloggen und zum Dashboard zu gehen,\num die notwendigen Änderungen selbst, ohne Hilfe des Service, durchzuführen,\nund nicht durch die fehlende Funktionalität in MMKC 2.0 enttäuscht werden.\nRahmenbedingungen\nIn Scope / Akzeptanzkriterien - Bitte Jira-Feld \"Akzeptanzkriterien\" befüllen!\nOut of Scope\nSeemless integration into MMKC 2.0 (this is covered by BEMAU-2085)\nAbhängigkeiten/Wechselbeziehungen - Eingangsvoraussetzungen\n<siehe Ausfüllhilfe https://wiki.telekom.de/x/UEVbfQ>\nCross Funktionale Zusammenarbeit\nBeteiligte IT-Applikationen /\nTechnik-Bereiche Beteiligte\nDomains (Tel-IT) Ansprechpartner Bemerkungen                                                                  \n< ... > DOM.... <verwende \"@Vorname Nachname\">  \n< ... > DOM....    \n< ... >      \n  BEO und ggf. Vertreter Tom Lück, Daniel Kunz, Anna Sluka\nSponsor/Fachseite Adina Gebara / GK KMU\nWeitere Stakeholder -\nWeitere AnsprP MMKC2.0 (Digital Care)\nSonstiges \nHier ist bei Bedarf Platz für sonstige Information.\n\nBusiness Scope:\nInterims solution for B2B mobile journeys which are not available on OneX platforms in 2025",
  "business_value": {
    "business_impact": {
      "scale": 8,
      "revenue": ">786 T€",
      "cost_saving": "Savings due to self service instead of customer service activities",
      "risk_loss": "the additional churn risk is not rated",
      "justification": "Savings due to self service instead of customer service activities; the additional churn risk is not rated."
    },
    "strategic_enablement": {
      "scale": 8,
      "risk_minimization": "risk eliminated",
      "strat_enablement": "relevant competitive advantage",
      "justification": "We need to safeguard the SME+ mobile business growth in the B2B systems until the DOT readiness. The existing sub-level model must continue to operate within MBSP and other B2B systems due to DOT's limited implementation scope. That avoids customer and revenue move from B2B to B2C. Especially mobile revenues are counted via product category, not customer segment. Therefore we have the risk, that without additional invest in up- and cross sell customers can´t be developed in the right direction."
    },
    "time_criticality": {
      "scale": 20,
      "time": "PI 25.2",
      "justification": "The integration of mobile B2B business for SME+ customers into DOT systems has been delayed to 2026. As a result, the existing B2B systems remain the home base not only for SME customers that do not migrate to DOT at all but also for SME+ customers with B2B mobile contracts in 2025. The implementation of the requirement in MMKC (dependencies) has already been planned for PI 25.2 (or later)."
    }
  },
  "assignee": "Tom Lück",
  "priority": "",
  "target_start": "2025-04-01",
  "target_end": "2025-10-31",
  "fix_versions": [],
  "acceptance_criteria": [
    "A list of DeepLinks for all native journeys in the corresponding B2B system (to be define with development team) has been provided.",
    "Redirection leads directly to the respective use case via correct deep-link without log in request.",
    "At least the following acceptance criteria are met:\nIf the mobile customer clicks on the ‘change tariff’ button in MMKC 2.0, he is forwarded directly to the ‘change tariff’ function in the corresponding B2B system.\nIf the mobile customer clicks on the ‘contract prolongation’ button in MMKC 2.0, he is forwarded directly to the ‘tariff change’ function in the corresponding B2B system.\nIf mobile customer wants to call up an invoice overview, they are forwarded directly to the invoice area in the corresponding B2B system.",
    "If the mobile customer clicks on the ‘change tariff’ button in MMKC 2.0, he is forwarded directly to the ‘change tariff’ function in the corresponding B2B system.",
    "If the mobile customer clicks on the ‘contract prolongation’ button in MMKC 2.0, he is forwarded directly to the ‘tariff change’ function in the corresponding B2B system.",
    "If mobile customer wants to call up an invoice overview, they are forwarded directly to the invoice area in the corresponding B2B system."
  ],
  "components": [
    {
      "code": "DOM0201",
      "title": "DOM0201 B2B Standard - Mass Market"
    }
  ],
  "labels": [
    "Cross-vertical",
    "GK-KMC",
    "MaxDOT",
    "MaxDOT_MF"
  ],
  "realized_by": [],
  "child_issues": [],
  "attachments": [
    {
      "filename": "Journey from MMKC to MBSP.pdf",
      "url": "https://jira.telekom.de/secure/attachment/5367637/Journey%20from%20MMKC%20to%20MBSP.pdf",
      "mime_type": "application/pdf",
      "size": "121 kB",
      "date": "2025-02-04T16:50:38.273+01:00"
    }
  ]
}