{
  "key": "BEMABU-1495",
  "issue_type": "Business Epic",
  "title": "MagentaForce MMS Onboarding",
  "status": "Closed",
  "description": "Description\nBusiness Epic Owner:  Martin Koch martin.koch02@telekom.de\nAnsprechpartner für Portfolio-Themen MMS: Matthias Lohse mlohse@telekom.de\n  Aus dem Steckbrief 173 Zugriff Magenta Force für MMS Mitarbeiter\n(https://wiki.telekom.de/pages/viewpage.action?pageId=1480278638)\n  Für wen? MMS Market Unit, SVPs/VPs\n \n—\n \nIn Lizenzplanung hinterlegt: 20 Lizenzen\n \nWunsch MMS: 30-50\n  Welches Bedürfnis? Lesende und schreibende Sicht auf sämtliche Akquisen (Leads, Opportunities) in MagentaForce  \n \n \n  Wie wird es gemacht? Rolle für MMS (analog zu T-SEC, IOT)\n \nDas bedeutet grob: * 3 schreibende, segmentübergreifende Rollen:\n(MMS) Teamleiter\n(MMS) Mitarbeiter\n(MMS) Fachadministrator (Export-Recht für einen festdefinierten Vorhaben-Export), wenige Nutzer\nSegmentübergreifende Sicht auf Geschäftspartner, für die Segmente für die sie berechtigt sind (LE, MM, KMU, Public, T Digital) und segmentübergreifenden Zugriff auf alle Vorhaben (gemäß Sharing-Konzept, siehe unten)\nEigene Warteschlange \"…MMS…\" mit den Spalten: Name, Firma, Geschäftspartner, Lead Status, Lead-Quelle, Wiedervorlage, vsl. Abschluss, Primär-Kampagnenquelle, Sekundär-Kampagnenquelle, Kampagnentyp, Erstelldatum\nStandard-Listen verfügbar am GP, Vorhaben, Leads, ASPs Kunde, Vorgänge, Kampagnen, Aufgaben, Kontaktberichte (keine Beschäftigen-Attribute hinterlegt)\nKein Reporting, nur ein Export zu (MMS-)Vorhaben für den Fachadmin\nDie Rolle \"… Teamleiter\" hat in Listen keine Möglichkeiten auf Mitarbeiter-scharfe Infos zu schauen.\nWas ist der Mehrwert? Mehr-OE/ Umsatz für TDG, Kostenreduzierung\nWas ist der Differenzierer - das \"Warum\"? T-Digital als Preferred-Delivery Partner, Abgestimmter Auftritt vor Kunde, Gemeinsame Vertriebsangänge, Ganzheitliche Bestandskundenentwicklung verbessern aus Telekom-Sicht, Erleichterte und effizientere Vertriebsabstimmungen, Erzeugung Gesamtbild aus T-Digital\nSharing-Konzept für Vorhaben Status Quo für IoT/T-Sec:\nIoT/T-Sec erhalten bei den Segmenten KMUB und GK-VM ihre Sichtbarkeitsberechtigung über das sogenannte Territory.\nDies bewirkt den Zugriff für alle Geschäftspartner dieser Segmente und alle zugehörigen Vorhaben.\nFür die Segmente Public und LE erhält IoT/T-Sec die Sichtbarkeitsberechtigung über das sogenannte Sharing.\nDieses Sharing stellt den Zugriff auf die Geschäftspartner sicher (z.B. für die Vorhabenneuanlage), schränkt aber die Sichtbarkeit der Vorhaben auf die eigenen und die mit Security-Portfolio ein. Maßgeblich für die Zuordnung zu IoT/T-Sec ist das Produktcluster („Security“ oder \"IoT\") des jeweiligen Produkts.\n \n--> Sharing Optimierung ebenfalls für Q1 geplant|",
  "business_value": {
    "business_impact": {
      "scale": 0,
      "revenue": "Mehr-OE/Umsatz für TDG",
      "cost_saving": "Kostenreduzierung",
      "risk_loss": "",
      "justification": "T-Digital als Preferred-Delivery Partner, Abgestimmter Auftritt vor Kunde, Gemeinsame Vertriebsangänge"
    },
    "strategic_enablement": {
      "scale": 0,
      "risk_minimization": "",
      "strat_enablement": "Ganzheitliche Bestandskundenentwicklung verbessern aus Telekom-Sicht, Erleichterte und effizientere Vertriebsabstimmungen, Erzeugung Gesamtbild aus T-Digital",
      "justification": "Lesende und schreibende Sicht auf sämtliche Akquisen (Leads, Opportunities) in MagentaForce"
    },
    "time_criticality": {
      "scale": 0,
      "time": "Sharing Optimierung für Q1 geplant",
      "justification": ""
    },
    "footnotes": [
      "Bezugszeitraum ist 12 Monate nach Launch für neue/zusätzliche Umsatzerlöse",
      "Kosten für Risiken = Schadenshöhe x Eintrittswahrscheinlichkeit"
    ]
  },
  "assignee": "Martin Koch",
  "priority": "",
  "target_start": "2024-04-01",
  "target_end": "2025-03-28",
  "fix_versions": [
    "Q1_25",
    "PrioQ1_25"
  ],
  "acceptance_criteria": [],
  "components": [
    {
      "code": "DOM0201",
      "title": "DOM0201 B2B Standard - Mass Market"
    },
    {
      "code": "Top_Demand_2025",
      "title": "Top_Demand_2025 Top Demand"
    }
  ],
  "labels": [
    "B2B_PRIO",
    "B2B_Prio_2024",
    "B2B_Target",
    "Cross-vertical",
    "Customer-Transparency",
    "E2E_Trafo_Kd_Markttransparenz",
    "LaO_MF",
    "LaO_TC"
  ],
  "realized_by": [
    {
      "key": "MAGBUS-87860",
      "title": "MAGBUS-87860",
      "summary": "MF: MMS Onboarding",
      "url": "https://jira.telekom.de/browse/MAGBUS-87860",
      "relation_type": "realized_by"
    }
  ],
  "child_issues": [],
  "attachments": []
}