{
  "key": "BEMABU-1783",
  "issue_type": "Business Epic",
  "title": "KEK Management - Analyse inkl. Entscheidung übergreifende B2B KEK",
  "status": "Closed",
  "description": "Description\nProblembeschreibung\nFür  TD GK B2B \ndie ab dem 01.11. Kunden mit unterschiedlichen Vertragsverhältnissen betreuen (TDG, DTBS, INT, MMS, T-Sec, IoT, T-System), muss eine Anpassung des KEK-Prozesses durchgeführt werden.\nHeute ist die KEK 4.5 eine Datenschutzeinwilligung mit Vertragsanalyse (zusätzlich zur Kanal Permission) für TDG rechtskonform. Kunden mit anderen Vertragsverhältnissen sind heute nicht berücksichtigt\nwodurch die TDG bei Datenschutzeinwilligung und UWG einen Rechtsverstoß aufzeigt,\nso dass  für Kunden außerhalb der TDG Datenschutzeinwilligung keine Vertragsanalysen und regelmäßigen werblichen Kontakt und Nurturing durchgeführt werden dürfte.\nund nicht \nDas Vorhaben schafft eine rechtsverbindliche Dokumentation im Umfeld von juristischen Personen zur Zustimmung der werblichen Ansprache auf allen Marketingkanälen innerhalb der TDG und relevanten Tochtergesellschaften. Die Nichtbeachtung dieser Gesetze kann Strafzahlungen von bis zu 20 Mio. € bzw. 4% des Konzernumsatzes zur Folge haben. Beim Verstoß gegen den Datenschutz ist außerdem eine persönliche Haftung möglich.\n  Business Epic Outcome Hypothesis",
  "business_value": {
    "business_impact": {
      "scale": 0,
      "revenue": "",
      "cost_saving": "",
      "risk_loss": "Strafzahlungen von bis zu 20 Mio. € bzw. 4% des Konzernumsatzes",
      "justification": "Das Vorhaben schafft eine rechtsverbindliche Dokumentation im Umfeld von juristischen Personen zur Zustimmung der werblichen Ansprache auf allen Marketingkanälen innerhalb der TDG und relevanten Tochtergesellschaften."
    },
    "strategic_enablement": {
      "scale": 0,
      "risk_minimization": "Beim Verstoß gegen den Datenschutz ist außerdem eine persönliche Haftung möglich.",
      "strat_enablement": "",
      "justification": ""
    },
    "time_criticality": {
      "scale": 0,
      "time": "ab dem 01.11.",
      "justification": ""
    }
  },
  "assignee": "Kevin Meigel",
  "priority": "",
  "target_start": "2025-01-01",
  "target_end": "2025-03-31",
  "fix_versions": [
    "PrioQ1_25"
  ],
  "acceptance_criteria": [
    "Eine Analye der KEK Landschaft in B2B ist für alle Gesellschaften (DTBS, TDG, MMS, T-Sec, IoT, International, T-System) erfolgt",
    "Anhand der Analyse wurden Entscheidungen für ein gemeinsames fachliches und architekturelles Zielbild innerhalb GK getroffen",
    "Legal wurde beauftragt einen KEK-Text für B2B zu verfassen.",
    "Regeln für den Übergang eines Kunden von SME+ nach KMU (KMU nach Midmarket/LargeEnterprise) sind definiert"
  ],
  "components": [
    {
      "code": "DOM0201",
      "title": "DOM0201 B2B Standard - Mass Market"
    }
  ],
  "labels": [
    "B2B_PRIO_EXPL",
    "B2B_Prio",
    "B2B_Target",
    "Cross-vertical",
    "LaO_SEP"
  ],
  "realized_by": [
    {
      "key": "MAGBUS-99989",
      "title": "MAGBUS-99989",
      "summary": "SEP: Analyse KEK Management B2B",
      "url": "https://jira.telekom.de/browse/MAGBUS-99989",
      "relation_type": "realized_by"
    }
  ],
  "child_issues": [],
  "attachments": []
}