{
  "key": "BEMABU-2339",
  "issue_type": "Business Epic",
  "title": "Mehrgewerke Angebotserstellung im Solution Business - Smart Panda Import- Workflow für Kalk.-Tool",
  "status": "Funnel",
  "description": "Description\nAllgemeine Informationen zum Business Epic (BE)\nBusiness Epic Nutzenstatement\nFür  die Vertriebsmitarbeiter Large Enterprise (Fokus liegt auf den Rollen Pre-Sales, Fachvertriebe und Deal-Manager, Delivery/SBU tbc)\ndie heute zur Angebotserstellung für Mehrgewerke div. Tools bedienen müssen bzw. Zulieferungen zu diesen machen\nist eine stärkere Digitalisierung bei der Zusammenstellung der Angebotsinhalte erforderlich\nwodurch sich manuelle Aufwände reduzieren, \nso dass  Fehler im Angebotsprozess vermieden werden, Zeit für die Angebotserstellung reduziert wird, das Pricing  transparenter/vereinfacht wird, das Angebot digital in einen Vertrag übernommen werden kann und damit die Nutzerzufriedenheit mit dem Angebotsprozess steigt\nund nicht weiter manuelle Workarounds zur Angebotserstellung genutzt werden müssen.\nDas vorliegende Business Epic stellt den Workflow bereit, mit dem ein Dealteam zusammen an einem Angebot arbeitet und die Teilangebote verschiedener Gewerke zu einem Gesamtangebot integriert.\n  Bereits umgesetzt:\nÜbernahme von Vertragsdaten aus ZDF bzw. Magenta Force\nImport von Angeboten aus RPK und Übergabe von Angebotspreisen an RPK zur Nutzung im Orderprozess\nHinzufügen von in SAPCPQ konfigurierten Produkten\nAnlegen und Import von Angeboten aus SIMPLE, Erzeugung von PUG-Stufen (inkl. Import des Vorleisterangebots)\nUpload von International Underlays, Import von Kosten (inkl. vorgeschlagener Kosten aus der AI Costing Engine), Erzeugung von PUG-Stufen und Import im Warenkorb\nImport von Angeboten auf Basis Excel (Excel-Vorlage)\nBerechnung von Servicemanagement und Service Desk auf Grundlage des Gesamtwarenkorbs \nErstellung Vertriebsbericht, Leistungsübersicht, Gesamtangebot\n  Im Backlog derzeit:\nExploration D!VE für Solution Business (Q2) SDN-25161\nNotwendig:\nEnabler: Performance Improvement! (Q2?) SDN-21963\nverbesserte Preisdarstellung inkl. Summenziehen (Funnel) SDN-22875, SDN-20504\nAbbildung Solution Blueprints in Katalog und Befüllung Platzhalter-Struktur in Warenkorb (mit PANDA-Produkten und Import-Vorschlägen \"Stubbs\") aus diesen \nImport aus Budgetpreistool mit Befüllung einer Struktur, Mapping auf PANDA-Produkte bzw. Import-Vorschläge (analog zu ENS-Blueprint) mit Budgetpreis-Details und Kosten als Tooltipp \nNew Interface to ZDF/ Magenta Force für Dealteam Abbildung\nZDF stellt projektspezifischen Link zur Verfügung, über den Teil-Vorhaben in das PANDA-Angebot integriert werden können (Übergabe von PANDA an ZDF)\nIntegration Lotex via Excel-Import (inkl. Lösung für Vertragspreis-Rückgabe an Lotex), alternativ Ablösung von Lotex prüfen \nIntegration Integration D!VE für Solution Business (wird über das D!VE Projekt umgesetzt)\nOptimierung/Integration des Workflows zwischen verschiedenen Tools (Magenta Force, ZDF, PANDA, Budgetpreistool BEMABU-2337) Muss fachlich noch ausgearbeitet werden\nImport, Upload Funktion SeCe-IT inkl. Rückschnittstelle für Vertragspreise\nAnpassung Rollen und Rechte für Gesamteinblick für Zulieferer und Fortschrittsinfo an AcM\nStaging Funktion bei Importen bzw. Uploads seitens der Zulieferer, Akzeptieren des Imports durch AcM/ Inhaber des Angebots  \n  Unklar (SAP CPQ Ablösung, im Funnel):\nRevisionen von Angeboten, Klonen von Angeboten SDN-11704\nConcurrently started Configurators for the same product in Shopping Cart SDN-8723\n      Rahmenbedingungen\n\nStruktur dieses Business Epics: \nÜbernehmen der Struktur aus den Blueprints/Budgetangebote oder erstellen eigener Strukturen\nAnfrageworkflow für die Teilgewerke\nImportmöglichkeit für die Teilgewerke (inkl. Integration der Ergebnisse aus den externen Konfiguratoren gemäß Definition oben)\nFreigabe Workflow für die Teilgewerke (Freigabe/Staging Funktion - Übernahme Ja/Nein)\nRollenkonzept: Lesende Sicht auf das integrierte Angebot für die Zulieferer\nErstellen des Gesamtangebots aus den verschiedenen Teilgewerken (Funktion grundsätzlich vorhanden)\nRückschnittstelle bei Änderung von Preisen an die externen Konfiguratoren\nRPK bereits vorhanden\nSimple noch zu validieren\nSeCe-IT noch herzustellen\nLotex (oder Ablösung) noch herzustellen\nT-Sec/DT Sec noch zu validieren\n  <siehe Ausfüllhilfe https://wiki.telekom.de/x/UEVbfQ>\nOut of Scope\nKein Prima+ Projekt\n  <siehe Ausfüllhilfe https://wiki.telekom.de/x/UEVbfQ>\nAbhängigkeiten/Wechselbeziehungen - Eingangsvoraussetzungen\n<siehe Ausfüllhilfe https://wiki.telekom.de/x/UEVbfQ>\nCross Funktionale Zusammenarbeit\nBeteiligte IT-Applikationen /\nTechnik-Bereiche Beteiligte\nDomains (Tel-IT) Ansprechpartner Bemerkungen                                                                  \nPANDA DOM0204 Angelo Pietra \nPatricia Glöß \nHendrik Charchulla   \nZDF DOM0201 <verwende \"@Vorname Nachname\"> ICTO-1982\nMagentaForce DOM0201 <verwende \"@Vorname Nachname\"> ICTO-19890\nLotex DOM0201 Gansen, Thorsten  ICTO-1850\nSeCe-IT DOM0201   ICTO-1937\n  BEO und ggf. Vertreter <verwende \"@Nachname, Vorname\", um weitere Beteiligte einzufügen>\nSponsor/Fachseite Markus Helmhold, Thomas Claßen\nWeitere Stakeholder <weitere Bereiche, wie z. B. Service, Technik, Wholesale, etc.>\nWeitere AnsprP <z. B. Stage Gate Projektnummer/Ersteller der Vorlage>\nSonstiges \nHier ist bei Bedarf Platz für sonstige Information.",
  "business_value": {
    "business_impact": {
      "scale": 0,
      "revenue": "",
      "cost_saving": "manuelle Aufwände reduzieren",
      "risk_loss": "",
      "justification": "Fehler im Angebotsprozess vermieden werden, Zeit für die Angebotserstellung reduziert wird, das Pricing transparenter/vereinfacht wird, das Angebot digital in einen Vertrag übernommen werden kann und damit die Nutzerzufriedenheit mit dem Angebotsprozess steigt"
    },
    "strategic_enablement": {
      "scale": 0,
      "risk_minimization": "Risiko Minimierung",
      "strat_enablement": "Strat. Enablement",
      "justification": ""
    },
    "time_criticality": {
      "scale": 0,
      "time": "Time",
      "justification": ""
    }
  },
  "assignee": "Patricia Glöß",
  "priority": "",
  "target_start": "",
  "target_end": "",
  "fix_versions": [],
  "acceptance_criteria": [
    "Import von Kalkulations-Daten aus Kalkulatoren bzw. Excel-Preislisten (Aruba, FortiNet, etc.), Lotex, SeCe-IT, D!VE, RPK Neu, SIMPLE nach Panda ist möglich",
    "Erstellung einer Angebots-ID als Arbeitsbereich für die gemeinschaftliche Zusammenstellung einer Mehrgewerke-Lösung",
    "Katalog mit Bausteinen für ENS-Lösungen und Templates sind in Panda verfügbar zur Befüllung einer Warenkorb-Platzhalter-Struktur",
    "Bereitstellung von vorgefertigten Solution-Blueprints (Templates) und Platzhalter für Angebotsteile (leere Produkte) aus Katalog oder Budgetpreistool zur Befüllung einer Struktur des integrierten Warenkorbs",
    "Zentrale Deal-Team Abbildung über MagentaForce, ZDF und Panda (tbd: Wo wird von wem Deal Team definiert und erweitert?). Schreibender Zugriff für Angebots-Owner und Deal Manager. Lesender Zugriff für Zulieferer auf Gesamt-Warenkorb / Angebot.",
    "Ausgewählte Bausteine (Teilvorhaben) werden bei Gewerken/Zulieferern via ZDF angefordert (inkl. Panda-Import-Link)",
    "Upload-Funktion in Panda für die Bereitstellung der Angebots-Bausteine (Teil-Vorhaben) durch Gewerke/Zulieferer (in Staging-Area) und kann vom Owner in den Warenkorb hinzugefügt werden",
    "RPK Neu kann weiterhin über RPK-Nummer integriert werden",
    "Datenübertragung (Import) zwischen den Kalkulationstools ermöglichen, inkl. Rückkanal für angepasste Preise",
    "Einblick in den Fortschritt des Vorhabens für AcM ermöglichen"
  ],
  "components": [],
  "labels": [],
  "realized_by": [],
  "child_issues": [],
  "attachments": [
    {
      "filename": "image-2025-04-11-10-17-11-317.png",
      "url": "https://jira.telekom.de/secure/attachment/5602123/image-2025-04-11-10-17-11-317.png",
      "mime_type": "image/png",
      "size": "57 kB",
      "date": "2025-04-11T11:20:08.165+02:00"
    },
    {
      "filename": "image-2025-04-11-13-17-18-311.png",
      "url": "https://jira.telekom.de/secure/attachment/5602829/image-2025-04-11-13-17-18-311.png",
      "mime_type": "image/png",
      "size": "56 kB",
      "date": "2025-04-11T13:17:19.822+02:00"
    }
  ]
}