{
  "key": "BEMABU-1387",
  "issue_type": "Business Epic",
  "title": "KEK Historie GK",
  "status": "Funnel",
  "description": "Description\nBusiness Outcome:\nBei Beschwerdefällen muss der KEK Status, der zum besagten Zeitpunkt der Beschwerde gegolten hat, ermittelbar und auch über ein Vertragsende des Kunden hinaus kurzfristig und revisionssicher recherchierbar sein.\nHierfür soll innerhalb der SEP für bestimmte berechtigte Nutzer möglich sein, für alle GK-Kunden neben dem aktuellen KEK-Status auch die KEK-Historie recherchieren zu können ohne Absprung in ein anderes System.\n  Die komplette KEK-Historie muss chronologisch mit allen Timestamps und VP-VO-Nr. die diese gesetzt haben, einsehbar sein. -> siehe Dateianlage.\nAuch ohne Verträge/Accounts müssen KEK-Historie und \"Stammdaten\" erhalten bleiben damit bei Rechtstreitigkeiten diese zur Verfügung stehen. Der Vorhalte-Zeitraum soll 7 Jahre betragen.\nStammdaten sind Daten, mit denen ein Kunde eindeutig identifiziert werden kann: Name, Vorname, letzte Adresse, Geb. Datum, GP-Nr, (KDNR) und letzte Erreichbarkeiten.\n  Business Impact: Ein Verstoß gegen die DSGVO Art. kann ein Unternehmen bis zu ca. 20 Millionen Euro kosten.  Bisher sind diese Historiendaten nur in vielen verschiedenen Systemen zu finden (T-IVU, MagentaForce, Carmen, DMS Festnetz, DMS Mobilfunk) und müssen händisch recherchiert werden. Dies ist nicht nur zeitaufwändig (die BNetA lässt immer mehrere Hundert Kundenkontakte von PK & GK überprüfen), sondern auch fehleranfällig. Da die zu zahlende Summe bei Verstößen auf Grundlage der nicht nachweisbaren KEK's bestimmt wird, sollte jede Maßnahme ergriffen werden um möglichst viele durch Recherchefehler nicht auffindbare KEK's vermieden werden.",
  "business_value": {
    "business_impact": {
      "scale": 0,
      "revenue": "",
      "cost_saving": "",
      "risk_loss": "Ein Verstoß gegen die DSGVO Art. kann ein Unternehmen bis zu ca. 20 Millionen Euro kosten.",
      "justification": "Bisher sind diese Historiendaten nur in vielen verschiedenen Systemen zu finden (T-IVU, MagentaForce, Carmen, DMS Festnetz, DMS Mobilfunk) und müssen händisch recherchiert werden. Dies ist nicht nur zeitaufwändig (die BNetA lässt immer mehrere Hundert Kundenkontakte von PK & GK überprüfen), sondern auch fehleranfällig. Da die zu zahlende Summe bei Verstößen auf Grundlage der nicht nachweisbaren KEK's bestimmt wird, sollte jede Maßnahme ergriffen werden um möglichst viele durch Recherchefehler nicht auffindbare KEK's vermieden werden."
    },
    "strategic_enablement": {
      "scale": 0,
      "risk_minimization": "",
      "strat_enablement": "",
      "justification": ""
    },
    "time_criticality": {
      "scale": 0,
      "time": "",
      "justification": ""
    }
  },
  "assignee": "Albrecht, Gundula",
  "priority": "",
  "target_start": "",
  "target_end": "2024-12-31",
  "fix_versions": [],
  "acceptance_criteria": [],
  "components": [
    {
      "code": "DOM0201",
      "title": "DOM0201 B2B Standard - Mass Market"
    }
  ],
  "labels": [
    "Cross-vertical",
    "LaO_SEP"
  ],
  "realized_by": [
    {
      "key": "MAGBUS-24607",
      "title": "MAGBUS-24607",
      "summary": "Benutzeroberfläche KEK/Permission Service",
      "url": "https://jira.telekom.de/browse/MAGBUS-24607",
      "relation_type": "realized_by"
    }
  ],
  "child_issues": [],
  "attachments": [
    {
      "filename": "KEK-Historie.xlsx",
      "url": "https://jira.telekom.de/secure/attachment/3191380/KEK-Historie.xlsx",
      "mime_type": "application/vnd.openxmlformats-officedocument.spreadsheetml.sheet",
      "size": "12 kB",
      "date": "2023-07-26T13:13:40.352+02:00"
    }
  ]
}