{
  "key": "BEMABU-1303",
  "issue_type": "Business Epic",
  "title": "Datenmasterschaft der kundenseitigen Festnetz Ansprechpartner",
  "status": "Funnel",
  "description": "Description\n Problembeschreibung (ggf. Nutzungstatement)\nIm B2B Umfeld werden heute kundenseitige Ansprechpartner in vielen verschiedenen Systeme gepflegt. Ansprechpartner liegen oft redundant und in unterschiedlichen Qualitätsleveln in den verschiedenen Systemen vor. Eine konsolidierte Sicht auf den kundenseitigen Ansprechpartner ist nicht möglich. Vor diesem Hintergrund sind Ansprechpartnerdaten heute nicht E2E nutzbar.\nDurch die Etablierung eines Zentralen Ansprechpartnerdatenmanagement soll ein neuer Master für kundenseitige Ansprechpartner für alle Geschäftskunden (Mobilfunk, Festnetz, Massen- und Individualmarkt) geschaffen werden. Der neue Master solle die aktuellen kundenseitigen Ansprechpartner-Informationen systemübergreifend zu jeder Zeit zur Verfügung stellen.\nDas Zentrale Ansprechpartnerdatenmanagement fokussiert sich im wesentlichen auf folgende Kernpunkte:\nEtablierung einer einheitlichen Datenstruktur (ContactMedium)\nEtablierung eines zentralen Datenmaster (Sales Enablement Platform)\nSystemübergreifender Austausch der Consumer mit dem Master-System\nEtablierung eines Lifecycle-Management für kundenseitige Ansprechpartnerdaten\n  Durch die Umsetzung des Kernpunkt \"Etablierung eines zentralen Datenmaster\" stellen wir den Single Point of Truth für kundenseitige Ansprechpartnerdaten für alle Geschäftskunden bereit.\nHierfür ist es notwendig die kundenseitigen Ansprechpartnerdaten aus dem IT-System CRM-T /CDP für das Geschäftsfeld Festnetz in die Masterschaft der SEP zu nehmen\nHierdurch verbessern wir die Qualität der kundenseitigen Ansprechpartnerdaten und verringern Prozesslaufzeiten und Rückfragen bei der Bereitstellung von unseren Produkten.\n  Business Epic Outcome Hypothesis\n  Strategischer Beitrag & zeitliche Kritikalität\nAbsicherung OCC-Reitrement Stufe 2 bis 31.12.2024\nLeading Indicators\nDie Masterschaft der Daten liegt in der SEP\nCRM-T synchronisiert sich mit dem neuen Master-System\nIn Scope / Akzeptanzkriterien\nÜbernahme der Datenmasterschaft der kundenseitigen Ansprechpartner-Daten aus CRM-T im Geschäftsfeld Festnez\nCRM-T synchronisiert die kundenseitigen Ansprechpartner-Daten mit der SEP\nKonsolidierung der kundenseitgen Ansprechaprtner-Daten und Verbesserung der Qualität\nOut of scope\n  Abhängigkeiten (auch technisch)/Wechselbeziehungen\n  Voraussetzungen",
  "business_value": {
    "business_impact": {
      "scale": 0,
      "revenue": "",
      "cost_saving": "verringern Prozesslaufzeiten und Rückfragen bei der Bereitstellung von unseren Produkten",
      "risk_loss": "",
      "justification": "Hierdurch verbessern wir die Qualität der kundenseitigen Ansprechpartnerdaten und verringern Prozesslaufzeiten und Rückfragen bei der Bereitstellung von unseren Produkten."
    },
    "strategic_enablement": {
      "scale": 0,
      "risk_minimization": "Absicherung OCC-Reitrement Stufe 2 bis 31.12.2024",
      "strat_enablement": "Etablierung eines zentralen Datenmaster (Sales Enablement Platform)",
      "justification": "Durch die Etablierung eines Zentralen Ansprechpartnerdatenmanagement soll ein neuer Master für kundenseitige Ansprechpartner für alle Geschäftskunden geschaffen werden. Der neue Master solle die aktuellen kundenseitigen Ansprechpartner-Informationen systemübergreifend zu jeder Zeit zur Verfügung stellen."
    },
    "time_criticality": {
      "scale": 0,
      "time": "bis 31.12.2024",
      "justification": ""
    }
  },
  "assignee": "Unassigned",
  "priority": "",
  "target_start": "",
  "target_end": "2024-12-31",
  "fix_versions": [],
  "acceptance_criteria": [],
  "components": [
    {
      "code": "DOM0201",
      "title": "DOM0201 B2B Standard - Mass Market"
    },
    {
      "code": "SEP",
      "title": "SEP "
    }
  ],
  "labels": [
    "Cross-vertical",
    "LaO_SEP"
  ],
  "realized_by": [
    {
      "key": "MAGBUS-87554",
      "title": "MAGBUS-87554",
      "summary": "Exploration:Anbindung der SEP an den LOM/CRM-T",
      "url": "https://jira.telekom.de/browse/MAGBUS-87554",
      "relation_type": "realized_by"
    }
  ],
  "child_issues": [],
  "attachments": []
}