{
  "key": "BEMABU-2207",
  "issue_type": "Business Epic",
  "title": "LE - AI 4 RFP (Exploration)",
  "status": "Funnel",
  "description": "Description\nIn diesem ersten Schritt der Exploration geht es darum,  (a) die Wirksamkeit von AI bei den Aufgaben zu prüfen, (b) das datenschutzrechtlich und betriebsratskonforme Betriebsmodell zu entwickeln.\nZiel ist die Bereitstellung einer AI basierten Sales Unterstützung mit zwei Kernfähigkeiten:\n(1) Die automatisierte Analyse von eingehenden Angebotsanfragen und Ausschreibungen auf die Gewinnwahrscheinlichkeit.\n(2) Die automatisierte Suche von Antworten auf ähnliche Fragen der Ausschreibungen in von Telekom bereits erstellten Angeboten, Verträgen und Produktbeschreibungen.\nDerzeit evaluiert das Team die geeigneten Anbieter für den PoC aus (u.a. T-Systems, MMS, BCG,  responsive.io). Unabhängig von dem präferierten Anbieter wird die Begleitung der MMS für u.a. Datenschutzkonformität, PSA Verfahren, Integration, etc. benötigt  Abschätzungen über den Aufwand eines Proof of Concept mit der MMS gehen von gut 100 Personentagen aus. \n\nBusiness Scope:\nDer Vertriebserfolg in LE bei Angebotsanfragen (alle P&L Vertriebsbereiche, International) hängt von Fachexperten ab, die zwei kritische Aufgaben in kurzer Zeit erledigen müssen:\n(1) Schnell entscheiden, bei welchen Anfragen sich der Beantwortungsaufwand lohnt, um nicht Ressourcen zu verschwenden.\n(2) Die identifizierten lohnenswerten Anfragen schnell und überzeugend beantworten, um sich von der Konkurrenz abzuheben.\n\nEngpass bei beiden Aufgaben sind die Fachexperten: Statt ihre Zeit auf die Entwicklung innovativer Lösungen zu verwenden, brauchen sie diese für Sichten von Unterlagen, Suchen nach passenden Antworten, Finden von klaren Formulierungen, etc.\n\nIn der Folge schöpft Telekom bei weitem nicht die Umsatz- und Deckungsbeitragspotenziale aus, die ihr Sales Funnel bietet.\n\nAI Tools können den Fachexperten bei diesen Aufgaben assistieren und ihnen Zeitgewinne von 30% und mehr verschaffen: AI kann die Bewertung eingehender Ausschreibungen automatisieren, in Datenbanken nach passenden Antworten suchen, treffende Formulierungen finden, etc.\n\nAllein durch Fokussierung auf die passenden Angebote und deren schnellere und qualitativ bessere Beantwortung wird Telekom Umsatz und Deckungsbeitrag um 5 - 10% steigern. Ebenfalls steigt die Mitarbeitermotivation und -fähigkeit durch Konzentration auf die Entwicklung innovativer Lösungen statt Routine-Aufgaben.\n\nDie Konkurrenz der Telekom investiert derzeit massiv in AI basierte Sales Automatisierung. Ein schneller Einsatz hilft, die Nase vorn zu behalten, eine Verzögerung wird die Wettbewerbsfähigkeit schnell sinken lassen.",
  "business_value": {
    "business_impact": {
      "scale": 0,
      "revenue": "Umsatz und Deckungsbeitrag um 5 - 10% steigern",
      "cost_saving": "Zeitgewinne von 30% und mehr",
      "risk_loss": "Wettbewerbsfähigkeit sinkt bei Verzögerung",
      "justification": "Telekom schöpft bei weitem nicht die Umsatz- und Deckungsbeitragspotenziale aus, die ihr Sales Funnel bietet. AI Tools können den Fachexperten assistieren und Zeitgewinne verschaffen."
    },
    "strategic_enablement": {
      "scale": 0,
      "risk_minimization": "",
      "strat_enablement": "Konzentration auf die Entwicklung innovativer Lösungen statt Routine-Aufgaben",
      "justification": "Die Konkurrenz der Telekom investiert derzeit massiv in AI basierte Sales Automatisierung. Ein schneller Einsatz hilft, die Nase vorn zu behalten."
    },
    "time_criticality": {
      "scale": 0,
      "time": "",
      "justification": "Ein schneller Einsatz hilft, die Nase vorn zu behalten, eine Verzögerung wird die Wettbewerbsfähigkeit schnell sinken lassen."
    }
  },
  "assignee": "Axel Wegat",
  "priority": "",
  "target_start": "2025-07-01",
  "target_end": "2025-09-30",
  "fix_versions": [],
  "acceptance_criteria": [
    "Die Akzeptanzkriterien sind u.a.",
    "AI Nutzung zur Angebotsbewertung: (1) Wie gut kann die AI  die Kundenanfragen auf das Portfolio matchen? (2) Wie gut  die AI die Telekom-AGB mit den Bedingungen der Aussschreibung vergleichen?",
    "AI Nutzung zur Fragenbeantwortung: (1) Wie gut kann die AI Antworten auf häufig wiederkehrende Fragen finden? (2) Wie gut dann die AI Fragen und Antworten in verschiedene Sprachen übersetzen (3) Wie gut kann die AI die Lesbarkeit von Antworten verbessern."
  ],
  "components": [
    {
      "code": "DOM0201",
      "title": "DOM0201 B2B Standard - Mass Market"
    }
  ],
  "labels": [
    "Cross-vertical",
    "GK-LEET"
  ],
  "realized_by": [],
  "child_issues": [],
  "attachments": []
}