{
  "key": "BEMABU-2069",
  "issue_type": "Business Epic",
  "title": "Schnittstelle SeCe-IT - SCS (Nutzung SeCe-IT in PA)",
  "status": "In Progress",
  "description": "Description\nFür GK-Spezialisten in Partneragenturen\ndie in unserem Namen Verkäufe tätigen\nist es notwendig, das die Absätzen abgerechnet werden\nwodurch die Provisionszahlungen an die Betreiber der Partneragenturen korrekt abgerechnet werden können\nso dass für 2025 ein SeCeIT - AE in Höhe von 1,6 Mio erwirtschaftet werden kann\nund nicht entweder Privatkunden-Endgeräte vermarktet werden oder der Kunde IT-Hardware bei Wettbewerb kauft\nDas Vorhaben schafft Umsatz und trögt zur strategischen Weiterentwicklung der Partneragenturen im GK-Umfeld bei",
  "business_value": {
    "business_impact": {
      "scale": 13,
      "revenue": "1,6 m€",
      "cost_saving": "",
      "risk_loss": "",
      "justification": "Der Bezugszeitraum für den Wert 1,6 m € (AE Wert) liegt bei 12 Monaten nach Launch. Im Bezugszeitraum von 36 Monaten nach Launch erwarten wir einen AE in Höhe von 12,6 m€ Umsatzsteigerung (Up-& Cross-Selling) durch passendere und ganzheitlichere Bedienung der Kundenanliegen Umsatzgenerierung im wachsenden IT-Geschäft im KMU Segment durch Ermöglich relevanter Geschäftsprozesse (Buchung, Bonitätsprüfung, Provisionierung) Der Umsatz ist nicht in der iPF enthalten."
    },
    "strategic_enablement": {
      "scale": 13,
      "risk_minimization": "",
      "strat_enablement": "",
      "justification": "Erhöht die Kundenbindung über die Vermarktung von strategischen Produkten Der Nutzen bezieht sich auf die Vermarktung komplexer Festnetzanschlüsse und der dazugehörigen IT Hardware die zu großen Teilen nur in SeCe-IT, nicht aber z.B. in CRM-T bestellbar ist. Telekom Shop Partner Agenturen wachsen im KMU Segment überproportional im Festnetz und Mobilfunk. Kundenzufriedenheit ist ohne Einführung gefährdet weil der Kunde die Erwartungshaltung hat, dass er in einem TS PA Shop die gleichen Produkte bestellen kann, wie in einem TS OWN Shop. Leads über Tipfinder erreichen heute schon die TS PA Shops. Dort angegeben sind ebenfalls Kundenprodukt Wünsche für IT Hardware/Software die heute nicht bei TS PA vermarktet werden kann."
    },
    "time_criticality": {
      "scale": 8,
      "time": "Geplanter Umsetzungszeitraum Plan Start: 01.07.2025 Plan Ende/Launch: 30.09.2025",
      "justification": "Zur Erzielung der o.a. BusinessImpacts ist die Maßnahme umzusetzen"
    }
  },
  "assignee": "Nied, Patrick",
  "priority": "",
  "target_start": "2025-07-01",
  "target_end": "2025-09-30",
  "fix_versions": [],
  "acceptance_criteria": [
    "Mitarbeiter werden bzw. wurden geschult",
    "Kennung werden bzw. wurden an Mitarbeiter in dem benannten Bereich versandt",
    "Zugriff auf die Anwendung ist erfolgt",
    "Support-Weg beim Störungen ist aufgebaut (z.B. via NIMBUS)",
    "Weiterleitungen zwischen den (Segment-)Bereichen ist möglich (Weiterleitung als Lead)",
    "Rollen- und Berechtigungskonzept ist erstellt und ist aktiv",
    "Reporting ist sichergestellt --> tbd.",
    "Zusätzliche Kennung sind im Forecast berücksichtigt"
  ],
  "components": [
    {
      "code": "DOM0201",
      "title": "DOM0201 B2B Standard - Mass Market"
    },
    {
      "code": "DOM0202",
      "title": "DOM0202 Order2Cash"
    }
  ],
  "labels": [
    "Abt_TS-PA",
    "Anfo_Vertrieb",
    "Cross-vertical",
    "FN",
    "GK",
    "GK-KMC",
    "PA"
  ],
  "realized_by": [],
  "child_issues": [],
  "attachments": [
    {
      "filename": "IT Anforderung TS-PA.msg",
      "url": "https://jira.telekom.de/secure/attachment/3450305/IT%20Anforderung%20TS-PA.msg",
      "mime_type": "application/octet-stream",
      "size": "180 kB",
      "date": "2023-11-16T10:22:22.340+01:00"
    }
  ]
}