{
  "key": "BEMABU-1848",
  "issue_type": "Business Epic",
  "title": "Integrationssteigerung SeCe-IT in Flamingo Stufe 1",
  "status": "In Progress",
  "description": "Description\nSpezifikation findet im Rahmen des Solution Intent statt.\nZiel:\nSukzessive Integration des Produktportfolios (Hardware und Services) aus SeCe-IT, um eine konsistente One-Tool-Lösung im Look and Feel für die Nutzer zu schaffen.\nDaten-/Produktintegration:\nEs sollen benötigte Daten/Produkte so integriert werden, dass die Nutzenden innerhalb des Flamingos alle Informationen zur Angebots-/Auftragserstellung zur Verfügung haben. \nBenutzeroberfläche:\nDie Benutzeroberfläche der Applikation soll so gestaltet werden, dass sie ein einheitliches Look and Feel bietet, welches den Nutzenden eine intuitive und konsistente Erfahrung ermöglicht.\nSukzessive Umsetzung:\nDie Integration soll in Phasen erfolgen, beginnend mit den am häufigsten genutzten Produkten und Services, um schnelleren Nutzen zu erzielen und schrittweise weitere Produkte zu integrieren.\nSchulung und Support:\nEs ist sicherzustellen, dass Schulungsunterlagen und Support für die Nutzer bereitgestellt werden, um die Akzeptanz und den Umgang mit der neuen Lösung zu fördern.\nSolution Intent geplant:\n12.11.2024 --> Scoping\n29.11.2024 --> Draft Solution Design\n06.12.2024 --> Final Solution Design\nLink: folgt",
  "business_value": {
    "business_impact": {
      "scale": 3,
      "revenue": "",
      "cost_saving": "",
      "risk_loss": "",
      "justification": "Sukzessive Integration des Produktportfolios schafft eine konsistente One-Tool-Lösung, was die Effizienz steigert und die Nutzererfahrung verbessert."
    },
    "strategic_enablement": {
      "scale": 4,
      "risk_minimization": "Reduzierung von Inkonsistenzen durch einheitliches System",
      "strat_enablement": "Konsistente One-Tool-Lösung im Look and Feel für die Nutzer",
      "justification": "Die Integration ermöglicht eine einheitliche Benutzeroberfläche und stellt sicher, dass Nutzende alle Informationen zur Angebots-/Auftragserstellung in einem System zur Verfügung haben."
    },
    "time_criticality": {
      "scale": 3,
      "time": "Sukzessive Umsetzung mit ersten Ergebnissen bis 06.12.2024 (Final Solution Design)",
      "justification": "Die Integration soll in Phasen erfolgen, beginnend mit den am häufigsten genutzten Produkten und Services, um schnelleren Nutzen zu erzielen."
    },
    "footnotes": [
      "Bezugszeitraum ist 12 Monate nach Launch für neue/zusätzliche Umsatzerlöse",
      "Kosten für Risiken = Schadenshöhe x Eintrittswahrscheinlichkeit"
    ]
  },
  "assignee": "Keck, Simon",
  "priority": "",
  "target_start": "2025-01-09",
  "target_end": "2025-03-31",
  "fix_versions": [
    "Q1_25",
    "PrioQ1_25"
  ],
  "acceptance_criteria": [
    "Beseitigen Sie die Notwendigkeit für Benutzer, den richtigen Bereitstellungspfad auszuwählen, indem Sie alle Hardware- und Serviceoptionen in den Konfigurator für das Hauptprodukt integrieren.",
    "Implementieren Sie Logik im Konfigurator, um Abhängigkeiten zwischen Hardware und Services zu handhaben und sicherzustellen, dass die richtigen Konfigurationen erstellt werden.",
    "Automatisieren Sie die Auswahl des Bereitstellungspfads, wenn Sie das konfigurierte Produkt in den Einkaufswagen legen, sodass keine Benutzereingaben mehr erforderlich sind."
  ],
  "components": [
    {
      "code": "DOM0201",
      "title": "DOM0201 B2B Standard - Mass Market"
    }
  ],
  "labels": [
    "B2B_PRIO",
    "B2B_Target",
    "Cross-vertical"
  ],
  "realized_by": [
    {
      "key": "MAGBUS-99390",
      "title": "MAGBUS-99390",
      "summary": "Flamingo: Integrationssteigerung SeCe-IT in Flamingo Stufe 1 (tbd)",
      "url": "https://jira.telekom.de/browse/MAGBUS-99390",
      "relation_type": "child"
    },
    {
      "key": "MAGBUS-99391",
      "title": "MAGBUS-99391",
      "summary": "SeCe-IT: Integrationssteigerung SeCe-IT in Flamingo Stufe 1 (tbd)",
      "url": "https://jira.telekom.de/browse/MAGBUS-99391",
      "relation_type": "child"
    }
  ],
  "child_issues": [],
  "attachments": []
}