{
  "key": "BEMABU-1836",
  "issue_type": "Business Initiative",
  "title": "Q3/2025 - Optimierung AGB-Kette NPS",
  "status": "Funnel",
  "description": "Description\nFür die MitarbeiterInnen aus KMU Top + MidMarket + Large Enterprise + Public sowie SGrK,\ndie täglich mit den Applikationen der AGB-Kette (insbesondere MagentaForce, Flamingo, EOS) arbeiten,\nist es notwendig, dass diese AGB-Kette automatisiert und stabil funktioniert, ein UX-optimiertes und vollständiges Set an Funktionalitäten bietet und keine Lücken in Geschäftsfällen aufweist\nwodurch das Arbeiten am Kunden maximal automatisiert , insbesondere die Erstellung von Angeboten und Aufträgen einfacher, schneller und integrierter erfolgen kann. Damit wird sichergestellt, dass die vertriebsaktive Zeit, Serviceeffizienzen und die Automatisierung über die AGB-Kette hinweg maximiert und die Nutzerzufriedenheit signifikant gesteigert werden\nund nicht die User der AGB-Kette in Sales und Service durch erhöhten Prozessierungs-, Recherche- oder Pflegeaufwand in verschiedensten Systemen gebunden sind und die Nutzung der Tools extrem negativ bewertet.\nDas Vorhaben schafft durch die optimierte Arbeit mit den Applikationen der AGB-Kette einen schnelleren und auch besseren Vertriebs- und Serviceprozess, welcher in Ergebnis- und Umsatzzuwachs sowie  Aufwandsreduzierung resultiert. Die Nutzer arbeiten schneller und effizienter im System, können dadurch mehr Zeit auf umsatzrelevante Kunden-Interaktion aufwenden und werden die Zufriedenheit mit der Nutzung der Tools deutlich besser bewerten.\nDie Anforderung enthält verschiedene Einzelmaßnahmen zur gezielten Optimierung von Schlüsselfunktionalitäten sowie zur Umsetzung fehlender Geschäftsvorfälle und Erhöhung der End-to-End-Integration über die AGB-Kette. Die Einzahlmaßnahmen zahlen auf die Verbesserung des NPS und/oder der Load-Erhöhung ein. \nInhalt der Business Initiative wird im Verlauf von 2025 definiert und abgestimmt.\n\n**\nCRM (Magenta Force)\nExploration + Integration D!VE pt. 1\n...\nCPQ (Flamingo/SeCe-IT/TCMP)\nBestands- & Änderungsgeschäfts SeCe-IT\nSteigerung Produktionsreife bei Auftragsabgabe\nDokumentenhandling (DocID) + Digitale Signatur\nIntegrationssteigerung SeCe-IT in Flamingo Stufe 3\nExploration Decopling D!VE von Flamingo\nDecopling von Funktionen des Flamingos in Microservices Stufe 3\nOrdermanagement (o3 POM/EOS)\n/\n   \n\nBusiness Scope:\nE2E Optimierungen der AGB-Kette durch verschiedenste Maßnahmen.",
  "business_value": {},
  "assignee": "Herz, Alexander",
  "priority": "",
  "target_start": "2025-07-01",
  "target_end": "2025-09-30",
  "fix_versions": [
    "Q3_25"
  ],
  "acceptance_criteria": [],
  "components": [
    {
      "code": "DOM0201",
      "title": "DOM0201 B2B Standard - Mass Market"
    }
  ],
  "labels": [
    "Cross-vertical",
    "DO_Flamingo",
    "EOS",
    "MB_CPQ",
    "MagentaForce",
    "O3-POM"
  ],
  "realized_by": [
    {
      "key": "BEMABU-2288",
      "title": "BEMABU-2288",
      "summary": "Bestands- & Änderungsgeschäfts SeCe-IT",
      "url": "https://jira.telekom.de/browse/BEMABU-2288",
      "relation_type": "child"
    }
  ],
  "child_issues": [],
  "attachments": []
}