{
  "key": "BEMBN-115",
  "issue_type": "Business Epic",
  "title": "Product MIST WAN R1.0: Exploration Customer Portal target solution customer onboarding & secure form",
  "status": "Closed",
  "description": "Description\nCurrently, no integration with the SDX-Platform exists. The target process needs to reduce the manual efforts within MBN Portal, MyWorkplace & ICU as much as possible, when onboarding customers to the customer portal. Furthermore, solution options for sharing passwords between the customer and the SDX-Operations Team shall be explored. \n  Use-Case Manual Workaround Target Solution\n[UC1] Onboarding of customer company and admin-user on Customer Portal  Manual efforts in ICU & MyWorkplace Automate manual efforts\n[UC2]Access Portal via the Internet using login credentials and password. x (no customization) x \n Conduct User Mgmt for Customer Portal  Self service not possible, managed user mgt by CoC/Kundenbetreuer (tbd.) Management by End-user\n\nBusiness Scope:\nThe MIST WAN R. 1.0 shall be ready and live on the 30.06.2024. Scope of this Initiative is to explore the target solution for onboarding for MIST customers (UC1), as well explore a solution to share passwords with netcracker (UC8).\n\nThe customer onboarding based on the manual onboarding process vis-a-vis CSO is described in SDN-121. Condition from ICU to start with the interim solution for customer onboarding is that the target solution has been explored until 30.06.2024, as limitations exist to the # of customers that can be onboarded due to high manual efforts in customer portal and ICU.",
  "business_value": {
    "business_impact": {
      "scale": 0,
      "revenue": "",
      "cost_saving": "reduce the manual efforts within MBN Portal, MyWorkplace & ICU as much as possible",
      "risk_loss": "",
      "justification": "limitations exist to the # of customers that can be onboarded due to high manual efforts in customer portal and ICU"
    },
    "strategic_enablement": {
      "scale": 0,
      "risk_minimization": "",
      "strat_enablement": "Automate manual efforts",
      "justification": ""
    },
    "time_criticality": {
      "scale": 0,
      "time": "30.06.2024",
      "justification": ""
    }
  },
  "assignee": "stefan-jung@telekom.de",
  "priority": "",
  "target_start": "2024-01-01",
  "target_end": "2024-03-29",
  "fix_versions": [],
  "acceptance_criteria": [
    "Target process for onboarding company and admin-user onboarding is defined",
    "Handover of required information for each system defined",
    "Adjustments in each system to fulfill target process is explored and design is ready for implementation"
  ],
  "components": [
    {
      "code": "DOM0204",
      "title": "DOM0204 SD X"
    },
    {
      "code": "SDN",
      "title": "SDN Wenn SDX betroffen ist muss die Components SDN gesetzt werden"
    }
  ],
  "labels": [
    "B2B_Prio_2024",
    "DOM0204",
    "Portfolio",
    "SDN_Exploration"
  ],
  "realized_by": [
    {
      "key": "SDN-13142",
      "title": "SDN-13142",
      "summary": "Product MIST WAN R1.0: Exploration Customer Portal target solution customer onboarding & secure form",
      "url": "https://jira.telekom.de/browse/SDN-13142",
      "relation_type": "realized_by"
    }
  ],
  "child_issues": [],
  "attachments": []
}