{
  "key": "CANCAFLC-2705",
  "issue_type": "Portfolio Epic",
  "title": "FTTH@GK: Anpassung/Erweiterung für PreOrder@Cloud",
  "status": "In Progress",
  "description": "Description\nErgebnis der Vorbewertung:\nKurzbeschreibung der Anforderungen an die Domäne Copper OSS, Wholesale:\nDas FIB-Tool soll an TMF645 (ServiceQualification von Preorder@Cloud) angebunden werden. Um den Service nutzen zu können, benötigt das FIB-Tool zusätzliche optionale Attribute in der Response der ServiceQualification\nWeitere Domäne / Teams / Systeme in den Domäne Copper OSS, Wholesale betroffen: Nein \nObligatory: NEIN\nCoD nachvollziehbar?  JA\nInhaltliche Bewertung: Anforderung inhaltlich vollständig beschrieben. Da die zusätzlichen Felder optional sind, keine Auswirkungen auf die anderen Consumer (z.B. durch Erstellen einer eigenen Serviceversion oder Abwärtskompatibilität bez. XSD)\nAuswirkung auf andere Anforderungen in den Domäne Copper OSS / Wholesale :  NEIN\nEmpfehlung: Umsetzung empfohlen, Umsetzung frühestens in Q1/2025.\n\nBusiness Scope:\nDas FTTH-Geschäft gewinnt im Großkunden-Umfeld zusehends an Bedeutung. Um dieses Geschäft GK-fähig zu machen, wird das Fiber-Infrastruktur-Bauen-Tool (FIB-Tool) im Rahmen des Projektes \"FTTH Solution by Large Enterprise\" entwickelt. Mit diesem Tool wird der umfassende Blick auf die FTTH-Versorgungssituation an der Kundenlokation ermöglicht, auch um auf dieser Basis Angebote erstellen zu können. Die aktuell angebotenen PreOrder@Cloud Informationen (TMF-645) sind hierfür nicht ausreichend. Um die Anbindung einer weiteren Datenquelle aus Kosten- und Zeitgründen vermeiden zu können, bitte wir um eine Erweiterung des vorhanden Service. Die zusätzlichen Attribute werden laut der fachlichen Schnittstellenspezifikation \"FiberAvailabilityCheck Service\" auf der T-MAGIC-Seite angeboten.\n\nNachfolgend eine Auflistung dieser zusätzlich notwendigen Informationen (inkl. der Referenz auf das beigefügte Word-Dokument):\n\nListe der Attribute:\n\nAusbaustatus - in Preorder vorhanden\nNetz-Anbieter\naus unser Sicht in T-Magic enthalten unter 2.2.2.1.3.8 RelatedParty ( S. 26)\nid String Party ID\nname String Der Name von der Organisation\nrole String Party Rolle, im Fall von Wholebuy wird „NetCo\" geliefert.\nverfügbare Bandbreite - in Preorder vorhanden\nPlanungsdatum - in Preorder vorhanden\nBedarfspunkt (GF-AP)\nmehre Bedarfspunkte an einer KLS-ID => aus unser Sicht in T-Magic enthalten unter 2.2.2.1.3.5 Place (S. 21):\nDatenobjekt, das den geographischen Ort / die geographische Adresse beschreibt, der mit dem angefragten Service verknüpft ist. Im Kontext der Verfügbarkeitsabfrage enthält diese Objekt im Attribut „id\" die KLS ID des Request wenn ein Place vom Type „UrbanPropertyAddress\" geliefert wird. Im Fall das hier ein Place vom Type „BuildingSection\" übergeben wird, wird im Attribut „id\" die FibreOnLoacation.ID übergeben.\n\nParameter Datentyp/\nFormat Beschreibung\nid String KLS-ID der angefragten Adresse oder ID eines FibreOnLocation (FOL) an der Adresse, siehe Kap. 2.2.1\nObwohl Datentyp „String\" ist, wird ein numerischer Wert geliefert.\nhref String Wird nicht zurückgeliefert\nname String Name des Gebäudeteils (wird nur bei Gebäudeteilen geliefert)\nIst ein Pflichtfeld wenn die Adresse mehrere Gebäudeteile enthält.\n2.2.2.1.3.6 ServiceCharacteristic (S. 21)\nDatenobjekt, das die wesentlichen Informationen zur GF-Verfügbarkeit enthält. Die Informationen sind in name/value Paare strukturiert, d.h. jedes ServiceCharacteristic Datenobjekt enthält genau ein name/value Paar. Abhängig vom Verfügbarkeitsstatus (Ausbaustand Glasfaser) können ein oder drei ServiceCharacteristic Datenobjekte in der Service-Antwort enthalten sein.\n\nEigenschaft (name) Pflichtfeld* Wert (value) / Beschreibung\nAusbaustand Glasfaser Ja Status des GF-Ausbau am angefragten Kundenstandort (KLS-ID).\nMögliche Werte: notPlanned, areaPlanned, vvmOngoing, planned, homesPassed, homesPassedPlus, prepared, ready, connected\nFür die mehrere Bedarfspunkte mit unterschiedliche Status wird die konsolidierte Information berechnet. Siehe Kap. 2.2.2.1.5 Konsolidierte Verfügbarkeitsaussage Berechnung\nTechnologie Ja Die Werte \"FTTH\", \"FTTC\" und \"FTTB\" sind unterstützt.\nWichtig ist die Anzeige der Technologie ob FFTH oder FTTB\n\nGlasfaser ID (ursprünglicher Name „Home-ID\")\nHTN Status => - in T-Magic vorhanden\naus unser Sicht in T-Magic enthalten unter 2.2.2.1.3.6 (S.25)\nisClarifiedWithLandlord Nein Zeigt, ob die Installation mit Eigentümer abgestimmt ist. Mögliche Werte: „0\", „1\"\nKostenpflichtiger Hausanschluss\naus unser Sicht in T-Magic enthalten unter 2.2.2.1.3.6 (S. 25)\nGF AP Kostenpflichtig Nein Zeigt, ob GF AP Installation kostenpflichtig ist. Mögliche Werte: „0\", „1\"\nCPL-ID (Kupfer)\nan einer KLS-ID sollen alle verfügbaren CPL-ID's angezeigt werden\n \n\nNon functional requirements:\n\nfür den Wirkbetrieb wird mit täglich ca. 50T Adressanfragen gerechnet\ndie Beantwortung der Anfragen für den nächsten BusinessDay ist ausreichend, d.h. alle Anfragen können in der Nebenzeit entgegengenommen und beantwortet werden\ndes weiteren sollten die NFR der TMF-645 gelten\nTerminvorstellung:\nUmsetzung Q1/2025",
  "business_value": {},
  "assignee": "Paul, Doris",
  "priority": "",
  "target_start": "",
  "target_end": "2025-03-31",
  "fix_versions": [],
  "acceptance_criteria": [],
  "components": [
    {
      "code": "DOM0802",
      "title": "DOM0802 Copper OSS"
    },
    {
      "code": "PreOrder_Cloud",
      "title": "PreOrder_Cloud "
    }
  ],
  "labels": [
    "nPFM"
  ],
  "realized_by": [
    {
      "key": "DHPH-3638",
      "title": "DHPH-3638",
      "summary": "P@C SQ: Extension of P@C for GK",
      "url": "https://jira.telekom.de/browse/DHPH-3638",
      "relation_type": "realized_by"
    }
  ],
  "child_issues": [],
  "attachments": [
    {
      "filename": "AW_ BEMABU-1911 FTTH@GK_ Anpassung_Erweiterung für PreOrder@Cloud .msg",
      "url": "https://jira.telekom.de/secure/attachment/5133025/AW_%20BEMABU-1911%20FTTH%40GK_%20Anpassung_Erweiterung%20f%C3%BCr%20PreOrder%40Cloud%20.msg",
      "mime_type": "application/octet-stream",
      "size": "143 kB",
      "date": "2024-11-15T08:42:09.101+01:00"
    }
  ]
}