{
  "key": "DATAFAB-31950",
  "issue_type": "Epic",
  "title": "Creation of User Manual for M2M Self Service Portal",
  "status": "Closed",
  "description": "Description\n1. Epic Description\nEpic (Requirement and Scope) \nDevelop a comprehensive user manual for the M2M Self Service Portal to assist internal users from various departments, including sales, finance, marketing, and management, in navigating and utilizing the portal effectively.\nThe objective of this epic is to create a detailed user manual for the M2M Self Service Portal. This manual will serve as a guide for internal users from different departments (sales, finance, marketing, and management) . The manual will include step-by-step instructions, screenshots, FAQs, and troubleshooting tips to ensure users can efficiently use the portal for their respective needs.\nTo Do:\n1. Planning:\n•    Identify and gather all necessary information and resources.\n•    Determine the structure and layout of the manual.\n•    Assign team members to specific sections of the manual.\n2. Content Creation:\n•    Write detailed instructions and descriptions for each feature of the Self Service Portal.\n•    Capture and include relevant screenshots and visuals.\n•    Develop FAQs and troubleshooting guides.\n3. Review and Revision:\n•    Conduct a review cycle with representatives from sales, finance, marketing, and management.\n•    Make necessary revisions based on feedback.\n4. Finalization:\n•    Format and proofread the manual.\n•    Prepare digital PDF version.\n5. Distribution:\n•    Upload the digital manual to the SharePoint.\n•    Distribute copies to each department.\nBenefits:\nCreating a user manual will improve efficiency and consistency by providing clear instructions and troubleshooting tips, reducing the time spent on support queries. It will enhance user satisfaction and autonomy, leading to increased productivity and fewer support requests.\n  Specific Deliverables  \nFirst version of User Manual for M2M Self Service Portal for internal users.\n  Acceptance Criteria (conditions which must be satisfied for the Epic to be accepted)\nAll key functionalities of the Self Service Portal are covered in the User Manual.\nClear, concise language is used, and screenshots and visual aids are incorporated to enhance understanding, with a table of contents and an index included for easy navigation.\nThe manual is made available in digital (PDF) format, and it is accessible for users\nThe manual is reviewed for accuracy, and final approval is obtained from Product Owner and Product manager before distribution.\nOut of Scope\nDescription of each possible reports in M2M Self Service Portal.. User Manual will introduce only basic information for existing attributes.\nNo changes in M2M Self Service Portal is required. \nChanges from current Q4 can't be included in first version of the User Manual.\nDependencies \nReviewers availability for the feedback collection is required.\n2. Technical / Solution Design / Compliance\nTechnical & Solution Design  \nNo changes is required.\nCompliance evaluation\nDone.\n  3. NFR (if any)\nNon functional requirements\nN/A\n  4. SLA(if any)\nService Level Agreements\nN/A",
  "business_value": {},
  "assignee": "Katalin Zsanett Sipos",
  "priority": "",
  "target_start": "2024-12-16",
  "target_end": "2025-03-31",
  "fix_versions": [
    "2025_Q1"
  ],
  "acceptance_criteria": [
    "First version of User Manual for M2M Self Service Portal for internal users is created."
  ],
  "components": [
    {
      "code": "BI4BS_BO",
      "title": "BI4BS_BO "
    },
    {
      "code": "DVS_B2BA",
      "title": "DVS_B2BA "
    }
  ],
  "labels": [
    "M2M_Rep",
    "SelfServicePortal"
  ],
  "realized_by": [],
  "child_issues": [],
  "attachments": []
}