{
  "key": "DATASAT-25870",
  "issue_type": "Portfolio Epic",
  "title": "DATA- EOS 2.0 Case-Management Reporting [Anteil 2025]",
  "status": "Closed",
  "description": "Description\nBegründung CoD Werte in Klärung mit PFM Serivce!!!\n1. Business Epic\nBusiness Epic/ Requirement and Scope \nAnforderung:\nIch als Reporter Business Support GK benötige die angeforderten Reportingdaten idealerweise integriert in das Tabulare Modell EWS, um die Daten optimal mittels PowerBI visualisieren zu können.\nBeschreibung:\nDie angeforderten Mengen und Zeiten in Kundensicht und Teamsicht aus MagentaForce sollen nicht in einem eigenen Datenmodell (Business Layer) bereitgestellt werden, sondern sollen abgebildet werden auf die bereits existierenden Kennzahlen und Dimensionen aus dem EWS Datenmodell, soweit möglich.\nEs soll über die Dimension System erkennbar sein, aus welcher Quelle die Daten stammen (heute IRRP und IN, zukünftig MagentaForce, Sprinklr, ..).\n  Begründung:\ndie Daten gehören fachlogisch zusammen. Egal aus welchem Routingsystem sie stammen und wie sie dort heißen (z.B. Workitem, Interaction, Case, ...), handelt es sich um vergleichbare Vorgänge.\nNur bei einer gemeinsamen Datenquelle (hier: EWS) lässt sich in PowerBI eine Live-Verbindung erstellen. Bei Nichtumsetzung müssten die Daten aus verschiedenen Quellen importiert werden und in dem jeweiligen Bericht zusammengeführt werden.\nWichtig auch für das Mengen(reduktions-)programm, Forecasting, Workload/-force-Planung, dass die Daten aus den verschiedenen Routingsystemen, die im Service genutzt werden, an einer Stelle zusammengeführt werden.\n  Business Value\nOneForce Casemanagement hat die zMali-ID: GrK – 3097 d à 1,22 Mio. PAM mit u.a. Streams in JIRA:\nBasisaufwand im Bestand: (360 Grad Sicht im BC Case Management) 2 Min à 1,595 Mio. PAM\nKontaktmengen (Fullyear): (IRRP Menge KB, CRM-T Aktivität alle) à 0,334 Mio. PAM\nEinfache GF: (Chat Collobration und E-Mail to Case im BC Case Mnagagement) 3,7 Min à 2,951 Mio. PAM\n--> For details pls. see calculation attached on linked BE (Steckbrief page 2)\nStrategic Contribution (RROE)/ Time Criticality  (CoD)\nStrateg. Contribution: EOS 2.0 als integrierte Systemlösung is part of Big5+2 --> see RM24\nTime criticality: BE is seen in context retire IRRP and integration Sprinklr\n  2.  Portfolio Epic Description\nPortfolio Epic (Requirement and Scope) \nEOS 2.0 - MagentaForce Casemanagement (EOS = \"Eine Oberfläche Service\" -> was always a initiative to reach that goal and now was choosen as a name with regards to 2.0 as the second try) \nReason for that requirement is the planned switch from the current workflow management in IRRP (integrated routing platform) to MagentaForce (Salesforce of Deutsche Telekom) which will happen on the 01.11.2024. That has two reasons:\nIRRP will retire latest end of 2025/mid of 2026 because of expiry of support through genesis. New workflow management tool is needed\nCurrenlty the service organisation is managing work items related to customer contacts through IRRP. The sales organisation is organized in mangenta force. As magenta force also offers a workflow management, the plan is to close this tooling gap between service & sales. That would help, because currently sales colleagues always have to ask service colleagues about the status of work items and vice versa. \nFor the 01.11.2024 the scope is to, in a first step, migrate all work items related to \"festnetz\" & \"enterprise networks\" and NOT to migrate \"mobile\" related work items. The two steps are needed because service wants to wait for the final solution of the new CTI solution (Sprinklr?), before focusing on the work items related to mobile/calls.\nIn Scope 2024_Q3:\nFor this first step on the 01.11.2024 the service business area requests SAT to provide the same reporting about work items which is currently provided out of IRRP. Reports answer questions about for example: How many cases came in yesterday? How manay cases have not yet been processed? How many cases were processed yesterday? etc. The minimal number of needed reports is specified in https://jira.telekom.de/browse/DATASAT-22163\n  Business Outcome (quantitative)\nIncreasing competence\nResponse time and “zero forwarding”\nEnabling omnichannel and increasing E2E transparency\nEnsuring consistent customer contact documentation.\nOne system for all customer concerns at every customer touchpoint.\nConsistent and media-free interaction between sales and service, consistent contact documentation and E2E transparency, customers do not have to repeat concerns several times\nAcceptance Criteria (conditions which must be satisfied for the PE to be accepted)\n- to be created together with the BEO /VSL or PE Owner; helps to avoid scope change once implementation has begun. \n  Out of Scope\nFor Q3/2024:\nNot all reports that are currenlty provided through reporting based on IRRP are already required for the 01.11.2024. Just the reports that are defined in https://jira.telekom.de/browse/DATASAT-22163\nFor 2025: __ \nCurrently not defined but with full migration of IRRP workflow management to magentaforce there will be reporting needed\nDependencies \nThere is already Data loaded to the ODL from magentafroce through teams in the Data Domain Finance & B2B that could be used. Views still have to be build to provide suitable data for reports\n  3. NFR (if any)\nNon functional requirements\n- are there any NFRs to be evaluated? if yes, pls provide the detailed information here.\n  4. SLA(if any)\nService Level Agreements\n- are there any SLAs to be evaluated? if yes, pls provide the detailed information here.\n  5. Solution Design \nArchitecture and Solution Design  \n- pls provide details to the Solution/ Technical design ; does the solution align with the architectural roadmap, pls elaborate. \n  Compliance evaluation\n- Has this PE been evaluated for Compliance requirements? Pls provide details here-\n       ",
  "business_value": {},
  "assignee": "Timm Ahrendt",
  "priority": "",
  "target_start": "",
  "target_end": "",
  "fix_versions": [],
  "acceptance_criteria": [
    "Not all reports that are currenlty provided through reporting based on IRRP are already required for the 01.11.2024. Just the reports that are defined in https://jira.telekom.de/browse/DATASAT-22163",
    "There is already Data loaded to the ODL from magentafroce through teams in the Data Domain Finance & B2B that could be used. Views still have to be build to provide suitable data for reports",
    "Options",
    "CLOSED",
    "Add Link",
    "All",
    "Comments",
    "History",
    "Activity",
    "Emails",
    "Transitions",
    "Smart Checklist History",
    "Estimate (async mode)",
    "Add a comment...\nPro tip: press m to comment"
  ],
  "components": [
    {
      "code": "DVS_DFS",
      "title": "DVS_DFS "
    }
  ],
  "labels": [
    "IM&C",
    "RM2025",
    "RM25_01"
  ],
  "realized_by": [],
  "child_issues": [],
  "attachments": []
}