{
  "key": "DATAFAB-34887",
  "issue_type": "Epic",
  "title": "New Customer-specific Pooling Aggregation Report",
  "status": "Funnel",
  "description": "Description\n1. Epic Description\nEpic (Requirement and Scope) \nTo win the deal with a new customer, we need to support IoT business by delivering a customer-specific Pooling Aggregation report. This report will be built based on a custom logic required by the client: using CUSTOM field of the SIM Cards, they should be aggregated in the specific logic.\nThe report will aggregate values based on a specific field to enable customer-specific analysis. It will help the client make data-driven decisions by consolidating and structuring key metrics according to their requirements.\nNew Feature:\nCustomer-specific report for Bosch: POOLING_AGGREGATION_REPORT\nWEB-interface only\nLogic with grouping based on CUSTOM field of the SIM card.\nDynamic Pooling only.\n  Benefits:\nIncreases the chances of securing the customer deal.\nProvides tailored insights, improving customer decision-making.\nEnhances our reporting capabilities with customer-specific customization.\nSpecific Deliverables  \nNew Report Summary is created\nDocumentation describing the changes in report logic and their impact on business processes, SSV updates.\nAcceptance Criteria (conditions which must be satisfied for the Epic to be accepted)\nNew POOLING_AGGREGATION_REPORT is created in Bosch folder in WEBi interface\nIt should be possible to download in in CSV format from WEBi.\nOut of Scope\nARV export is not required.\nDependencies \n The mapping in the source system is clear and accessible, and the changes have been approved by a business side.\n2. Technical / Solution Design / Compliance\nTechnical & Solution Design  \nThe report will get data from TMSP Source system.\nData transformation and aggregation will follow the customer-specific logic, applying business rules as defined in the requirement.\nAny necessary ETL (Extract, Transform, Load) pipelines will be developed to preprocess and structure the data.\nData will be aggregated based on the specified field for targeted customer analysis.\nThe report will be generated in BI Dashboard with possibility of CSV downloading.\nAccess to the report should be only for selected Customer(s) in accordance with the security concept.\nCompliance evaluation\nTBD\n3. NFR (if any)\nNon functional requirements\nNone.\n  4. SLA(if any)\nService Level Agreements\nEnsuring that report data is delivered within the agreed timeframe.\n ",
  "business_value": {},
  "assignee": "Unassigned",
  "priority": "",
  "target_start": "",
  "target_end": "",
  "fix_versions": [],
  "acceptance_criteria": [
    "New POOLING_AGGREGATION_REPORT is created in Bosch folder in WEBi interface",
    "It should be possible to download in in CSV format from WEBi.",
    "FUNNEL",
    "Add a comment...\nPro tip: press m to comment"
  ],
  "components": [
    {
      "code": "BI4BS_BO",
      "title": "BI4BS_BO "
    },
    {
      "code": "DVS_B2BA",
      "title": "DVS_B2BA "
    }
  ],
  "labels": [
    "DEV",
    "M2M_Rep",
    "StandardReports"
  ],
  "realized_by": [],
  "child_issues": [],
  "attachments": []
}