{
  "key": "DATAFAB-28651",
  "issue_type": "Epic",
  "title": "Enhance INVOICE folder with Data Best model logic in M2M Self Service Portal",
  "status": "Analysis",
  "description": "Description\n1. Epic Description\nEpic (Requirement and Scope) \nCurrently in the TMSP we have the dynamic pooling model, that presents the sum of all per SIM inclusive volume of the SIMs per month in the pooling tariff. Each SIM contributes a certain predefined volume to the corresponding pool when activated and the pool size grows depending on the number of the active SIMs in this pool tariff automatically. The customer must know which use cases are affected and must calculate the needed volume exactly depending on the number of his active SIMs to implement his business before signing the contract with the corresponding sales MNO (TDG, TMA, ...).\nThe epic aims to improve the functionality of data for the Data Best Pool Model within the Self Service Portal. Currently, the Data Best folder has not enough attributes in Self Service Portal lacks the capability for creating more comprehensive reports.\nAs part of our continuous improvement of the M2M Self Service Portal, we need to integrate the DATA_BEST model logic into the SIM_PROFILE  folder. This integration will enhance the portal's capabilities and provide users with more robust data management and analytical tools.\nTarget Requirements/ User Stories:\nAdjust PARTNER_LEVEL_SERVICE folder with Data Best model\nEnhance STANDARD_OFFERING with Data Best Pool Model\nEnhance CUSTOMER_OFFERING with Data Best Pool Model\nAdjust INVOICE folder with Data Best model\nAdd new folder for Static Pooling model in INVOICE folder\n  MVP\nImprove the functionality of the M2M Self Service Portal, enabling users to effortlessly generate detailed reports tailored to their specific requirements.\nStreamline the user interface of the portal to enhance usability and facilitate intuitive navigation for all users.\nImplement optimizations to ensure the portal operates efficiently, providing quick response times even when handling complex queries and large datasets.\nBenefits\n Power users in departments can leverage the portal to access relevant data directly, promoting transparency and enabling them to address queries independently.\n By providing users with the tools to generate their own reports, the need for manual service requests diminishes, freeing up resources and reducing the workload on support teams. This leads to greater efficiency and cost savings for the organization.\nWith enhanced report generation capabilities, users gain greater control over accessing and analyzing data, empowering them to make informed decisions.\n By enabling users to generate sophisticated reports based on their unique needs, the portal facilitates deeper insights into data, driving better-informed decision-making processes\nBy integrating the DATA_BEST model logic, users will have access to more accurate and comprehensive data analysis tools, leading to better-informed business decisions.\nMore than 150 for TDG customers will benefit from the demand\nMore than 1000 customers expected by marketing of the data best pooling model products\nMore than 10 Mio SIM Cards will be impacted by the demand\n \nAdditional revenue\nRevenue in Cent /SIM /Month 50 ct / SIM / Month\nRevenue over 5 Years 25 Mio € \nSpecific Deliverables  \nNone\n  Acceptance Criteria (conditions which must be satisfied for the Epic to be accepted)\nThe DATA_BEST model logic is successfully integrated into the INVOICE folder.\nAll existing functionalities of the M2M Self Service Portal remain unaffected by the integration.\nUsers can access and utilize the Data Best model logic without issues.\nOut of Scope\nCreation of new reports, system architecture changes. BI Launchpad reports are not affected.\nDependencies \nThe mapping in the source system is clear and accessible, and the changes have been approved by a business side.\n2. Technical / Solution Design / Compliance\nTechnical & Solution Design  \nThe proposed solution involves modifying existing folders to incorporate additional attributes and relationships, as well as updating the logic within the M2M Self Service Portal for creating necessary internal reports. This aligns with the architectural roadmap by ensuring compatibility with current systems and minimizing disruption. The implementation will utilize existing technologies and frameworks, focusing on improving performance while maintaining data integrity. The mapping in the source system is clear and accessible, ensuring a smooth integration process.\nCompliance evaluation\nDone.\n  3. NFR (if any)\nNon functional requirements\nNo.\n  4. SLA(if any)\nService Level Agreements\nN/A",
  "business_value": {},
  "assignee": "Katerina Soldatova",
  "priority": "",
  "target_start": "",
  "target_end": "",
  "fix_versions": [],
  "acceptance_criteria": [
    "Data Best Pool model works in INVOICE folder of M2M Self Service Portal with new and old attributes."
  ],
  "components": [
    {
      "code": "BI4BS_BO",
      "title": "BI4BS_BO "
    },
    {
      "code": "DVS_B2BA",
      "title": "DVS_B2BA "
    }
  ],
  "labels": [
    "DEV",
    "M2M_Rep",
    "SelfServicePortal"
  ],
  "realized_by": [],
  "child_issues": [],
  "attachments": []
}