{
  "key": "DATAFAB-34083",
  "issue_type": "Epic",
  "title": "AES export filenames change (Full Delivery)",
  "status": "Backlog",
  "description": "Description\n1. Epic Description\nEpic (Requirement and Scope) \nEvery month there is a monthly TMSP full stock delivery to AES interface, which comes with the file exports with the same name as the daily files. This causes massively overloads to AES loading system.\nManually processing not delivered files can take days where other files are not loaded.\nTo optimize this procedure and make sure all files are delivered correctly, the change of the FULL Delivery mode is required.\nFilename change for our full delivery to the following: \n•    TMSP_AES_RUFNUMMERN_Voll-Bestand_yyyymmtthhmmss.csv\n•    TMSP_AES_KUNDEN_Voll-Bestand_ yyyymmtthhmmss.csv\n  At the moment, our job doesn't support generating files with varying filenames, as there hasn't been a previous request for this functionality.\nBenefits:\n1. Improved data synchronization between TMSP and the AES interface\n2. No data loss during processing of monthly exports.\nSpecific Deliverables  \nTBD\nAcceptance Criteria (conditions which must be satisfied for the Epic to be accepted)\nTBD\nOut of Scope\nCreation of new reports, system architecture changes. BI Launchpad reports are not affected.\nDependencies \nThe mapping in the source system is clear and accessible, and the changes have been approved by a business side.\n2. Technical / Solution Design / Compliance\nTechnical & Solution Design  \nThe proposed solution involves modifying existing folders to incorporate additional attributes and relationships, as well as updating the logic within the M2M Self Service Portal for creating necessary internal reports. This aligns with the architectural roadmap by ensuring compatibility with current systems and minimizing disruption. The implementation will utilize existing technologies and frameworks, focusing on improving performance while maintaining data integrity. The mapping in the source system is clear and accessible, ensuring a smooth integration process.\nCompliance evaluation\nDone.\n  3. NFR (if any)\nNon functional requirements\nNo.\n  4. SLA(if any)\nService Level Agreements\nN/A",
  "business_value": {},
  "assignee": "Patrick Glaser",
  "priority": "",
  "target_start": "",
  "target_end": "",
  "fix_versions": [
    "2025_Q2"
  ],
  "acceptance_criteria": [
    "Change export filenames for AES interface."
  ],
  "components": [
    {
      "code": "BI4BS_BO",
      "title": "BI4BS_BO "
    },
    {
      "code": "DVS_B2BA",
      "title": "DVS_B2BA "
    }
  ],
  "labels": [
    "AM",
    "DEV",
    "M2M_Rep"
  ],
  "realized_by": [],
  "child_issues": [],
  "attachments": []
}