{
  "key": "DATAFAB-31768",
  "issue_type": "Epic",
  "title": "M2M Reports Optimization & Enhancement",
  "status": "Closed",
  "description": "Description\n1. Epic Description\nEpic (Requirement and Scope) \nAn optimization or additional development for existing reports is currently delivered by the BI4BS team based on a new story in JIRA. \nBased on business needs it is required to change the logic in existing reports, add some new fields or adapt the existing ones. Changes are required to fix known issues, performance problems and improve usability.\nCurrently there is a new requirement for Standard reporting: Customers want to know about remaining suspension days of their SIM cards.\nBenefits:\nStable environment\nCustomer satisfaction.\nSpecific Deliverables  \nAdapted reports with updated logic and new fields to display REMAINING_SUSPENSION_DAYS  information:\nWEBi, ARV: 018_STD_SIM_BASICDATA report.\nUpdate of the Reporting user manual to reflect the changes in the reports and how to use the REMAINING_SUSPENSION_DAYS field.\nDocumentation describing the changes in report logic and their impact on business processes, SSV updates.\nAcceptance Criteria (conditions which must be satisfied for the Epic to be accepted)\nNew REMAINING_SUSPENSION_DAYS is added after the existing attribute LAST_STATUS_CHANGE_TIMESTAMP in 018_STD_SIM_BASICDATA report.\nOnly DAILY and MONHTLY WEB and ARV reports are affected.\nOut of Scope\nCreation of new reports, system architecture changes, or integration with new data sources. The focus is solely on updating existing columns with additional options.\nDependencies \n The mapping in the source system is clear and accessible, and the changes have been approved by a business side.\n  2. Technical / Solution Design / Compliance\nTechnical & Solution Design  \nThe proposed solution involves modifying existing reports to incorporate additional values for REMAINING_SUSPENSION_DAYS information and update the logic accordingly. This aligns with the architectural roadmap by ensuring compatibility with current systems and minimizing disruption. The implementation will utilize existing technologies and frameworks, with a focus on improving report performance while maintaining data integrity. The mapping in the source system is clear and accessible, ensuring a smooth integration process.\nCompliance evaluation\nTBD\n3. NFR (if any)\nNon functional requirements\nNone.\n  4. SLA(if any)\nService Level Agreements\nEnsuring that modified reports are delivered within the agreed timeframe.\n   ",
  "business_value": {},
  "assignee": "Tomas Pristic",
  "priority": "",
  "target_start": "2025-01-06",
  "target_end": "2025-01-31",
  "fix_versions": [
    "2025_Q1"
  ],
  "acceptance_criteria": [],
  "components": [
    {
      "code": "BI4BS_BO",
      "title": "BI4BS_BO "
    },
    {
      "code": "DVS_B2BA",
      "title": "DVS_B2BA "
    }
  ],
  "labels": [
    "DEV",
    "M2M_Rep",
    "StandardReports"
  ],
  "realized_by": [],
  "child_issues": [],
  "attachments": []
}