{
  "key": "DATAFAB-31891",
  "issue_type": "Epic",
  "title": "Support for M2M Self Service Portal requests",
  "status": "Closed",
  "description": "Description\n1. Epic Description\nEpic (Requirement and Scope) \nThis epic aims to streamline support for existing client requests concerning minor issues on the production system, particularly those related to the M2M Self Service Portal. The focus is on addressing common concerns reported by the business side, including issues with reports not running and inquiries on procedural matters.\nContinuous monitoring of client feedback and support ticket trends is essential for identifying emerging issues and improving support processes further. Regular updates to documentation and support materials may be required to ensure clarity and effectiveness in addressing client queries and issues related to the M2M Self Service Portal.\n  Objective:\nThe primary objective is to efficiently handle client requests related to the M2M Self Service Portal, specifically focusing on resolving issues such as reports failing to execute and providing guidance on procedural queries.\nBenefits:\nPrompt resolution of reported issues and provision of procedural guidance enhance overall customer satisfaction and confidence in our support capabilities.\nSpecific Deliverables  \nNone\n  Acceptance Criteria (conditions which must be satisfied for the Epic to be accepted)\nReported issues related to the M2M Self Service Portal, such as reports not running, are effectively resolved within agreed-upon timeframes.\nProcedural queries regarding M2M Self Service Portal tasks are addressed promptly and comprehensively through appropriate support channels.\nOut of Scope\nCreation of new reports, system architecture changes. BI Launchpad reports are not affected.\nDependencies \nIn case of issue on a source side, TMSP support team should resolve that.\n2. Technical / Solution Design / Compliance\nTechnical & Solution Design  \nN/A\nCompliance evaluation\nDone.\n3. NFR (if any)\nNon functional requirements\nNo.\n  4. SLA(if any)\nService Level Agreements\nN/A",
  "business_value": {},
  "assignee": "Katerina Soldatova",
  "priority": "",
  "target_start": "2024-12-19",
  "target_end": "2025-04-03",
  "fix_versions": [
    "2025_Q1"
  ],
  "acceptance_criteria": [
    "All Service Requests for M2M Self Service Portal are completed"
  ],
  "components": [
    {
      "code": "BI4BS_BO",
      "title": "BI4BS_BO "
    },
    {
      "code": "DVS_B2BA",
      "title": "DVS_B2BA "
    }
  ],
  "labels": [
    "AM",
    "M2M_Rep",
    "Service_Request"
  ],
  "realized_by": [],
  "child_issues": [],
  "attachments": []
}