{
  "key": "DUD-6409",
  "issue_type": "Epic",
  "title": "neue Anforderungen der ICANN an Registrare - Umsetzung Stufe 1",
  "status": "Closed",
  "description": "Description\nInhaber-Verifizierung\nKontaktdaten-Validierung nach bestimmten Richtlinien\nDNSSec\nwhois für alle gTLDs (über Web-UI)\nanderes whois-Format\nVon: Bartels, Andreas\nGesendet: Dienstag, 18. Februar 2014 10:54\nAn: Buß, Rüdiger; Tepe, Holger; Fischer, Frank; Schlief, Heike\nCc: Harms, Bodo; Leidecker, Jochen\nBetreff: ICANN-Anforderung; Verifizierung\nLK,\nspätestens Ende Januar 2015 müssen wir den neuen ICANN-Vertrag unterschrieben haben. Neben der Einführung von DNSSEC und einem neuen Whois-Format ist das Thema Inhaber-Verifizierung die größte Baustelle. Diese betrifft alle gTLDs, für die wir Registrar sind – oder für die wir diese Aufgabe entsprechend vom Registrar übernehmen. Mit Unterschrift müssen die Anforderungen entsprechend umgesetzt sein.\nEPAG hat ihre Umsetzung jetzt auf Deutsch gut beschrieben. EPAG hat das E-Mail-Verfahren gewählt. Theoretisch wäre die Verifizierung auch per SMS oder per Anruf durch einen unserer Mitarbeiter möglich. E-Mail sollte aber wohl das kostengünstigste Verfahren sein.\nDie Info unten ist nur als Vorgeschmack zu sehen, was uns erwartet. Die o.a. Maßnahmen selbst hab ich schon an Frank gemeldet und er hat sie auch schon weitergeleitet, damit entsprechend Budget dafür eingeplant wird.\nDie Anforderungen der ICANN zum Thema Validierung/ Verifizierung können hier eingesehen werden:\nhttp://www.icann.org/en/resources/registrars/raa/approved-with-specs-27jun13-en.htm#whois-accuracy\nIm Zuge des Programms zur Einführung neuer gTLDs hat ICANN auch einige neue Vorschriften für Registrare erlassen. Eine ganz wesentliche Neuerung betrifft die Verifizierung der Domaininhaber.\nAls Voraussetzung für die aktive Nutzung einer Domain muss Innerhalb von 15 Tagen nach der Registrierung, dem Update oder dem Transfer einer Domain eine Verifzierung der Mail-Adresse des Domaininhabers erfolgen.\nWird die Verifzierung nicht innerhalb von 15 Tagen nach Erhalt der ersten Anfrage abgeschlossen, führt dies zu einer Deaktivierung der Domain. Die Domain wird dann in den Status \"Client Hold\" versetzt, so dass die Nameserver vorübergehend aus der TLD-Zone entfernt werden.\nBitte beachten Sie die nachfolgenden Informationen, um zu erfahren, welche Maßnahmen Ihre Kunden ergreifen müssen um eine aktive Nutzung der Domains zu gewährleisten.\nWANN IST EINE INHABER-VERIFIZIERUNG ERFORDERLICH?\n-----------------------------\nDie ICANN verlangt die Verifizierung des Inhaber-Kontaktes wenn:\nder Organisationsname, Vorname oder Nachname geändert wird\ndie E-Mail-Adresse geändert wird\nMails an die Mail-Adresse des Inhabers sich als unzustellbar\nerweisen\ndie Kombination von Name und Mail-Adresse erstmals bei einer\nNeuregistrierung verwendet wird\neine Domain für eine bislang nicht verifzierte Kombination aus Name\nund Mail-Adresse transferiert wird\nWELCHE MAßNAHMEN SIND VOM DOMAININHABER ERFORDERLICH?\n-----------------------------\nJede der oben genannten Operationen löst die Inhaberverifizierung aus.\nHierbei wird eine E-Mail von der Mail-Adresse registrant-verification@registrarmail.net an die Email-Adresse des Domaininhabers gesendet. Der Domaininhaber muss auf den Link in der E-Mail klicken, den Domainbedingungen zustimmen und auf \"submit\"\nklicken.\nWir raten den Domaininhabern, die E-Mail-Adresse registrant-verification@registrarmail.net zu Ihrer E-Mail-Whitelist hinzufügen, damit alle Verifizierungsmails empfangen werden *\nZu den Zeitpunkten 5, 10 und 13 Tage nach der ersten Verifizierungsanfrage werden Erinnerungs-Mails gesendet. Am 10. und 13.\nTag gehen zusätzliche Erinnerungs-E-Mails an die die Adresse des Tech-C und Billing-C geschickt.\nWAS PASSIERT, WENN DIE VERIFIZIERUNGSMAIL NICHT BESTÄTIGT WIRD?\n-----------------------------\nSollte die Inhaberverifizierung nach 16 Tagen nicht erfolgreich durchgeführt worden sein, werden ALLE Domains mit dieser Namen/E-Mail- Kombination auf Client Hold gesetzt. Der Client Hold Status nimmt die Nameserver der Domain aus der TLD-Zone, so dass die Domain nicht mehr aktiv im Internet erreichbar ist. Client Hold verhindert NICHT ein Update, einen Transfer oder die Verlängerung einer Domain. Domains werden aufgrund fehlender Verifizierung NICHT gelöscht.\nERFOLGT DIE VERIFIZIERUNG FÜR JEDE DOMAIN EINZELN, SELBST WENN EINE IDENTISCHE KOMBINATION VON NAMEN UND E-MAIL VERWENDET WIRD?\n-----------------------------\nDie Kombination von Name und E-Mail-Adresse muss nur einmal pro Registrar verifiziert werden.\nZum Beispiel: Max Mustermann besitzt mehrere Domains bei EPAG. Max wird nur eine Verifizierungsmail bekommen, solange bei allen Domains \"Max Mustermann\" als Name, und \"m.mustermann@e-mail.de\" als Inhaber- E-Mail-Adresse eingetragen ist. Alle dieser Domains werden verifiziert, sobald Max Mustermann diese eine Verifizierungs-E-Mail bestätigt. Das gilt auch dann, wenn bei jeder Domain eine unterschiedliche Post-Adresse eingetragen ist.\nSollte Max z.B. den Organisationsname und die E-Mail Adresse für eine dieser Domains ändern, dann wird eine Verifizierungsmail an die neue E-Mail-Adresse gesendet. Diese muss wie gewohnt innerhalb von 15 Tagen bestätigt werden.\nWIE KANN ICH DEN CLIENT HOLD STATUS AUFHEBEN?\n-----------------------------\nNur durch die obenerwähnte Verifizierung kann man den Client Hold Status aufheben.\nUm eine Verifizierungsmail erneut versenden zu lassen, richten Sie bitte eine E-Mail an support@epag.de mit einer Liste der betroffenen Domains.\nFalls eine Domain bereits deaktiviert wurde und der Inhaber danach die E-Mail-Adresse mit einer neuen Adresse ersetzt, wird eine Verifizierungsmail an die neue Adresse geschickt, die Domain bleibt jedoch weiterhin deaktiviert, bis diese Verifizierungsmail bestätigt wird.\nMit freundlichen Grüßen\nAndreas Bartels",
  "business_value": {},
  "assignee": "Unassigned",
  "priority": "",
  "target_start": "",
  "target_end": "",
  "fix_versions": [
    "3.4.0"
  ],
  "acceptance_criteria": [],
  "components": [],
  "labels": [],
  "realized_by": [],
  "child_issues": [],
  "attachments": [
    {
      "filename": "WG  DNSSEC.msg",
      "url": "https://jira.telekom.de/secure/attachment/1829398/WG%20%20DNSSEC.msg",
      "mime_type": "application/octet-stream",
      "size": "406 kB",
      "date": "2014-04-02T18:16:55.000+02:00"
    }
  ]
}