{
  "key": "DUD-9991",
  "issue_type": "Epic",
  "title": "Remove Tech-C",
  "status": "Closed",
  "description": "Description\nManagement Summary\nBei Aufträgen vom Mandaten P&I Hosting wird immer ein Tech-C Datensatz verschickt. Dieser soll zukünftig nicht mehr verschickt werden.\nDescription of Demand / Problem\nBei Aufträgen vom Mandaten P&I Hosting wird immer ein Tech-C Datensatz verschickt. Dieser soll zukünftig nicht mehr verschickt werden.\nAufträge von P&I Hosting an DORIS enthalten immer dieselben Nameserver. Es handelt sich aus Sicht DORIS um Kundennameservice (KNS), obwohl es quasi Primary-Nameservice (PNS) ist; Wir reden hier also über einen Sonderfall.\nHier sind zwei Szenarien zu beachten:\nVirtualnic\nIst: Für PNS wird bereits jetzt kein Tech-C an VNIC übermittelt. VNIC verwendet einen eigenen Tech-C Richtung Registries.\nNeu:  Für den Mandanten P&I Hosting soll der Tech-C entfallen. Hierfür wird der Tech-C für KNS in DORIS als optional deklariert. Somit kann P&I Hosting diesen entfernen.\nAufträge es DAVID müssen weiter einen Tech-C enthalten, da es sich um echten KNS handelt. (nicht wie bei P&I Hosting, wo wir immer mit internen Nameservern arbeiten) \nAndere Registries\nIm Unterschied zu Virtualnic benötigen andere Registires weiterhin einen Tech-C. Damit dieser für P&I Hosting an der SSt. zu DORIS entfallen kann, muss ein Standard-Tech-C durch DORIS gesetzt werden (wie z.B. bei PNS).\nNeu ist hier, dass die Konfiguration der Standard-Kontakte in DORIS um den Mandanten erweitert werden muss.\nWeitere Details in DUD-9985\nAcceptance Criteria\nAbhängige Stories und Tasks sind geschlossen\nChecklist\nDependencies fulfilled (Ticket dependencies).\nAccessibility / Barrierefreiheit: Principles fulfilled. Keine Oberflächenanteile\nDoD: Verified by Scrum Master.\n\nBusiness Scope:\nBBU:\n===\n\nIndividuelle Projektbeschreibung:\n--------------------------------------\nDUD-9991 - Remove Tech-C\nDa sich die Konstellation der Nameserver des DORIS-Mandanten \"P&I Hosting\" nicht ändern, ist der dazugehörige technische Kontakt einer Domain immer derselbe, kann also in der Schnittstelle auf optional geändert werden. DORIS ermittelt den technischen Kontakt eigenständig und ergänzt ihn, sofern notwendig, am Auftrag. So ist sichergestellt, dass die Domain Name Registries weiterhin korrekt von der DORIS beliefert werden.\n- Anpassung der Registrar-Service-Schnittstelle.\n- Anpassung des Nic-Containers: Konfiguration von Standard-Kontakten je DORIS-Mandanten und Domain Name Registries implementiert.\n- Anpassung der Internet-Frontends um optionale Kontakte hinzufügen und entfernen zu können.\n- Durchführung eines Funktions- und Abnahmetest\n\n\nDetaillierte Beschreibung des Nutzenzuflusses/Mehrwertes\n--------------------------------------\nDUD-9991 - Remove Tech-C\nDurch die Verlagerung der Datenhoheit und Kontrolle über den technischen Kontakt in das System DORIS wurde die redundante Datenhaltung deutlich reduziert. Manuellen Eingriffe zwecks Datenbereinigung und Störungsbehebung von Kundenaufträgen durch das Backoffice und Last-Level-Support (Tel-IT) sind nicht mehr notwendig. Das Kundenerlebnis wurde also deutlich verbessert, da weniger Aufträge in Störung fallen bzw. schneller erfolgreich abgeschlossen werden.",
  "business_value": {},
  "assignee": "Daniel Schimek",
  "priority": "",
  "target_start": "",
  "target_end": "",
  "fix_versions": [],
  "acceptance_criteria": [
    "Options",
    "All",
    "Comments",
    "History",
    "Activity",
    "Emails",
    "Transitions",
    "Smart Checklist History",
    "Estimate (async mode)",
    "Add a comment...\nPro tip: press m to comment"
  ],
  "components": [
    {
      "code": "DAVID",
      "title": "DAVID "
    },
    {
      "code": "DORIS",
      "title": "DORIS "
    },
    {
      "code": "Niccontainer",
      "title": "Niccontainer "
    }
  ],
  "labels": [
    "OperationalStability",
    "SPL",
    "SP_Legacy"
  ],
  "realized_by": [],
  "child_issues": [],
  "attachments": []
}