{
  "key": "ECC-9827",
  "issue_type": "Epic",
  "title": "Voice AI Notes Zusatzpaket in Flamingo",
  "status": "Funnel",
  "description": "Description\n  UserStory\n Als Telekom\n möchte ich in Flamingo das Material \"Zusatzpaket Voice AI Notes\" abbilden \n um Angebote für Kunden erstellen zu können.\n   Definition of Ready\n - Die User Story ist abgestimmt. (mandatory)\n - Es ist mindestens ein Akzeptanzkriterium dokumentiert. (mandatory)\n - Alle blockierenden Aufgaben (Tasks) sind geschlossen. (mandatory)\n - Die Provisionierungsanforderungen aus der Technik sind seitens DIVA WebCCo angenommen (anhand der Qualitätskriterien geprüft) und Informationen im Epic dokumentiert. (optional)\n - Der GUI-Prototyp für die neu zu erstellenden und anzupassenden Dialoge liegt vor. (optional)\n - Schnittstellenentwurf liegt vor. (optional)\n - Alle POs der annehmenden Systeme haben der Übernahme in das Product Backlog zugestimmt. (mandatory)\n - Alle, zu Beginn als notwendig erkannten Inhalte sind als Entwurf abgestimmt, ggf. müssen die Inhalte in der Production detailliert werden. (mandatory)\nHINWEISE\nIT Verarbeitungssequenz bzw. Abläufe\n - Darstellung des Ablaufes von …… bis ….. in Anlage A oder Referenz auf Innovatormodell\n - Begründung, falls keine Darstellung des Ablaufes geplant ist.\nHINWEISE für den Prozesstest BSS\n - HINWEIS\n - HINWEIS\n  HINWEISE für den Teil-Prozesstest BSS\n - HINWEIS\n - HINWEIS\nHINWEISE für den Prozesstest OSS\n - HINWEIS\n - HINWEIS\n  HINWEISE für den Prozesstest MCS\n - HINWEIS\n - HINWEIS\n    HINWEISE für den Betreiber\n - Einmalige Aktionen notwendig? Wenn ja, welche?\n - Bestands-Migrationen notwendig? Wenn ja, welche?\n - Änderungen an der Referenz Enterprise notwendig? Wenn ja, welche?\n - Abhängigkeiten zu Technik-Releases, Versionen von Datenbanken, Middleware, OS,…?\n - Die Beschreibung kann noch in der Production detailliert werden.  \n  Hinweis zum Template\nAlle Punkte sind in dem EPIC aufzuführen und zu beschreiben. Es ist zulässig. n.r. einzutragen, also „nicht relevant“\n ",
  "business_value": {},
  "assignee": "Etscheid Andreas",
  "priority": "",
  "target_start": "2025-04-02",
  "target_end": "2025-08-01",
  "fix_versions": [],
  "acceptance_criteria": [
    "Das \"Zusatzpaket Voice AI Notes\" (Materialnummer 50356512) ist abgebildet.",
    "Das Zusatzpaket erhält die Konditionen von PRIMA+.",
    "Das Zusatzpaket kann in Verbindung mit einer CompanyFlex CloudPBX gebucht werden.",
    "Der Preis variiert NICHT in Abhängigkeit der gebuchten parallelen Gespräche.",
    "Wird das Produkt angeboten, muss darauf hingewiesen werden, dass bei Beauftragung zusätzliche diese Dokumente gelten: Erweitere Bedingungen (Link AGB Server pder Prima+) UND ErgB-AV (Deep-Link auf Datenschutz-Server https://geschaeftskunden.telekom.de/hilfe-und-service/dsgvo"
  ],
  "components": [],
  "labels": [
    "25_Q3_Wunsch"
  ],
  "realized_by": [],
  "child_issues": [],
  "attachments": []
}