{
  "key": "ECC-9745",
  "issue_type": "Epic",
  "title": "Beschreibt den Produktkern und seine Funktionen",
  "status": "Funnel",
  "description": "Business Scope:\nDer Nutzer kann das Produktmerkmal AIPBL während jedes Calls nutzen - sowohl an der CloudPBX Festnetz-Rufnummer, die an seinem Arbeitsplatz hinterlegt ist also auch an der Mobilfunknummer die per M1B integriert ist.\nSofern ein Arbeitsplatz Teil einer Gruppe ist, soll die Funktion auch für die Nummer der Gruppe nutzbar sein.",
  "business_value": {},
  "assignee": "Unassigned",
  "priority": "",
  "target_start": "",
  "target_end": "",
  "fix_versions": [],
  "acceptance_criteria": [
    "Der Nutzer kann AIPBL während eines Gespräches zu jeder beliebigen Zeit mit einer Tastenkombination auf seinem Endgerät aktivieren und deaktivieren.",
    "In der Ziellösung ist angedacht, die Funktion mit einem \"wake\" Wort zu steuern",
    "Nach der Aktivierung muss eine Ansage #1 (Voicefile wird geliefert)  für alle Gesprächsteilnehmer erfolgen.",
    "Nach der Deaktivierung muss eine Ansage #2 (Voicefile wird geliefert)  für alle Gesprächsteilnehmer erfolgen. Danach stoppt die AI-Funktion und die Zusammenfassung enthält nur den Teil zwischen Aktivierung und Deaktivierung",
    "Sobald die Funktion in einem Gespräch aktiviert wurde, läuft sie bis zum Ende des Gesprächs, sofern sie nicht manuell per Tastenkombination aufgehoben wird.",
    "Nur der CloudPBX Nutzer kann diese Funktion steuern.",
    "Die AI Zusammenfassung wird nur für den Teil des Gespräches erstellt, wo die Funktion aktiviert war.",
    "Bei jeder Erweiterung des Gespräches um weitere Teilnehmer, müssen diese, die Aktivierungs-Ansage #1 (s.o.) vorgespielt bekommen, sobald sie dem Gespräch beitreten. (betrifft Dreierkonferenz, Rückfrage und Weiterleitung).",
    "Sobald der CloudPBX Nutzer das Konferenzgespräch verlässt endet die AI Funktion.",
    "Hat ein Arbeitsplatz die Assistenzfunktion gebucht, so muss sowohl dieser Arbeitsplatz als auch des Leitenden die AI Funktion buchen, damit die Assistenz dies für den Leitenden nutzen kann. AI Funktion ist nicht übertragbar.",
    "Die Gruppenfunktion kann die AI Funktion nicht zubuchen, die Arbeitsplätze der Nutzer müssen diese Funktion buchen."
  ],
  "components": [],
  "labels": [],
  "realized_by": [],
  "child_issues": [],
  "attachments": []
}