{
  "key": "MAGBUS-97698",
  "issue_type": "Epic",
  "title": "Permission Abmeldung nach Carmen übertragen",
  "status": "Closed",
  "description": "Description\nAufgrund des SOA-BP Retirement übernehmen wir die Funktionalität der Marketing Automation zur Abmeldung von Permissions in Richtung Carmen.\nDadurch melden wir die Permissions sowohl nach TIVU als auch nach Carmen zielgerichtet ab.\nDer Data Consent Master steuert die zielgerichtete Abmeldung der Permissions in die Bestandssysteme\n  Prozessablauf:\nWir erhalten von der Marketing Automation eine Permission Abmeldung eines Mobilfunk Kunden.\nDiese Permission Abmeldung versuchen wir in Richtung Carmen über den Service \"\"CC_changePermissions2\" zu verarbeiten.\nNach erfolgreicher Verarbeitung durch Carmen senden wir der Marketing Automation ebenfalls den Status zurück.\nDie Marketing Automation puffert alle Permission Abmeldungen bis Sie von der SEP eine erfolgreiche Verarbeitung zurück geliefert bekommt.\nIm Fehlerfall sendet die Marketing Automation uns erneut die Permission Abmeldung zu, solange bis wir die Abmeldung erfolgreich nach Carmen verarbeiten konnten.\n\nBusiness Scope:\nIch als PO möchte dass wir im DCM eine zentrale Permission Abmeldung in Richtung Carmen durchführen",
  "business_value": {},
  "assignee": "Jan Kerkmann",
  "priority": "",
  "target_start": "",
  "target_end": "",
  "fix_versions": [
    "PI 27"
  ],
  "acceptance_criteria": [
    "Permission Abmeldungen der Marketing Automation werden an die SEP übermittelt. Die Permissions werden in Richtung TIVU und Carmen zielgerichtet abgemeldet"
  ],
  "components": [
    {
      "code": "SEP-DCM",
      "title": "SEP-DCM "
    }
  ],
  "labels": [
    "BA",
    "MB_SEP"
  ],
  "realized_by": [],
  "child_issues": [],
  "attachments": [
    {
      "filename": "ArchitectureComponentReportCCServices.docx",
      "url": "https://jira.telekom.de/secure/attachment/5151252/ArchitectureComponentReportCCServices.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document",
      "size": "2.67 MB",
      "date": "2024-11-21T11:37:49.475+01:00"
    },
    {
      "filename": "ChangePermissionInCarmen.drawio",
      "url": "https://jira.telekom.de/secure/attachment/5230635/ChangePermissionInCarmen.drawio",
      "mime_type": "application/octet-stream",
      "size": "6 kB",
      "date": "2024-12-16T16:57:29.266+01:00"
    }
  ]
}