{
  "key": "MAGBUS-104642",
  "issue_type": "Portfolio Epic",
  "title": "Flamingo: Business DSL 16 Basic (DP Alternativprodukt für MSAN-POTS bei GK)",
  "status": "Funnel",
  "description": "Description\nAllgemeine Informationen zum Business Epic (BE)\nBusiness Epic Nutzenstatement\nFür Geschäftskunden\ndie aktuell noch analoge Anschlüsse auf Basis MSAN-POTS nutzen\nist wird ein preisewertes Double Play Produkt aus der Business Start Linie benötigt\nwodurch man die ca. 90 Tsd. MSAN-POTS Verträge ablösen kann\nso dass  wir den Kunden / den Anschluss bei uns halten\nund nicht die Kunde den Anschluss nicht kündigen oder zu einem anderen Anbieter wechseln\nDas Vorhaben schafft Umsatzsicherung; Verminderung von Churn, Erhalt der Kundenzufriedenheit durch alternatives Angebot !\nDie ca. 90 Tsd. MSAN-POTS auf Basis Adtran müssen bis Ende 2026 angemanaged werden. Das Alternativangebot sollte Mitte 2025 zur Verfügung stehen. DerVertrieb geht davon aus, dass wir 15-25 Tsd auf das neue DP Produkt bringen kann.\n  Benötigte Produkte in Flamingo\n  Materialnummer Produktbezeichnung\nfolgt Business DSL 16 Basic\nfolgt Speedport 3 refurbed \n50103362 Persönliche Installation  2.0\nBusiness DSL 16 Basic\nCPS Fähigkeit: ja\nBCA fähig: ja, aber nicht rabattierbar\n  Speedport 3 refurbed Kauf / Miete\nDie Mietversion mir Dealcloser 12M 4free, ab Monat 13 Normalpreis\nDazu die Montageleistung mit Anfahrt zum Normalpreis (Persönliche Installation  2.0    75,58 /  89.95 €  MatNr_ 50103362  plus Anfahrt)\nHier soll es auch einen Dealcloser für kostenfreie Anfahrt / Montage geben\n      Business Value / Cost of Delay\n(siehe Ausfüllhilfe: https://wiki.telekom.de/x/UEVbfQ)\nBusiness Impact1)\nScale Revenue             Cost Saving/\nRisk loss 2) Begründung                                                                                                    \n20 6,6 Mio €   Die avisierten 25 Tsd. MSAN-POTS, die in das neue Produkt migrieren, erbringen einen Umsatz von 8,25 Mio € p.a. (Grundentgelt + 2,5 € Verbindungsentgelte. Wir gehen davon aus, dass wir ohne dieses Angebot ca. 80% der Kunden / Anschlüsse nicht halten können und ersatzlos verlieren. Risikoverlust: 80% * 8,25 Mio € = 6,6 Mio € \nStrategic Enablement/Risk Reduktion\nScale     Risiko\nMinimierung     Strat.\nEnablement Begründung                                                                                                    \n8   8 Durch die sehr kurzfristige Kündigung erwartet der Kunde eine adäquates und kostengünstiges Alternativprodukt. Ansonsten wird die Kundenbindung und das Vertrauen in die Leistungsfähigkeit der Telekom erheblich geschwächt.\nTime Criticality \nScale Time Begründung                                                                                                    \n13 Produktlaunch\n  31. Mai 2025 Die 90 Tsd MSAN-POTS müssen bis 31.12.2026 angeschaltet und auf Nachfolgeprodukte migriert werden. Im April 2025 gehen die Ankündigungsschreiben an die 90 Kunden /  Anschlüsse raus. Danach erfolgt die finale Kündigung im mehreren Wellen ab Juni 2025. Mit Versendung der Kündigung melden sich di Kunden und müssen auf das Alternativprodukt umberaten werden. Aus diesem Grunde muss das Produkt in den kommenden 3 Monaten gelauncht werden.\n1) Bezugszeitraum ist 12 Monate nach Launch für neue/zusätzliche Umsatzerlöse\n2) Kosten für Risiken = Schadenshöhe x Eintrittswahrscheinlichkeit\nRahmenbedingungen\nIn Scope / Akzeptanzkriterien - Bitte Jira-Feld \"Akzeptanzkriterien\" befüllen!\nOut of Scope\nDie Realisierung des Produktes erfolgt nur für die Ablösung der kupferbasierten MSAN-POTS Produkte. Produkt wird damit ebenfalls nur auf Kupfer realisiert. Somit keine Abbildung auf Glasfaser.\nAbhängigkeiten/Wechselbeziehungen - Eingangsvoraussetzungen\nDie Kündigung der MSAN-POTS beginnt im April 2025. Bis Ende 2026 müssen alle 90 Tsd. MSAN-POTS abgeräumt sein. Business DSL 16 Start muss also zeitnah im zweiten Quartal 2025 zur Verfügung stehen.\nCross Funktionale Zusammenarbeit\nBeteiligte IT-Applikationen /\nTechnik-Bereiche Beteiligte\nDomains (Tel-IT) Ansprechpartner Bemerkungen                                                                  \nTariffabrik DOM.... Martin Iske  \nEOS DOM0201 Volker Schmidt geprüft, kein aktives to Do, nur eine \"Kleinigkeit\"\nFlamingo DOM0201 Simon Keck geprüft, Aufwand \"S\"\nSeCe-IT DOM0201 Karsten  Kemper  \n  BEO und ggf. Vertreter Claudia Brüggen\nDieter Jakoby\nSponsor/Fachseite <verwende \"@Nachname, Vorname\", um weitere Beteiligte einzufügen>\nWeitere Stakeholder <weitere Bereiche, wie z. B. Service, Technik, Wholesale, etc.>\nWeitere AnsprP <z. B. Stage Gate Projektnummer/Ersteller der Vorlage>\n\nBusiness Scope:\nBusiness DSL 16 Start unterstützt ausschließlich die nahtlose Migration von MSAN-POTS. Es ist geplant bis Ende 2026 ca. 50 Tsd Kunden auf das neue Double Play Produkt zu migrieren und trägt zur Umsatzsicherung bei, indem bestehende Kunden gehalten und Abwanderungen vermieden werden.",
  "business_value": {},
  "assignee": "Keck, Simon",
  "priority": "",
  "target_start": "",
  "target_end": "",
  "fix_versions": [],
  "acceptance_criteria": [
    "Angebote und Preiskalkulationen können erstellt werden (über Flamingo)",
    "Aufträge können prozessiert werden (über Eos/O3)",
    "Rechnungslegung an Kunden ist möglich (über Abilit)"
  ],
  "components": [],
  "labels": [
    "25_Q3_Wunsch",
    "DO_Flamingo",
    "MB_CPQ",
    "VGK_MiBesler"
  ],
  "realized_by": [],
  "child_issues": [],
  "attachments": []
}