{
  "key": "MAGBUS-101130",
  "issue_type": "Epic",
  "title": "[Comet Crew] Extend Shopping Cart and Checkout for initial version for NGMobile",
  "status": "Waiting",
  "description": "Description\nFocus in PI 27:\nShopping Cart page (\"Warenkorb\")\nSummary page (\"Ihre Auftragszusammenfassung\")\nThank You page (\"Vielen Dank für Ihren Auftrag\")\nThe new Checkout process contains 5 pages:\nShopping Cart page\nhttps://www.figma.com/design/PlIAaKFs4gvxgzksPRCbiZ/New-order-journey?node-id=567-87844&p=f&t=nIIr9MYJU3gZbRh0-0\nProduct Customization page\nhttps://www.figma.com/design/PlIAaKFs4gvxgzksPRCbiZ/New-order-journey?node-id=567-87843\nBilling & Shipping page\nhttps://www.figma.com/design/PlIAaKFs4gvxgzksPRCbiZ/New-order-journey?node-id=1045-19125\nSummary page\nhttps://www.figma.com/design/PlIAaKFs4gvxgzksPRCbiZ/New-order-journey?node-id=567-87845\nThank You page\nSee Figma for Summary page labeled as Success screen\nNote: You must be logged into Figma to see the designs. Also you must be eligible for this design file. If you see an input field \"Password required. You need a password to access the file New order journey\", please ask Theresa Kuschke to invite you to the file \"New order journey\".\nTopics to be prioritized for the basic MVP\nIn scope: The shopping cart contains only one package.\nLater: The shopping cart contains multiple packages.\nIn scope: The package has a quantity of 1. Only one contract with one phone number is created with the new order.\nLater: The package has a quantity up to of 100.\nLater: There is no package with a main contract and subcontracts (\"Teamkarten\").\nIn scope: The contract can have MultiSIMs.\nLater: There will be packages with devices.\nOut of scope: Customers are not listed in the Phone Directory.\nIn scope: Enter the customer password\nLater: Enter the start date (default: as soon as possible)\nLater: Select contract barriers\nIn scope: Display the contract duration (default: 24 months)\nIn scope: Select SIM type for main SIM per contract\nIn scope: Select SIM type for the MultiSIMs per contract and per MultiSIM\nIn scope: Mobile number portability: Enter the source provider, etc. per package, enter the phone number per contract\nLater: Blank SIM cards\nLater: Reserved phone numbers\nIn scope: Enter cost center and cost center user per contract\nIn scope: Select the billing account (read list of billing accounts for customer number and RV). Show data of the selected billing account.\nLater: Create a new billing account\nIn scope: Choose the customer's address as the shipping address. Show the customer's address\nLater: Enter a new shipping address, per package or per contract\nIn scope: Summary page with the content of the shopping cart and checkboxes for terms and conditions\nLater: Integrate order document and VVI/VZF into Summary page\nIn scope: Map the shopping cart to MB2B",
  "business_value": {},
  "assignee": "Peter Max Messelken",
  "priority": "",
  "target_start": "",
  "target_end": "",
  "fix_versions": [
    "PI 27"
  ],
  "acceptance_criteria": [],
  "components": [],
  "labels": [
    "MB_Comet",
    "MB_checked"
  ],
  "realized_by": [],
  "child_issues": [],
  "attachments": []
}