{
  "key": "MAGBUS-99786",
  "issue_type": "Initiative",
  "title": "Enhancement Order Tracking Q1",
  "status": "In Progress",
  "description": "Description\nAll orders go through the MB2B-POM interface. There will be no new channel ID in the MVP, so orders from different systems cannot be differentiated.\nAll orders are displayed in the BSP order management system.\nShopping carts that have not been submitted have not gone through MB2B and are therefore not visible in the BSP order management system (see Shopping Cart)\nIn the MVP, there will be no button in NG Mobile to park an order.\nIn NG Mobile, the shopping cart is persistent for a configurable retention period (default 30 days). It can be further processed without the parking function. If a user wants to use the conventional parking function via OMS/OS, they must use BSP Classic.\nIn the MVP, we will utilize the capabilities of MB2B POM and OMS/OE. Order documents are generated by NG Mobile and included with the MB2B POM orders. There is one order document for each OMS/OE order we create. The display in the order management in BSP Classic shows the generated OMS/OE orders. A stronger aggregation to one order document/pdf per shopping cart will not be implemented in Q2/2025 for velocity reasons and will be reconsidered for Q3/2025 or will be incorporated into the Comet Crew's order tracking.\nhttps://miro.com/app/board/uXjVK2d9uJ0=/\nCa_magenta!",
  "business_value": {},
  "assignee": "Hampel, Bodo",
  "priority": "",
  "target_start": "",
  "target_end": "2025-12-31",
  "fix_versions": [
    "Q1_25"
  ],
  "acceptance_criteria": [],
  "components": [
    {
      "code": "C14",
      "title": "C14 "
    }
  ],
  "labels": [
    "GK_Kundencenter",
    "Roadmap.2025.VSDT"
  ],
  "realized_by": [
    {
      "key": "MAGBUS-95510",
      "title": "MAGBUS-95510",
      "summary": "[Comet] MBSP: Order Tracking for mobile and Order overview (preparation NGM 1/2)",
      "url": "https://jira.telekom.de/browse/MAGBUS-95510",
      "relation_type": "child"
    }
  ],
  "child_issues": [],
  "attachments": []
}