{
  "key": "MAGBUS-100541",
  "issue_type": "Initiative",
  "title": "Enhancement Shopping Cart Q1",
  "status": "In Progress",
  "description": "Description\nK-Support\nThe customer context must be defined by the support agent (K-Support) in the MVP:\nClicking \"Weiter zur Tarifauswahl\" on the \"Kundendaten\" page creates a new shopping cart for the selected context (i.e. for a customer user: user ID and RV).\nIf the user adds any product to the shopping cart and interrupts the order process, the contents of the shopping cart will be stored for 30 days. Expired shopping carts are deleted.\nThe support agent (K-Support) can access the unsent shopping cart (active shopping cart) by using the Quickfinder to set the context \"customer number + framework agreement\" again and selecting \"New business without device\" from the menu.\nIt is checked whether prices and promotions are still correct. If not, either prices and promotions are updated if possible and the user is informed about the update, or the user sees a warning that the shopping cart is outdated and the stored shopping cart will be discarded.\nIf this shopping cart is not submitted, it remains active and will be reopened when the customer and framework agreement combination for this framework agreement is accessed again via the Quickfinder.\nOnce the shopping cart is checked out, it is no longer valid and available. One or more OMS orders are created for it.\n  Reasons why K-Support does not submit a request immediately:\nSzenario Recommendation\nThe process is not completed for unknown reasons (eg EOB). As a rule, every process should be completed as quickly as possible. This means we expect the majority of orders to be created immediately. If orders are sent on a different day, we will assume the data is still valid and accept an error in OMS.\n Customer authentication is pending. The customer's authentication is ensured with the digital signature.\nIn consultation with the customer, the process should be completed at a later date (devices available later, better offers, tariffs or options in the future). If it makes sense to checkout a ShoppingCart in the future, ShoppingCart should also be created in the future.\n... ...\n  Active ShoppingCarts\nIn the MVP, there is always only one active shopping cart for each customer number and framework agreement.\nAfter clicking on \"New Business without Device\" in the menu, a check is made to see whether an active shopping cart exists for the combination of customer number and framework agreement.\nIf an active shopping cart exists, it will be displayed on the first page of \"Configure Order.\"\nAn active shopping cart cannot be deleted. Instead, the user must remove individual items from the shopping cart.\nAssumption\nThere are many scenarios why customers might not submit a shopping cart immediately (eg. Internal coordination or approval processes on customer side. Vacation, technical problems,...). Once customers use NGMobile, the contents (eg. Prices) of an reopened and unsubmitted shopping cart must be validated.\nBut in what scenario would a support agent create a shopping cart and then submit it days or weeks later? We assume that a support agent wants to submit an order as quickly as possible. Therefore, for the MVP, we accept that an invalid shopping cart will result in an error in OMS/OE.\nLinks:\nWiki\nhttps://wiki.telekom.de/pages/viewpage.action?spaceKey=MBFY&title=97+Clarification+ShoppingCart\nMiro\nhttps://miro.com/app/board/uXjVK2d9uJ0=/\nCa_magenta!",
  "business_value": {},
  "assignee": "Hampel, Bodo",
  "priority": "",
  "target_start": "",
  "target_end": "2025-12-31",
  "fix_versions": [
    "Q1_25"
  ],
  "acceptance_criteria": [],
  "components": [
    {
      "code": "C14",
      "title": "C14 "
    }
  ],
  "labels": [
    "GK_Kundencenter",
    "Roadmap.2025.VSDT"
  ],
  "realized_by": [
    {
      "key": "MAGBUS-100513",
      "title": "MAGBUS-100513",
      "summary": "[Comet Crew] Prepare Shopping Cart for NGMobile",
      "url": "https://jira.telekom.de/browse/MAGBUS-100513",
      "relation_type": "child"
    },
    {
      "key": "MAGBUS-100512",
      "title": "MAGBUS-100512",
      "summary": "Shopping Cart: Change database to MongoDB for NGMobile",
      "url": "https://jira.telekom.de/browse/MAGBUS-100512",
      "relation_type": "child"
    },
    {
      "key": "MAGBUS-101126",
      "title": "MAGBUS-101126",
      "summary": "[Comet Crew] Part 1 Map ShoppingCart to MB2B order structure for NGMobile",
      "url": "https://jira.telekom.de/browse/MAGBUS-101126",
      "relation_type": "child"
    }
  ],
  "child_issues": [],
  "attachments": [
    {
      "filename": "image-2025-03-26-09-26-58-955.png",
      "url": "https://jira.telekom.de/secure/attachment/5540172/image-2025-03-26-09-26-58-955.png",
      "mime_type": "image/png",
      "size": "54 kB",
      "date": "2025-03-26T09:26:59.246+01:00"
    }
  ]
}