{
  "key": "MAGBUS-85942",
  "issue_type": "Epic",
  "title": "Exploration: Anbindung an Carmen Party-API - Ansprechpartner",
  "status": "Resolved",
  "description": "Description\nIch als PO möchte dass wir die SEP an die vorhandene Carmen Party-API/partyManagement API (TMF632) anbinden um kundenseitige Mobilfunk-Ansprechpartner-Daten unserer Geschäftspartner (GP) abfragen zu können und um diese in die SEP zu laden.\nDa innerhalb Carmen eine abweichende Struktur zur GK-Struktur existiert wird der MVP-Fokus auf dem Vertragspartner 2 mit seinen dazugehörigen Erreichbarkeiten liegen.\nDer Vertragspartner2 in Carmen wird als neues Individual innerhalb der SEP abgebildet. Seine Erreichbarkeiten als eigenständige ContactMedium Objekte angelegt. Sollte ein eMail-ContactMedium oder Adress ContactMedium bereits existieren wird auf das bestehende ContactMedium referenziert.\n  Aktuell muss noch geprüft werden ob wir von Carmen einen Datenexport, aller uns bekannten Mobile Kunden aus CDI, mit den Daten des VP2 erhalten können um eine Initial-Migration durchzuführen und darauf aufbauen die Event-Verarbeitung zu nutzen.\nSollte dies nicht möglich sein muss ein Job zur Abfrage der Daten über die vorhandene API gebaut werden, welcher in Abstimmung mit Carmen die Initial Migration durchführt. Sobald die relevanten Daten in die SEP überführt wurden, wird auch hier auf die Event-Verarbeitung reagiert.\n  Neben den Ansprechpartner-Daten wollen wir auch die KEK des Business Partners und die Kanal Permissionen des VP2 aus Carmen erhalten. Die abgebildete Logik in Carmen ignorieren wir und übernehmen die des VP2 getätigten Aussagen in die SEP\n \n\nBusiness Scope:\nIch als PO möchte dass die SEP an die vorhandene Carmen-Party-API angebunden wird und wir Zugriff auf die kundenseitigen Mobilfunk-Ansprechpartner zu erhalten",
  "business_value": {},
  "assignee": "Unassigned",
  "priority": "",
  "target_start": "",
  "target_end": "",
  "fix_versions": [
    "PI 23"
  ],
  "acceptance_criteria": [
    "Die SEP ist an die Carmen Party-API angebunden",
    "Der VP2 eines GK-GeschäftsPartner (GP) wird über die API abgefragt und in die SEP geladen.",
    "Wir reagieren auf die Event-Verarbeitung der uns bekannten MobileAnsprechpartner"
  ],
  "components": [
    {
      "code": "SEP-Platform",
      "title": "SEP-Platform "
    }
  ],
  "labels": [
    "MB_SEP"
  ],
  "realized_by": [],
  "child_issues": [],
  "attachments": []
}