{
  "key": "MAGBUS-100445",
  "issue_type": "Initiative",
  "title": "Process Starter",
  "status": "Analysis",
  "description": "Description\nDescription:\nIn the first phase of the project, an MVP (Minimal Viable Product) will be developed for the new Process Starter that includes the integration of a new Single Page Application (SPA) into the existing business portal BSP. This SPA will enable users to select their customer number, create a shopping cart, and are redirected to the tariff page with  the cart number. The SPA will be integrated into the existing portal to provide a seamless user experience while communicating with the backend microservices BCPS to validate the customer’s permissions and retrieve necessary data (e.g., VO-Number, RV-Number, customer number, ....).\nThe first phase will focus on ensuring the core functionality works, while future phases will expand the process with additional use cases and features.\nGoal of MVP:\nEnsure seamless integration of the new {}SPA into the existing portal\nImplement basic functionality: customer number selection, shopping cart creation, and redirection to the product page\nIntegrate with backend microservices like BCPS to validate user permissions, and ensure that the system works securely and eﬃciently.\nTarget Audience:\nBusiness customers using the corporate portal to place orders without devices\ninternal User like sales departments, shops, …\nValue of MVP:\nA stable, integrated foundation for the new process that enhances the user experience without disrupting the existing portal\nEarly validation of key integrations between the SPA, microservices, and the tariff page, allowing for eﬃcient feature expansion in later phases\nLinks:\ntechnical details: https://wiki.telekom.de/display/MBFY/01.+Customer+Data\nmiro journey: https://miro.com/app/board/uXjVK2d9uJ0=/?moveToWidget=3458764608206068509&cot=10\nmiro password: Ca_magenta!\n ",
  "business_value": {},
  "assignee": "Unassigned",
  "priority": "",
  "target_start": "",
  "target_end": "",
  "fix_versions": [
    "Q1_25"
  ],
  "acceptance_criteria": [
    "create a new SPA Process Starter incl. UI (Figma)",
    "new SPA should be integrated in BSP \na new menu entry will bring the user to the new SPA",
    "a new menu entry will bring the user to the new SPA",
    "the new SPA works with BCPS",
    "the new SPA works with the Shopping cart service\nSPA can create a new cart with some user information",
    "SPA can create a new cart with some user information",
    "the new SPA can handover the user to the tariff page",
    "account-id (SIGN), VO and RV and other data from quickfinder will be handover to the new SPA via jwt",
    "Analyze which data is required for the new SPA Process Starter from BCPS or other systems\nPreparation for Phase 2",
    "Preparation for Phase 2"
  ],
  "components": [
    {
      "code": "C14",
      "title": "C14 "
    }
  ],
  "labels": [
    "DT"
  ],
  "realized_by": [
    {
      "key": "MAGBUS-99909",
      "title": "MAGBUS-99909",
      "summary": "[BSP] NGMobile enabler - JWT library",
      "url": "https://jira.telekom.de/browse/MAGBUS-99909",
      "relation_type": "child"
    },
    {
      "key": "MAGBUS-100502",
      "title": "MAGBUS-100502",
      "summary": "Start NG-SPA from BSP (MVP)",
      "url": "https://jira.telekom.de/browse/MAGBUS-100502",
      "relation_type": "child"
    },
    {
      "key": "MAGBUS-106566",
      "title": "MAGBUS-106566",
      "summary": "NGM Integration & E2E-test",
      "url": "https://jira.telekom.de/browse/MAGBUS-106566",
      "relation_type": "child"
    }
  ],
  "child_issues": [],
  "attachments": []
}