{
  "key": "MAGBUS-104821",
  "issue_type": "Epic",
  "title": "Implementation of Speedport 7 in AGB Chain",
  "status": "Backlog",
  "description": "Description\nenglish below\n  Business Epic Nutzenstatement\nFür Kunden im Fokus Segment KMU (XL, L, M Ergänzungsportfolio)\ndie einen einfachen und leistungsstarken Router, sowie ein Nachfolgeprodukt der bisherigen Digitalisierungsboxen 2 suchen,\nist der neue Speedport das optimale Produkt,\nwodurch die Kunden einen Router für Ihre Bedürfnisse erhalten und das Anschluss Portfolio der TDG optimal nutzen können\nund zu nicht fokussierten Produktportfolios wechseln, die keine optimale Kompatibilität haben und Up-Selling Pfade blockieren.\nDas Vorhaben schafft\nSynergie mit dem PK-Portfolio und damit gleichzeitig die Nutzung weiterer Proposition Elemente aus dem Consumer Umfeld wie z.B. Mesh\nDie Integration wichtiger GK-Feature wie Kompatibilität zu „Unbreakable\" und dem weiteren GK-Anschluss-Portfolio\nEine Professionalisierung des Serviceerlebnisses für GK-Kunden, durch neue GK-Installations-und Entstörservices\nAuswirkung bei Nichtumsetzung:\nKein GK kompatibler Router für das Massenmarktgeschäft vermarktbar\nGefährdung Vermarktung Non Stop Netz Proposition\n  -------------------------------------------------------------------------------------------------\n  Business Epic benefit statement\nFor customers in the focus segment SME (XL, L, M supplementary portfolio)\nwho are looking for a simple and powerful router, as well as a successor product to the previous digitization boxes 2,\nis the new Speedport the optimal product,\nwhich means that customers get a router for their needs and can make optimal use of the TDG connection portfolio and switch to non-focused product portfolios that do not have optimal compatibility and block up-selling paths.\nThe project creates\nSynergy with the PK portfolio and thus at the same time the use of other proposition elements from the consumer environment such as Mesh\nThe integration of important GK features such as compatibility with \"Unbreakable\" and the other GK connection portfolio\nA professionalization of the service experience for GK customers, through new GK installation and troubleshooting services\nImpact of non-implementation:\nNo GK compatible router can be marketed for the mass market business\nDanger of marketing Non Stop Network Proposition",
  "business_value": {},
  "assignee": "Unassigned",
  "priority": "",
  "target_start": "2025-04-24",
  "target_end": "2025-06-04",
  "fix_versions": [
    "PI 28"
  ],
  "acceptance_criteria": [
    "Speedport 7 (bundles) including services  is bookable in Flamingo.",
    "Speedport 7 can be processed E2E."
  ],
  "components": [
    {
      "code": "MB_CPQ",
      "title": "MB_CPQ "
    }
  ],
  "labels": [
    "DO_Flamingo",
    "MB_CPQ"
  ],
  "realized_by": [],
  "child_issues": [],
  "attachments": [
    {
      "filename": "AW_ SP7 @ GK.msg",
      "url": "https://jira.telekom.de/secure/attachment/5587944/AW_%20SP7%20%40%20GK.msg",
      "mime_type": "application/octet-stream",
      "size": "278 kB",
      "date": "2025-04-08T13:50:36.625+02:00"
    }
  ]
}