{
  "key": "MAGBUS-99839",
  "issue_type": "Portfolio Epic",
  "title": "New Mobile Business Order Process - Handling of Customer- (Data) Q1",
  "status": "In Progress",
  "description": "Description\nDescription:\nIn the first phase of the project, an MVP (Minimal Viable Product) will be developed for the new Process Starter that includes the integration of a new Single Page Application (SPA) into the existing business portal BSP. This SPA will enable users to select their customer number, create a shopping cart, and are redirected to the tariff page with  the cart number. The SPA will be integrated into the existing portal to provide a seamless user experience while communicating with the backend microservices BCPS to validate the customer’s permissions and retrieve necessary data (e.g., VO-Number, RV-Number, customer number, ....).\nThe first phase will focus on ensuring the core functionality works, while future phases will expand the process with additional use cases and features.\nGoal of MVP:\nEnsure seamless integration of the new {}SPA into the existing portal\nImplement basic functionality: customer number selection, shopping cart creation, and redirection to the product page\nIntegrate with backend microservices like BCPS to validate user permissions, and ensure that the system works securely and eﬃciently.\nTarget Audience:\nBusiness customers using the corporate portal to place orders without devices\ninternal User like sales departments, shops, …\nValue of MVP:\nA stable, integrated foundation for the new process that enhances the user experience without disrupting the existing portal\nEarly validation of key integrations between the SPA, microservices, and the tariff page, allowing for eﬃcient feature expansion in later phases\nLinks:\ntechnical details: https://wiki.telekom.de/display/MBFY/01.+Customer+Data\nmiro journey: https://miro.com/app/board/uXjVK2d9uJ0=/?moveToWidget=3458764608206068509&cot=10\nmiro password: Ca_magenta!\n       ",
  "business_value": {},
  "assignee": "Frank Gehlhaar",
  "priority": "",
  "target_start": "",
  "target_end": "",
  "fix_versions": [
    "Q1_25"
  ],
  "acceptance_criteria": [],
  "components": [],
  "labels": [
    "DT"
  ],
  "realized_by": [
    {
      "key": "MAGBUS-99840",
      "title": "MAGBUS-99840",
      "summary": "Expansion of BCPS Service with SPRM Integration",
      "url": "https://jira.telekom.de/browse/MAGBUS-99840",
      "relation_type": "child"
    },
    {
      "key": "MAGBUS-100445",
      "title": "MAGBUS-100445",
      "summary": "Process Starter",
      "url": "https://jira.telekom.de/browse/MAGBUS-100445",
      "relation_type": "child"
    }
  ],
  "child_issues": [],
  "attachments": []
}