{
  "key": "MAGBUS-100513",
  "issue_type": "Epic",
  "title": "[Comet Crew] Prepare Shopping Cart for NGMobile",
  "status": "Waiting",
  "description": "Description\nThe new mobile order management system has to handle all kind of mobile orders, in the first step contracts without a device can be ordered via the NGMobile (NGM). Orders can be placed in different roles, e.g. Service, Sales, Customer.\nIt is possible to order in every known framecontract, not only TM214 like in GKP. In the first MVP is it possible to order for a given customer number and a given customer account number in the given framecontract.\nThe Shopping Cart has to be enabled that all relevant data can be stored in the shopping cart and it is possible to send the order to a order management system,\nFor the new SPA, the Configurator component ensures that only valid data is put into the shopping cart and the Shopping Cart component does the summation of the given prices.\nSeparate Price Calculation and Product Validation: In the UI design of the new SPA, the Shopping Cart is updated after each option change. We expect that the total prices in the Shopping Cart must be recalculated frequently with fast response time. We shall separate the calculation of the total prices from the validation of the product configuration. We expect that the validation is done by the Configurator (see comment, below).\nTechnical changes in the shopping cart\nThe \"New Mobile Order Management System\" has to call the shopping cart API with the new value originatingPortalIdentifier \"NGM\" in every cart item.\nThe shopping cart API has to ensure that it is possible to update shopping carts for NGMobile without validation. Only the price calculation has to be done in every update call.\nSeparate access to shopping cart with and without validation.\nSeparate access only for price calculation\nNew validation adapter for NGMobile:\n1. technical setup of the new validation adapter for NGMobile\n2. build the connection between NGM-VA and shopping cart\n3. price calculation of NGM-VA\n4. build connection to Nepal for the NGM-VA. TBD: connection currently not needed\nValidations: Currently no validations are required.\nContract barriers: It must be possible to set one or more contract barrings on the currently ordered mobile contract. This is not part of the ShC but data which is handled in the checkOut.\nOptions with characteristic : needed for booking of several tariff options (OptionConfigurationCharacteristic)\nExample of options with characteristic: MSTEAMS, LOCAL, HOMEAREA1.\nAdditional contracts (AdditionalService) in the frame contract: RVZV for example IP-VPN or Telemetrie\nCustomer Number in Shopping Cart -> sensitive data!\nCustomer Accountnumber in Shopping Cart. -> sensitive data!\n\nNeeded data, in which role the ShC was created? Sales, Service, Customer or PVG ?\nRestrict access to customer's data\nThe Shopping Cart may store information that is considered private or confidential (e.g. \"Kundenkennwort\", a secret word for contract changes via hotline). A DevOps engineer shall not be able to see this sensitive information, as it is not necessary for the maintenance of the software.\nCreate Warenkorb page with price overview (Preisübersicht)",
  "business_value": {},
  "assignee": "Stefan Wilkes",
  "priority": "",
  "target_start": "",
  "target_end": "",
  "fix_versions": [
    "PI 27"
  ],
  "acceptance_criteria": [],
  "components": [],
  "labels": [
    "MB_Comet",
    "MB_checked"
  ],
  "realized_by": [],
  "child_issues": [],
  "attachments": []
}