{
  "key": "MAGBUS-105996",
  "issue_type": "Epic",
  "title": "MF: DTS - Integration Vertriebskanal in MagentaForce",
  "status": "Analysis",
  "description": "Description\nFür wen? Im Bereich DTS (KMU Service) wird die Rolle für (weitere) interne und externe Mitarbeiter (externe Dienstleister, Inbound und Outbound) benötigt. Konkret sollen die zukünftigen KMU-Service Rollen auch für die externen Mitarbeiter Anwendung finden können. \nWelches Bedürfnis? Durch die operative Neuorganisation ist es notwendig, dass sowohl weitere interne MA, als auch externen Dienstleister bei DTS Sales & Care KMU (Mass- u. Midmarket) Zugriff auf MagentaForce erhalten. Diese bearbeiten einen Großteil der Kundenanliegen bei S&S. Damit eine einheitliche Arbeitsweise und Transparenz für alle Kanäle vollumfänglich etabliert werden kann, ist MagentaForce als Collaboration Tool zwingend notwendig. Die Mitarbeiter müssen auf bisherige Kundenkontakte, versandte Angebote etc. zugreifen können, um eine \"Omni-Channel\"-Like Beratung durchführen können. Zusätzlich gibt es eine Revisionsentscheidung zur Boni-Prüfung über MagentaForce (Deaktivierung des Flamingo Direkteinstiegs mit Verlagerung in MagentaForce).\nWie wird es gemacht? Sowohl die internen, als auch externen, DTS KMU Service Mitarbeiter erhalten die Berechtigung weitere Kennungen (bereits für DTS definiert) zu bestellen. Für die externen Mitarbeiter muss MagentaForce über die VDS o.ä. zur Verfügung gestellt werden - auch hier werden dann entsprechende Kennungen benötigt. \nWas ist der Mehrwert? Der Mehrwert besteht darin, dass wir konkurrierende Angebote beim Kunden platzieren was beim Kunden zu Unverständnis führt aber auch dazu führen kann, dass wir uns vor Kunde im Angebot unterbieten. Ebenso ist mit der Anbindung weiterer Mitarbeiter ein System durchgängig in der Kontaktverfolgung, Lead- und Vorhabenbearbeitung, und Kontaktdatenpflege maßgeblich + prozessuale Sicherstellung der Boni-Prüfung vor Angebotserstellung über Flamingo\nWas ist der Differenzierer - das \"Warum\"? siehe Mehrwert + wir vermeiden doppelte Arbeit im Angang des Kunden. Ebenso wird durch eine Ausweitung der Nutzergruppe die Systemakzeptanz weiter gesteigert, da alle Mitarbeiter in einem System Arbeiten können. Ebenso können Kunden so leichter in höhere Segmente entwickelt werden, wenn die Kontakt- und Kundenhistorie konsistent ist. Die Arbeit zwischen Massenmarkt und Midmarket wird dabei homogenisiert. Basis zur Neukundenanlage im Midmarket (VBKz 34 ist ebenfalls MagentaForce/Absprung nach CDI aus MagentaForce).\n  Zusatz für die Anbindung für den SK Midmarket: \"externer Outbound\", \"Public Inbound/Kampagnen\" , \"Midmarket Kampagnen\":\nPRIO!\nFür die im Zusatz definierten User,\ndie SK Massenmarkt/SK Midmarket Serviceanliegen (ankommende/abgehende Telefonie/Work) bearbeiten werden,\nist die technische Anbindung der externen Service Partner an MagentaForce, maßgeblich zur Sicherstellung der vollumfänglichen Arbeitsfähigkeit. Magenta Force hat seit dem 01.11.2024 eine zentrale Rolle in der ganzheitlichen Bearbeitung der Kundenanliegen, sowie der 360 Grad Transparenz über SK (MM/Midmarket), SGrK und Vertrieb.\nDurch die erforderliche Anbindung der externen Service Partner (Details siehe \"In Scope\"), sind die Erweiterungen notwendig,   \nso dass alle benannten User im SK Massenmarkt/SK Midmarket (hier externer Inbound/Outbound) ihre Aufgaben wahrnehmen können und eine einheitliche Arbeitsweise mit den internen Einheiten sichergestellt ist,\nund nicht in ihrer Arbeitsfähigkeit eingeschränkt sind bzw. Kontaktangänge der externen Servicepartner nicht abgebildet werden können.\nDas Vorhaben schafft Transparenz zu notwendigen IT Anpassungen, sowie die Absicherung der Geschäfts-, Service & Umsatzziele. Die SK Kunden im Massenmarkt/Midmarket können ohne Unterbrechung abschließend betreut werden. Die Kundenzufriedenheitsziel soll durch diese Maßnahme final abgesichert werden (Kunden zu Fans machen). Zusätzlich stellt die Umsetzung der Anforderung sicher, dass alle Kunden kanalübergreifend (ohne Medienbruch) bearbeitet werden können und bedarfsgerecht auch z.B. ein Lead an einen AcM abgegeben bzw. bei Serviceanliegen außerhalb des vertrieblichen Kundenkontaktes, die jeweiligen Serviceteams gezielt angesteuert werden können. \nIn Scope (technische Anbindung):\nMagenta Force:\nSicherstellung der übergreifenden 360 Grad Transparenz (Kundenkontaktmanagement)\nDokumentation der Outbound Kontakte \nBereitstellung der dedizierten Rechte&Rolle -> angelehnt an die SK User (Intern)\nStrategische Zusammenarbeit mit externen Partnern absichern (\"100% Partner\" laut Commitment in der GL Service).\nDie Möglichkeit der Leadweitergabe in Richtung DV\nAusblenden der \"Kalendersicht der zuständigen ACM\" -> Datenschutz\nBasis geschaffen:\nVDS Anbindung vorhanden (User im Backoffice nutzen derzeit schon CRM-T/Carmen)\nDie Datenschutz Freigabe zur Anbindung des externen Outbounds über CORM liegt bereits vor (25.04.2023).\nFlamingo:\nHohe Priorität durch die Abschaltung des Flamingo Direkteinstiegs (Ende Q1/2025)\nAngebote für GK Produkte werden über Flamingo erstellt - ein Einstieg ist nur noch über das Vorhaben aus Magenta Force möglich.\n  Kommentar vom 05.03.2024 beachten:\nInkl. der Erweiterung zur Möglichkeit im Midmarket, zur regionalen Leadsteuerung für M-Potential 34-C aus dem Vorabsprache Termin --> Leads vom Vertrieb für 34-C Kunden, sollen in jeweils 1 Warteschlange (nach der regionalen Zuordnung der Teams - AKP/AcN Zuordnung), auf Teamebene geroutet werden können -> keine Mails mehr an die Team FMB´s , sondern Absicherung einer 360 Grad Bearbeitung über Magenta Force aus Anforderung vom Vertrieb (100% Magenta Force)\nTiefere Erläuterung (+ siehe Schaubild \"Beispielvorgang Lead Potential Kunde):\nRegio Leads C (individuelle Ansteuerungsmöglichkeit durch die Warteschlangen Übersetzung aus AKP/E-Mail Adresse IRRP nach der Kunde Team Zuordnung für C-Potential Kunden)\nSicherstellung des Routings und der 100% Leadgenerierung über Magenta Force durch den Vertrieb Midmarket\nDadurch wird der 100% Leadeingang über Magenta Force aus Richtung Vertrieb sichergestellt - die Umgehungslösungen per E-Mail werden obsolet und wir erfüllen damit dann auch die Erwartung des Vertriebs Midmarket, die Orga rein über Magenta Force zu lenken.\n-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------\nAbschichtung Public:\nRollen und Rechtekonzept\nRollenbezeichnung (in Abstimmung mit Manuela Schauer orientiert sich der Bedarf an der Rolle: „GK Sales Manager/Fachvertrieb segmentübergreifend“\nPublic-Kollegen arbeiten erstmal alle nur mit den normalen Rollen (ohne Overhead) (Hintergrund: zuständige Projektleiterin für Public steuert neben Public ebenfalls extern Midmarket)\nOutbound\nRollen und Rechtekonzept\nRolle soll ähnlich der internen Midmarket Rolle gebaut werden (Einschränkung zur internen Midmarket Rolle: extern soll nur Zugriff auf alle KD aus Midmarket VBKz haben), d.h. keine 1:1 Übersetzung der Midmarket Rolle\nDarüber hinaus wichtig:\nWenn Mitarbeiter Lead übernimmt, sollten folgende Informationen im Lead angezeigt werden:\nLead-Inhaber im Lead: Klarname des Mitarbeiters\nAktueller Kanal im Lead sollte (wie die Warteschlange auch) ebenfalls den Zusatz extern haben, also \"DTS extern\" haben\nFiltermöglichkeit für externe Kollegen nach Kampagnen \nArbeitsweise\nOutbound Kollegen sollen weiterhin über Dialer arbeiten\nPrüfung der Möglichkeit, dass sich Kundennummer automatisch aus Dialer in MagentaForce reinkopiert (vgl. MaVi externer Outbound über Link)\n ",
  "business_value": {},
  "assignee": "Jana Beyer",
  "priority": "",
  "target_start": "",
  "target_end": "",
  "fix_versions": [
    "PI 28",
    "MF 4.600"
  ],
  "acceptance_criteria": [
    "Mitarbeiter werden bzw. wurden geschult",
    "Kennung werden bzw. wurden an Mitarbeiter in dem benannten Bereich versandt",
    "Zugriff auf die Anwendung ist erfolgt; Bearbeitung Segmentübergreifend ist möglich",
    "Support-Weg beim Störungen ist aufgebaut",
    "Weiterleitungen zwischen den (Segment-) Bereichen ist möglich",
    "Rollen- und Berechtigungskonzept ist erstellt und ist aktiv",
    "Reporting ist sichergestellt",
    "Zusätzliche Kennung sind im Forecast berücksichtigt"
  ],
  "components": [
    {
      "code": "aKP",
      "title": "aKP "
    },
    {
      "code": "MagentaForce",
      "title": "MagentaForce "
    }
  ],
  "labels": [
    "MB_MF"
  ],
  "realized_by": [],
  "child_issues": [],
  "attachments": []
}