{
  "key": "MAGBUS-100544",
  "issue_type": "Epic",
  "title": "CSRM: Initiative",
  "status": "Closed",
  "description": "Description\nFür das Customer Success und Renewal Management Team\nist die Maßnahme, eine Dokumentationsmodul zu schaffen in dem Projekte (Initiativen) gemeinsam mit dem Kunden festgehalten und dokumentiert werden können\nwelche in einer Oberfläche individuell beschrieben , die verwendeten Technologien definiert und der Entwicklungsfortschritt für jede angelegte Initiative abgebildet werden kann\nim Gegensatz zu heute, wo die Dokumentation innerhalb des Lifecycle (der produktbezogen und nicht mehr der ursprünglichen vorgegebenen Arbeitsweise von Cisco entspricht) in Form von Aufgaben und Beschreibungsfeldern oder alternativ im separaten Kontaktmodul stattfindet \nbietet unsere Lösung eine Konsolidierung der abzulegenden Informationen (Kontakte, Ereignisse, Aufgaben und Inhalt des Projektes) in einem einzigen Modul. Die Informationen liegen so zentral zusammengefasst an einem Ort und es können von dort aus auch direkt neue Elemente (Aufgaben, Ereignisse) zur jeweiligen Initiative angelegt werden. Auf diese Weise ist eine sinnvolle Verknüpfung der einzelnen Elemente bereits beim Erstellen der Initiative sichergestellt.\nFachliche Anforderung\nVerwendungszweck:\nDokumentation und Planung der Zusammenarbeit und Ziele der Zusammenarbeit mit dem Kunden",
  "business_value": {},
  "assignee": "Vera Palasukhina",
  "priority": "",
  "target_start": "",
  "target_end": "",
  "fix_versions": [],
  "acceptance_criteria": [],
  "components": [],
  "labels": [
    "MB_MF_T4"
  ],
  "realized_by": [],
  "child_issues": [],
  "attachments": [
    {
      "filename": "CSRM-Tool_MK_MockUp Initiative  Neue Variante.pptx",
      "url": "https://jira.telekom.de/secure/attachment/5367360/CSRM-Tool_MK_MockUp%20Initiative%20%20Neue%20Variante.pptx",
      "mime_type": "application/vnd.openxmlformats-officedocument.presentationml.presentation",
      "size": "",
      "date": "2025-02-04T15:35:52.948+01:00"
    }
  ]
}