{
  "key": "MAGBUS-101567",
  "issue_type": "Epic",
  "title": "KI@MF Standard Features (Inbetriebnahme von Funktionen innerhalb bestehender Lizenzen)",
  "status": "Closed",
  "description": "Description\nDie Standard Features Lead Scoring und Oppty Scoring sollen eingeschaltet werden.\nProblem Berechnung bei Salesforce in US\nThe Scoring Model Lead\nEinstein analyzes your past converted leads, including custom fields and activity data, to determine your conversion patterns. It then identifies which of your current leads have the most in common with your prior converted leads. Based on this analysis, Einstein builds one or more scoring models for your organization.\nDuring setup, Salesforce admins can choose to score all of your leads together, or group leads into segments based on field criteria. Einstein builds a separate scoring model for each lead segment. For each lead segment, admins can also choose to omit certain lead fields. When Einstein builds your scoring model, the omitted fields are ignored.\nWhen you score all leads together without creating segments, and you don’t have enough lead conversion data to build your own predictive model, Einstein uses a global model. The global model uses anonymous data from many Salesforce customers. When you accumulate enough lead data, Einstein builds a scoring model with your data and uses the model with the better results.\nEinstein models are refreshed every 10 days, or whenever the admin updates how Lead Scoring is configured. Lead scores are updated at least every six hours as needed.\n  The Scoring Model Oppty\nTo predict which opportunities are most likely to be won, Einstein analyzes your and your team’s past closed opportunities (both closed-won and closed-lost) to build a scoring model. The criteria used in the analysis includes the following.\nEach opportunity’s record details (both standard and custom fields), history, and related activities\nThe related account’s record details and some record history\nDetails about the related products, quotes, and price books\nDuring setup, Salesforce admins can choose whether to have Einstein consider all opportunity records and custom fields or only a subset. When Einstein builds the scoring model,\nthe omitted records and fields are ignored.\nIf you don’t have enough opportunity data to build your own predictive model, Einstein uses a global model. The global model uses anonymous data from many Salesforce customers. When you accumulate enough opportunity data, Einstein builds a scoring model with your data and uses the model with the better results.\nOnce a month, or whenever the admin updates the settings, Einstein reanalyzes the opportunity data and the model is refreshed. Opportunity scores are updated every few hours.\n    –\nBR-Freigabe offen\nPSA-Freigabe offen (nä. Termin am 28.01.)",
  "business_value": {},
  "assignee": "Matthias Johannes Hoffmann",
  "priority": "",
  "target_start": "",
  "target_end": "",
  "fix_versions": [],
  "acceptance_criteria": [],
  "components": [
    {
      "code": "MagentaForce",
      "title": "MagentaForce "
    }
  ],
  "labels": [
    "MB_MF",
    "MB_MF_T1",
    "MB_MF_T2"
  ],
  "realized_by": [],
  "child_issues": [],
  "attachments": []
}