{
  "key": "MAGBUS-92769",
  "issue_type": "Epic",
  "title": "MF: Bereitstellung Case API",
  "status": "Closed",
  "description": "Description\nDamit Work-Items aus DMS in MF verarbeitet werden können , wird dieses Epic benötigt.\nDiese Work-Items ( Scans, Fax von DMS für Festnetz und Enterprise Networks) die  zur Zeit an die IRRP übergeben werden, sollen zukünftig an MagentaForce übertragen werden.\nDie Work-Items werden dann automatisiert in MagentaForce in einen Case transformiert, der danach gezielt, an die jeweiligen Bearbeiter von Service GrK, zur weiteren Bearbeitung geroutet wird.\nZiel sollte sein, dass wir diese API so entwickeln, dass wir diese zukünftig für die Case Erstellung für andere Systeme auch zur Verfügung stellen können, wenn wir E-Mail2Case abschalten.\n  Daten zum übergebenen WI (siehe Seite 22ff. der Spezifikation von DMS):\n  API Feld Typ Länge Kommentar\nOrigin Text 32 Systemkenner: Herkunft des Vorgangs z.B. DMS\nMedium     Eingangsmedium des Items\nClass     Geschäftsfall oder Routingkategorie oder Sonstiges\nTransferReason     DMS setzt hier das Produktsegment oder den Defaultwert „Eingang“\nExternal_Item_ID     beim Systemkenner \"DMS\" ist dies die DocId\nContactFollowUpFlag     Zeigt an, ob in DMS ein Folgekontakt erkannt wurde 0 = kein Folgekontakt 1 = Folgekontakt\nInputChannel     Eingangskanal Fax: die vom Kunden ursprünglich angewählte Faxnummer Scan: die Dienstleisterkennung\nEntryDate     Eingangsdatum und Start Typisierung Brief: Scandatum Fax: Eingangszeit vom Faxserver \nPriority     Prio des Items aus dem Herkunft-Systems\nCustomerNumber     Kundennummer (z.B. CRMT-Kundennummer)\nContractPartnerNumber      \nOrderID      \n  Prüfungen, ob das WI in MF weiter verarbeitet oder abgewiesen wird:\nWenn die CustomerNumber (CRMT-Kundennummer) nicht mehr aktiv bzw. in MF nicht vorhanden ist, dann soll das WI abgewiesen werden:\nRückgabe DocId und Reason \"nicht relevant\".\nweitere Prüfungen tbd.\n  getCase bzw. updateCase wird von RPKNeu, EN (OREO) und EOS genutzt. Nachfolgend Details zu den Use Cases.\nRPKNeu:\nruft Case per SOSL-Search (LAN-OrdnungsNr) ab (Cases dazu liegen in der Auto-Queue) und ändert die Klasse, Transfergrund fürs Routing zu einem EN-MA\nEN (OREO):\nruft Cases ebenso per SOSL-Search ab und ändert entweder das Wiedervorlagedatum, den Wiedervorlagegrund, den Status oder die Beschreibung des Cases\nbei Änderung der Beschreibung des Cases informiert OREO den aktuellen Bearbeiter des Cases über diese Änderung. \nEOS:\nfragt Cases per CaseId ab und ändert den Status auf \"Geschlossen\". Weitere Daten Sync tbd.\nAblauf zum Prozess (via TARDIS) siehe Arbeitsstand vom 07.05.2024 im Anhang.\n  BR freigegeben am 31.01.2025",
  "business_value": {},
  "assignee": "Armin Steinmetz",
  "priority": "",
  "target_start": "",
  "target_end": "",
  "fix_versions": [
    "PI 27",
    "MF 4.500"
  ],
  "acceptance_criteria": [],
  "components": [
    {
      "code": "DMS",
      "title": "DMS "
    },
    {
      "code": "MagentaForce",
      "title": "MagentaForce "
    }
  ],
  "labels": [
    "MB_MF"
  ],
  "realized_by": [],
  "child_issues": [],
  "attachments": [
    {
      "filename": "AW_ Magenta Force_ hier_ Routingproblem bei KS-Supportaufträgen für EC-Produkte.msg",
      "url": "https://jira.telekom.de/secure/attachment/4728695/AW_%20Magenta%20Force_%20hier_%20Routingproblem%20bei%20KS-Supportauftr%C3%A4gen%20f%C3%BCr%20EC-Produkte.msg",
      "mime_type": "application/octet-stream",
      "size": "133 kB",
      "date": "2024-07-16T09:36:06.746+02:00"
    }
  ]
}