{
  "key": "MAGBUS-100674",
  "issue_type": "Epic",
  "title": "[Comet Crew] TKG VVI/VZF for NGMobile",
  "status": "Waiting",
  "description": "Description\nAs we cannot re-use the VVI/VZF feature of BSP or MBSP, we must recreate its business logic.\nAfter implementing the VVI/VZF Generator, we shall integrate it into the UI of the Checkout's Summary Page.\nA VVI/VZF PDF is generated for each tariff item in each package which the users can download in a ZIP file.\nThe user can enter an email address to which all VVI/VZF PDFs will be sent\nThe user is not obliged to view or accept the PDFs.\nFor each tariff item, the Communication Message ID (as reference to the PDF) is added to the MB2B order. The order management backends ensure that the PDF is archived in the DMS (via Pre-archive Document microservice). The VVI/VZF information becomes part of the contract.\nBackground information: What are VVI and VZF?\nTKG§54 requires that consumers are given the opportunity to read product details before agreeing to contracts: The product details are described in §54 TKG as Vorvertragliche Informationen (VVI, pre-contractual information) and Vertragszusammenfassung (VZF, contract summary).\nSmall companies have the right to see the same TKG§54 information. But unlike consumers, they can explicitly waive the TKG§54 information.\nThe TKG§54 document combines all legally required content in one PDF document. It describes the selected products with prices, the scope of services and possible technical constraints, general terms and conditions and price lists.\nAccording to TKG§54, the VVI/VZF information becomes part of the contract (unless the parties have explicitly agreed otherwise). If Telekom accepts the order and the order becomes a contract, the corresponding TKG§54 document must be archived.\nOn 23 August 2024, Ralf Prehn confirmed that the current approach with the forced waiver of VVI/VZF by a mandatory checkbox is TKG compliant for the GK-Portal (B2B web shop).\nReference: Relevant APIs\nVespa Pico Headless API\nhttps://developer.telekom.de/catalog/dth/dth-vespapico-headless-api/g_api/\nCommunication Management API\nhttps://developer.telekom.de/catalog/ccc/ccc-communicationManagement/g_api/\nDocument Management API\nhttps://developer.telekom.de/catalog/ccc/ccc-documentManagement/g_api/\nIn Carmen, each option has two technical identifiers: the \"ID\" and the \"Kennung\" (matchode). Vespa Pico Headless API is using the ID of the options whereas GKP seems to use the matchcode of the options.\nExample:\nOption name ID Matchcode\nHotSpot Inflight Europa Flat 3M 7885 WLANOPT7\nMBSP uses the old Carmen service Carmen:getProductStructure5 to read the option's ID (field baseProductNumber) for a given Matchcode.\nCurrently under investigation, whether a catalog REST service can be used from\nhttps://developer.telekom.de/catalog/digihu-mob/digihu-mob-csgoTMF620/g_api/production/1.0.1\nReference: Implementation by Kraken Team\nAs the TKG§54 document for MBSP is created within the CoreMedia part of MBSP/GKP (https://gitlab.devops.telekom.de/b2b-dtp/apps/gkp/gk-portal), their implementation cannot be re-used by us. But they offer to help us with their expertise on the TKG§54 document topic.\nThey retrieve content for tariffs and options using the Vespa Pico Headless API.\nThey create a Communication (= PDF document) with pre-contractual information and contract summary (VVI/VZF) using the Communication API from DMS team.\nThe mapping is described here: TMF681 request mapping description\nThey archive the created Communication using the Document Management API. For that, they implemented a Pre-archive Document (PAD) service. This microservice could be used by any other project.\nThe archiving solution is described here: 2. Archiving VVI/VZF\nTheir documentation for the Pre-archive Document microservice: Pre Archive Document\nReference: Example from MBSP test environment\nA new order with device is configured in MBSP.\nOn the last page of the MBSP checkout, a PDF document \"Vorvertragliche Pflichtinformationen.pdf\" is created.\nFor a screenshot of this page, see attached MBSP_TA_Screenshot.png.\nFor the API calls to Vespa Pico Headless API and Communication API, see attached MBSP_TA_Tracing.txt.\nFor the created PDF document, see attached MBSP_TA_Vorvertragliche Pflichtinformationen.pdf.",
  "business_value": {},
  "assignee": "Peter Max Messelken",
  "priority": "",
  "target_start": "",
  "target_end": "",
  "fix_versions": [
    "PI 27"
  ],
  "acceptance_criteria": [],
  "components": [],
  "labels": [
    "MB_Comet",
    "MB_checked"
  ],
  "realized_by": [],
  "child_issues": [],
  "attachments": [
    {
      "filename": "AW_ VVI_VZF for GKP Checkout .msg",
      "url": "https://jira.telekom.de/secure/attachment/5197518/AW_%20VVI_VZF%20for%20GKP%20Checkout%20.msg",
      "mime_type": "application/octet-stream",
      "size": "231 kB",
      "date": "2024-12-05T14:56:39.599+01:00"
    },
    {
      "filename": "MBSP_TA_Screenshot.png",
      "url": "https://jira.telekom.de/secure/attachment/5197519/MBSP_TA_Screenshot.png",
      "mime_type": "image/png",
      "size": "371 kB",
      "date": "2024-12-05T14:56:39.612+01:00"
    },
    {
      "filename": "MBSP_TA_Tracing.txt",
      "url": "https://jira.telekom.de/secure/attachment/5197520/MBSP_TA_Tracing.txt",
      "mime_type": "text/plain",
      "size": "1.34 MB",
      "date": "2024-12-05T14:56:39.621+01:00"
    },
    {
      "filename": "MBSP_TA_Vorvertragliche Pflichtinformationen.pdf",
      "url": "https://jira.telekom.de/secure/attachment/5197521/MBSP_TA_Vorvertragliche%20Pflichtinformationen.pdf",
      "mime_type": "application/pdf",
      "size": "1004 kB",
      "date": "2024-12-05T14:56:39.627+01:00"
    }
  ]
}