{
  "key": "MAGBUS-99782",
  "issue_type": "Portfolio Epic",
  "title": "New Mobile Business Order Process - Product Catalog Q1",
  "status": "In Progress",
  "description": "Description\nFor an internal user\nwho wants to create a new mobile contract on behalf of the customer\nthe new product catalog at “xbsp”\nis a enabler to present DTAG’s Mobile Business Portfolio (tariffs, devices & accessories) within the new frontend\nthat provides the right products (Eligibility), the correct prices (Pricing), Up- and Crosselling-Capabilitys and different kinds of Recommendation. The product catalog contains all relevant information to enable product selection and configuration as well as transfer to the shopping cart.\nUnlike todays solution like BSP or CARMEN\nour solution can provide all necessary information and no additional system is needed to find the correct product.\n  In the first step, the requirements only apply to new customers without a device.\nEntry for internal roles via BSP with manual search for customer data, e.g. customer number and customer account number. This step should no longer be visible to the end customer as part of the order process.\n  Mobile B2B tariffs:\nThe user can starts the process using customer data via the Quickfinder.\nThe user can filter the displayed tariffs by framework contracts (RV), by minimum duration (…, 12, 24, 36 months), by data volume, for voice or data tariffs and for subcontract tariffs (BusinessCards, CombiCards) via direct access\nIf the user wants to select an other customer number and/or RV the user must do another search in the Quickfinder.\nIf old tariffs are marked as legacy (e.g. by Commercial Management), those legacy tariffs are shown in a separate area. Focus must be on new tariffs and the tariffs used by the customer (according to the customer's assets).\nFor the future, it should be possible to define an upgrade path between tariff generations, so that a switch to the new 5th generation can be recommended for existing assets from the 3rd generation of Business Mobil.\nBuild two tabs for the internal role:\n1. tariffs most ordered by customer: The 4 most used tariffs are displayed in descending order of use.\n2. tariff recommendation: This allows a sales-friendly presentation of current tariff generations. There can be up to 5 tiles per tariff generation. The sequence of tiles (e.g. S-M-L-XL) and a highlighted tile as a recommendation (e.g. Business Mobil L) can be maintained by an Editor.\nThe initial layout of the tariff offer must be like geschaeftskunden.telekom.de, but in the first step only with the option to order \"Tarif ohne Handy\" - Update will come from Theresa\nIt is important, that the full technical name of the tariff is shown bigger than here - Update will come from Theresa\nPromotion campaign: Show promotion campaign with mobile phone and end date of the promotion as a recommendation.\nFor the end customer view, create two tabs:\nMost ordered by customer (this can include old tariffs)\nNew portfolio (new tariffs with focus on Business Mobile L)\nCustomers will see legacy tariffs less prominently in a \"More tariffs\" area. Only when the user clicks on \"More tariffs\" will they be offered.\nSimilar to internal users, customers can filter the tariffs based on various criteria.\nThe tariffs conditions are always connected to customer number and RV.\nPromotion campaign:\nShow promotion campaign with mobile phone and end date of the promotion as a recommendation.\nOptions:\nThe Options Selection page can be reached from the \"Bestellung konfigurieren\" page (BKP).\nThe \"Bestellung konfigurieren\" page follows the tariff page.\nIt is not mandatory to go to the Options Selection page if the user accepts the default configuration and goes directly from the \"Bestellung konfigurieren\" page to the \"xy which one is that\" page.\nBut the user must be informed on the BKP which options are selected together with the tariff. Initially only the default options are selected. Example: The new option Security OnNet Basic is default, but it can cause problems in certain scenarios, so the user can deselect it.\nThe default configuration of a tariff is defined in Carmen and Nepal-POM. For RVs whose number starts with S, the inclusive options provided by the NeMo Tool are used as default configuration.\n*The \"Bestellung konfigurieren\" page (BKP) shows which options are selected and which of them are free and which of the them are paid, i.e. they have an monthly recurring charge (MRC) or a one-time charge (OTC).\nFrom the BKP, the user can navigate to two variants of the Option Selection page.\nIf the user clicks on the \"Kostenlose Optionen\" button, the Option Selection Page will be filtered to show only free options. The user can select or deselect free options.\nIf the user clicks on the \"Alle Optionen\" button, the Option Selection Page will show all options: free and paid.\nWith the \"Kostenlose Optionen\" filter: If a free option is in an alternative group with at least one paid option, a button \"Kostenpflichtige Alternativen anzeigen\" will be displayed next to the free option that links to that alternative group in the unfiltered Option Selection page.\nThe options are grouped in categories.\nOn the top of the page, the categories are shown as filter criteria. If the user clicks on a category name, the page is filtered by the selection.\nThe options can be configured to have additional content like showing how many MultiSIMs are free with the tariff.\nDue to the amount of options, only those that have been defined as main options in the product administration are shown at first. If the user clicks on a button \"Alternativen anzeigen\", more options appear in each category.\nRegardless of whether it is a main option or not, any selected option will always be displayed.\nNote: Many options are offered with different durations. We show the one that has a duration of 1 month because this one is booked mostly.\nIt must be configurable by an Editor which options we show or hide by flagging options as main options.\nThe user can options can select or deselect options.\nThe user can search for options by name.\nOn the right-hand side of the page we show a \"Preisübersicht\" which updates automatically after user's selection.\nThe user clicks \"Übernehmen\" when the option selection is done and navigates back to the BKP. The user can go back to the BKP without changing anything.\nEspecially for MultiSIM and DataPlus options (other options to be added), we should suggest an alternative product, i.e. the customer could buy a higher-quality tariff where the MultiSIM or the additional data volume would be already included.\nOpen:\nIs it required to recommend options?",
  "business_value": {},
  "assignee": "Susan Neßlinger",
  "priority": "",
  "target_start": "",
  "target_end": "2025-12-31",
  "fix_versions": [
    "Q1_25"
  ],
  "acceptance_criteria": [],
  "components": [
    {
      "code": "C14",
      "title": "C14 "
    }
  ],
  "labels": [
    "GK_Kundencenter",
    "Roadmap.2025.VSDT"
  ],
  "realized_by": [
    {
      "key": "MAGBUS-100521",
      "title": "MAGBUS-100521",
      "summary": "[NEPAL] Expose all available Product Base Data",
      "url": "https://jira.telekom.de/browse/MAGBUS-100521",
      "relation_type": "realized_by"
    },
    {
      "key": "MAGBUS-99783",
      "title": "MAGBUS-99783",
      "summary": "Product Catalog Eligibility",
      "url": "https://jira.telekom.de/browse/MAGBUS-99783",
      "relation_type": "child"
    },
    {
      "key": "MAGBUS-99792",
      "title": "MAGBUS-99792",
      "summary": "Product Catalog Pricing",
      "url": "https://jira.telekom.de/browse/MAGBUS-99792",
      "relation_type": "child"
    },
    {
      "key": "MAGBUS-99796",
      "title": "MAGBUS-99796",
      "summary": "Product Catalog Cross- and Upselling",
      "url": "https://jira.telekom.de/browse/MAGBUS-99796",
      "relation_type": "child"
    },
    {
      "key": "MAGBUS-99798",
      "title": "MAGBUS-99798",
      "summary": "Product Catalog Recommendation",
      "url": "https://jira.telekom.de/browse/MAGBUS-99798",
      "relation_type": "child"
    },
    {
      "key": "MAGBUS-99800",
      "title": "MAGBUS-99800",
      "summary": "Product Catalog Presentation",
      "url": "https://jira.telekom.de/browse/MAGBUS-99800",
      "relation_type": "child"
    },
    {
      "key": "MAGBUS-99804",
      "title": "MAGBUS-99804",
      "summary": "Product Catalog Structure & Navigation",
      "url": "https://jira.telekom.de/browse/MAGBUS-99804",
      "relation_type": "child"
    }
  ],
  "child_issues": [],
  "attachments": [
    {
      "filename": "image-2024-11-15-10-15-58-433.png",
      "url": "https://jira.telekom.de/secure/attachment/5133457/image-2024-11-15-10-15-58-433.png",
      "mime_type": "image/png",
      "size": "64 kB",
      "date": "2024-11-15T10:15:58.818+01:00"
    },
    {
      "filename": "image-2024-11-18-10-04-14-933.png",
      "url": "https://jira.telekom.de/secure/attachment/5137465/image-2024-11-18-10-04-14-933.png",
      "mime_type": "image/png",
      "size": "64 kB",
      "date": "2024-11-18T10:04:15.159+01:00"
    },
    {
      "filename": "screenshot-1.png",
      "url": "https://jira.telekom.de/secure/attachment/5371505/screenshot-1.png",
      "mime_type": "image/png",
      "size": "37 kB",
      "date": "2025-02-05T13:43:46.185+01:00"
    }
  ]
}