{
  "key": "NGO-12401",
  "issue_type": "Epic",
  "title": "[SD-(W)LAN 1.0] Design MVP material for SD-X billing process",
  "status": "Closed",
  "description": "Description\nSD W/LAN Juniper reichert das Portfolio von SD WAN Juniper um LAN- und WLAN-Komponenten an. Es handelt sich jedoch um ein eigenständiges Produkt, dass nur mittels loser Kopplung in gemeinsame Angebote, Aufträge und Verträge mit SD WAN integriert werden soll. Die Abrechnung des Einzelproduktes außerhalb von Rahmenverträgen soll mit einer separaten SAP-BRIM-Rechnung erfolgen.\n\nBusiness Scope:\nAls Produktmanager möchte ich ein neues SD LAN / WLAN Juniper Portfolio auf der neuen SD-X Kette etablieren, um in Verbindung mit SD WAN Juniper ein gesamthaftes SD Portfolio auf der SD-X Kette zu etablieren und damit die Wettbewerbsfähigkeit steigern.",
  "business_value": {},
  "assignee": "Rene Werther",
  "priority": "",
  "target_start": "2022-10-20",
  "target_end": "2022-11-02",
  "fix_versions": [],
  "acceptance_criteria": [
    "Die zusätzlich benötigten billingrelevanten Materialien des SD W/LAN Juniper MVP sind in SAP BRIM angelegt.",
    "Die angelegten Materialien entsprechen der PRIMA+ Abbildung.",
    "Die Materialien enthalten PRIMA+ Materialnummer und Konditions-ID.",
    "Die Materialien sind für die Nutzung im SD-X Prozess konfiguriert.",
    "An den Materialien sind der Standard Charge Plan und der Charge Plan für die manuelle Leistungsrückmeldung verknüpft.",
    "Die SD W/LAN-MVP-Materialien können sowohl als zubuchbare Leistung zu SD-X genutzt werden.",
    "Die SD W/LAN-MVP-Materialien können als eigenständiges Hauptprodukt verwendet werden.",
    "Die SD W/LAN-MVP-Materialien können zukünftigen SD-Produkten als Zubuchleistung zugeordnet werden."
  ],
  "components": [
    {
      "code": "CC",
      "title": "CC "
    },
    {
      "code": "CI",
      "title": "CI "
    },
    {
      "code": "CRM",
      "title": "CRM "
    }
  ],
  "labels": [
    "Hub_DOM",
    "Hub_OMS",
    "OKR_Q4_Rechnungsgenerierung_für_SD_LAN/WLAN",
    "SAP_AK_OK",
    "SDLA_VS_Billing&Contract_Mgmt",
    "SDLA_immature",
    "SDx",
    "§63nein"
  ],
  "realized_by": [],
  "child_issues": [],
  "attachments": []
}