{
  "key": "SDN-22913",
  "issue_type": "Initiative",
  "title": "IT Enabler Integration FTTH and FIB Tool into our architecture",
  "status": "Closed",
  "description": "Description\nDescription to define the depend IT Enabler for the realated Business Feature, to build up the architectual runway.\n  More details for the FIB-tool can be found in myWiki:\nmyWiki: FIB-Tool\n  IT-Enabler requirements splitted into the 3 domains and teams within the SDX Platform team:\n  Application Managment & Compliance (St, Rebig, G. Plonus)\nPanda: FIB-tool: Clarify the request to have a separate ICTO-No, for the FIB-tool\nCompliance: a. ) Initiate and follow up the PSA-Process (PSI (PSA System Inventory) und PSA-Portal)\n                     b.) Clarify and reach the worker council approval (when needed)\n                     c.) Clarify the IRON Demand, (when needed)\n  ServiceNow: (Kreitenmeyer, Andreas  , Michaela Vymazal Nickelova )\nClarify and implement changes in POM interface (asynch. communication, etc) \n\"Tardis asnch. communication via Horizon for POM in as skellet available\"\nClarify and implement new SAP BRIM interface (ongoing, issues with internet communication)\nExplore, clarify and prepare further new FTTH Interfaces, like DigiOSS (Gigabit) & Sputnik, WMS-TK & WFM-T etc,\nimplementation for 2nd half year 2025 expected.\n(\"2 FTTH interfaces announced, team Brainstormers to involve\")\n  Panda: (H. Vlaminck)\nSupport FIB Tool infrastructure set up on CaaS  and prepare the needed CI/CD pipelines  (e.g for UAT, Prod and further namespaces, PostgreSQL DbaaS instances), \"DEV & EAT infrastructure prepared and ready so far, but under Panda ICTO-No\" (spilt need to be possible, as we have diff. user's like \"Service Mngt and Vertrieb\")\nSupport the go live of the interim solution in SAP CPQ implemented\nSupport the MockUp implementation, when needed\nSetup separate CaaS Project, namespace and PostgreSQL DbaaS instances, under sep. ICTO-No, when needed\nImpove the CI/CD Deployment pipelines and repositories\nConsider Multiple Microservices for FIB-tool  (follow step by step implementation by Vega Dev team)\nConsider the Non-functional requirements (e.g. Upload von Standorten in 10 Sec/1 min, \"Verfügbarkeits-/Interessentenabfragen\",\n\"Bedarfsanmeldung\" (see myWiki FIB-tool)\nSupport Architecture for locations service for Panda and rollout-tool (FIB-tool)\nSupport with new FIB-tool interface/API's (which API's, docu, interface partners,...)\nSupport to enable \"tech. POM interface\" with asynch. communication (Tardis Horizon)\n  Further hints from Sys.Architect (C. Jupitz to consider):\n\"...Challenges in the PANDA ecosystem:\nIntegration of login – will be done analogous to the B2B OC\nThe PreOrder@Cloud – we target to re-use the existing approach of SAP CPQ and the corresponding microservice\nDual use of the “Master Data Management Module (MDMM)” from both Panda and FIB.\nThe last one is the main challenge, but to be solved between Panda and FIB system architecture - which are, currently, both my domains....!\n  Exploration results for new FTTH Interfaces (from Q3, M. Kecsey):\nhttps://wiki.telekom.de/display/SDE2E/FTTH+Interfaces\n  Furter relevant informations see also the  Initial Busienss Feature description (state 30. Nov. 24)\nImplementation\nFurther requirements for the FIB (Fiber infrastructure build) tool, which should be realized in Q1/part will be descripted here:\ninterface to PreOrder@Cloud\n(details and open topics about interface requirements see https://wiki.telekom.de/display/B2BSOM/Schnittstelle+PreOrder+at+Cloud )\ninterface to POM (reuse and switch from FTTH Interims solution)\n(general information see https://wiki.telekom.de/pages/viewpage.action?pageId=2408757208 )\nfurther Usability of the FIB-GUI\nPlanning/preparation of retirement of \"FTTH Interimslösung Interessentenerfassung\" \nfinalization of FIB-Tool Excel-Import Sheet\nmigration of location data from Panda-DB to FIB-Tool area\nBusiness Analysis (done by Thomas H.)\ninterfaces to GIGA GS (to be defined)\nRealisation on GIGA-side is roughly planned for second year 2025, solution design should start beginning of 2025\npossible interface to SGrk Parkhaus (to be discussed and defined)\nclarification about needed HTN or similar information (e.g. \"Gestattung\") to find out, if interface to LandLord-Portal is needed\n  Link:\nSDN-22480FTTH_FIB-Tool concept and implementation further requirements (Q1/25)\n ",
  "business_value": {},
  "assignee": "Heinrich Vlaminck",
  "priority": "",
  "target_start": "2025-01-16",
  "target_end": "2025-04-09",
  "fix_versions": [
    "Q1_25"
  ],
  "acceptance_criteria": [
    "FIB-Tool-GUI",
    "Concept FIB-Tool is available and logon via Panda microservices is possible\nGUI functionality is similar to Panda location solution available\nButton and functionality for manual upload of location data to POM is available\nButton and functionality for manual update of marked location with PreOrder@Cloud date is available\n...\ninterface to PreOrder@Cloud (via TMF645)",
    "Concept FIB-Tool is available and logon via Panda microservices is possible",
    "GUI functionality is similar to Panda location solution available",
    "Button and functionality for manual upload of location data to POM is available",
    "Button and functionality for manual update of marked location with PreOrder@Cloud date is available",
    "...\ninterface to PreOrder@Cloud (via TMF645)",
    "all requested attributes will be imported into the FIB-Tool übernommen\n(details see https://wiki.telekom.de/display/B2BSOM/Schnittstelle+PreOrder+at+Cloud)\nwhen location data via Excel are imported into the FIB-Tool or when data in the GUI are added/corrected, an automatic update from PreOrder@Cloud will be done\nlocation could be marked in the GUI and via button there is a manuell data update possible\nif there is an location update from POM-interface belonging data records will be also automatically updated via PreOrder@cloud interface\n...\n interface to POM for FIB-Tool (replacement of FTTH  interim solution)",
    "all requested attributes will be imported into the FIB-Tool übernommen\n(details see https://wiki.telekom.de/display/B2BSOM/Schnittstelle+PreOrder+at+Cloud)",
    "when location data via Excel are imported into the FIB-Tool or when data in the GUI are added/corrected, an automatic update from PreOrder@Cloud will be done",
    "location could be marked in the GUI and via button there is a manuell data update possible",
    "if there is an location update from POM-interface belonging data records will be also automatically updated via PreOrder@cloud interface",
    "...\n interface to POM for FIB-Tool (replacement of FTTH  interim solution)",
    "location data can be uploaded via FIB-Tool Excelformat to POM\nconcept for POM reverse interface is connected to FIB Tool to get the results into FIB-DB\ndaily updates from POM will be marked / shown in the GUI\n...",
    "location data can be uploaded via FIB-Tool Excelformat to POM",
    "concept for POM reverse interface is connected to FIB Tool to get the results into FIB-DB",
    "daily updates from POM will be marked / shown in the GUI",
    "..."
  ],
  "components": [
    {
      "code": "DOM0204",
      "title": "DOM0204 SD X"
    }
  ],
  "labels": [
    "DOM0204",
    "FTTH_by_LE",
    "SNP_ST_ServR_Information_Security_Management"
  ],
  "realized_by": [
    {
      "key": "SDN-23176",
      "title": "SDN-23176",
      "summary": "[SysPipeliners] Build Up Infrastructure for new FIB tools microservices (Q1/25) PI 25.1",
      "url": "https://jira.telekom.de/browse/SDN-23176",
      "relation_type": "realized_by"
    },
    {
      "key": "SDN-23065",
      "title": "SDN-23065",
      "summary": "[SysNow] Preparation of Interfaces needed for Q1",
      "url": "https://jira.telekom.de/browse/SDN-23065",
      "relation_type": "realized_by"
    }
  ],
  "child_issues": [],
  "attachments": []
}