{
  "key": "SDN-26056",
  "issue_type": "Epic",
  "title": "FIB: BUT Support and Golive",
  "status": "Funnel",
  "description": "Description\nThe FIB tool will go live with the following requirements: \nAdd locations via Excel/ manually\nEdit locations via Excel/ manually\nRequest KLS ID for German locations\nRequest FTTH Availability on initial KLS response\nManually request FTTH Availability\nAdd locations (state not planned/ area planned) to Interested Parties Database\nReceive update from Interested Parties Database and request availability\nIntegration with PANDA: \nreach FIB from PANDA \nAdd locations to project in FIB and use them in PANDA quotes\nHandover of requested location data to PANDA (FTTH status...)\nAdd locations automatically from PANDA to FIB that are added to the project otherwise\n  Currently not clear and therefore not committed for Golive:\nreqest GFTAs per GFAP \nInterface for STandardbauweise (TMF-641)\nno automatic regular update of FTTH data\n  Todos\nPrep Golive with requirements mentioned above\nPrep SDSK (with Security and Privacy Champion of the Value Stream) -> Stefan\nWorkers' Counsil Approval -> Angelo\nPSA Approval -> Stefan\nPrep Testcases \nPrep Performance Testcases\nPerformancetests \nInterface Agreements ready\nTechPOM --> enhance agreement with event mechanism, adjust mandatory fields for sending data\nKLS GAM --> no agreement necessary as published interface\nPreorder@Cloud --> no agreement necessary as published interface (TMF645)  \nUAT Deployment including\nIntegration with GAM\nIntegration with Preorder@Cloud\nIntegration with TechPOM\nall relevant interfaces are integrated via TARDIS\nlater (after migration test): Integration with PANDA\nMigration test on UAT --> see https://wiki.telekom.de/x/Zorerg \nAlign Rolloutplan including migration from CPQ \nAlign on BUT testphase and testmeetings\n  Prerequisites\nTestdata to be aligned on basis of KLS and with Preorder@Cloud\nBusiness Users for the BUT \n \n \n    DOR Status Comment\nAcceptance criteria are defined.    \nThe Epics is approved by system architects (done on Epic level). The appoval was done in develpoment circles with subject matter experts    \nThe Epics is prioritized within the backlog (WSJF Method)    \nThe Epics are understood by Dev Teams and estimated     \nThe Epics are documented within JIRA    \nDependencies are identified and there are no external dependencies that can´t be solved within the ART    \nNon-functional requirements (NFR) are identified.    \nSecurity and privacy approval required User Stories are labelled as those. Primary in the acording Jira Parameter     \nInitial high-level acceptance test cases written and reviewed by PO test cases we aggreed later on    \nAll the information relevant to development is linked: other stories, relevant designs, confluence sources of information, other specs    \nGUI Views have been defined (in form of click-dummy) and discussed with users for implementation    \nProcess dependency / adaptations has been defined    \n\nBusiness Scope:\nAs a business epic owner I want the FIB tool to be rolled out to PROD with the aligned functionality",
  "business_value": {},
  "assignee": "Patricia Glöß",
  "priority": "",
  "target_start": "2025-04-10",
  "target_end": "2025-07-02",
  "fix_versions": [],
  "acceptance_criteria": [
    "The FIB tool is deployed in UAT and ready to be tested",
    "A migration test in done in UAT",
    "Interface Agreements are up to date and ready to be signed",
    "Testcases are in place to support the BUT",
    "Approvals (Workers' Council, SDSK) are done",
    "a rolloutplan is ready to be executed in July including migration from CPQ"
  ],
  "components": [],
  "labels": [
    "FTTH_by_LE"
  ],
  "realized_by": [],
  "child_issues": [],
  "attachments": []
}