{
  "key": "SDN-20534",
  "issue_type": "Epic",
  "title": "FIB: start with the basics",
  "status": "Closed",
  "description": "Description\nBusiness Requirements\n1. Location Database\nLocations are stored in a databse, which can be retrieved by retrieving the FIB Tool for that customer.\nLocations from the database can be selected and added to a project. Opening FIB again according to a project, the selected custoer locations to that project are opened\nLink for Data within database: https://telekom.sharepoint.de/:x:/r/sites/B2B_OfferManagementSolution_all/_layouts/15/Doc.aspx?sourcedoc=%7B4B85D3F7-9485-4DFD-A83F-E1C68A14985B%7D&file=FIB%20Tool%20Daten.xlsx&action=default&mobileredirect=true\n  2. Adding customer locations in FIB\nCustomer locations in FIB can be added the following way:\n2.1 manuall\nincrementell: locations can be added manual via an incremental enter. FIB always suggest valid locations on the Basis of KLS data, see example screenshot:\nKLS Search: locations can be added manual via entering a KLS ID. FIB shows the valid Location of KLS, see screenshot:\nfree text search: Locations can be added via a free text search of adress data. FIB shows the valid location of KLS, see screenshot:\n2.2 Excel Down/Upload:\nLocations can be added by downloading an empty excel template. The location data can then be added by the user within the Excel template and uploaded into the FIB system.\nExcel template for the download can be found here: https://telekom.sharepoint.de/:x:/r/sites/B2B_OfferManagementSolution_all/_layouts/15/Doc.aspx?sourcedoc=%7B4B85D3F7-9485-4DFD-A83F-E1C68A14985B%7D&file=FIB%20Tool%20Daten.xlsx&action=default&mobileredirect=true)\n2.3 Check of Dublettes:\nAdded locations are checked for dublettes.\nA location is a dublette if following information are already available in the database: \nCountry* ZIPCode* City* Locality Street* No* NoExtension Gebäude Etage Raum AGP/GP ID\nworkflow for dublettes for user is implemented: UX Design link\n  3. KLS Validation for national Locations (DE)\nwhen national locations are added, a KLS validation is done. \nThe KLS data (KLS ID, ONKZ, ASB, Google Maps)  is added automatically accordingly when a location can be found.\nThe KLS Data is always read-only and not changeable for the user.\nWhen locations are added uploaded, the KLS validation is done via the upload. If a national cannot be found within KLS, the location is added at the top of the location list (red) (suggestion function for valid KLS location will come in Q1).\nThis way we assure that only valid national locations are added in FIB.\nSome adresses have missing Geo-Data within KLS (appr. 1mio adresses), especially geo-data and ASB. FIB allows to add also locations with missing KLS-data, but will show these in the GUI:\n  4. Excel Download\nin order to also use the data for other products /configurations, users can download an excel template of existing locations and data from the FIB Tool.\nThe excel Download will be identical as the excel upload, but including all data from FIB of the customer \n  5. Edit locations\nonce a location is added to the database, non location data can be edited in FIB via an edit button   . If the user is editign a location inside FIB, the Pop-up for entering a location is opened.\nFollowing adress data can not be edited (read-only): \nFIB Site ID Country* ZIPCode* City* Locality Street* No* NoExtension Gebäude Etage Raum AGP/GP ID\nReason for this, is that the system will generate a FIB site ID for a specific adress. \nIf another adress wants to be added, the user can always add a new location.\n  6. Usability Functions (filter, customize function){}\nthe location table can be customized to a user specific demand:\nThe location table can be filtered, single and mass filter is possible\n  7. FIB Site ID\neach location is getting a FIB Site ID generated automatically by the system. This is a numerical number, one-to-one for that specific location. The FIB site ID cannot be changed by the user.\nout-of-scope in first MVP\nno Public and Classified customers with extra security requirements \nno access for Offshore colleauges\nno Geo-customers\nExpand \"Standardbauweise\" for GK-customer\nWholebuy  \nFIB Stand alone          \nSelf.Service\nIntegration IKLE\n  Additional reqirements:\nDescribe a way to use locations in the Quote List for CPQ configurators (Implementation Q1/25) \nDescribe a way to do a initial takeover of existing data from CPQ to the new Microservice \nDescribe a way to add locations to the quote location list from quotes imported from RPK, Underlay Services and Excel upload (interface?) \n  CPQ Sources will be put here: CPQ Sourcen \nFDS: https://wiki.telekom.de/pages/viewpage.action?pageId=1400927155 \nTestcases: https://jira.telekom.de/secure/XrayTestRepositoryAction!default.jspa?entityKey=SDN&path=CPQ%20TC%20Panda%20Project%2FGeneral%20Locations  (need to be adjusted)\nWiki: https://wiki.telekom.de/x/x4uBj \nCurrent tests:O2B: https://jira.telekom.de/secure/XrayTestRepositoryAction!default.jspa?entityKey=SDN&path=CPQ%20TC%20Panda%20Project%2FGeneral%20Locations (adjustments needed as table structure is completely different) \n  Backlog\nBuild central location database for FIB to store customer's locations:\nCustomer's locations are stored according to a customer AGP/GP ID\nLocations in the database per customer can be viewed and added to a FIB project/offer\nCustomer's locations are shown according to a quote/oppty (if already set up)\nLocations can be added by the user in a fronted:\nmanually (via incrementell, KLS search or free text search)\nexcel Upload\nFor national Site a KLS validation is done. The KLS data (KLS ID, ONKZ, ASB, Google Maps) is added accordingly. When locations are added uploaded, the KLS validation is done via the upload. If a national cannot be found within KLS, the location is added at the top of the location list (red)\nExcel Download of existing FIB Data can be done\nAdded locations are checked for dublettes. A location is a dublette if following information are already available in the database.\nattributes of uploaded locations can be edited\nFilter and customize function is implemented on the GUI for FIB usability purpose\nDOR Status Comment\nAcceptance criteria are defined.    \nThe Epics is approved by system architects (done on Epic level). The appoval was done in develpoment circles with subject matter experts    \nThe Epics is prioritized within the backlog (WSJF Method)    \nThe Epics are understood by Dev Teams and estimated     \nThe Epics are documented within JIRA    \nDependencies are identified and there are no external dependencies that can´t be solved within the ART    \nNon-functional requirements (NFR) are identified.    \nSecurity and privacy approval required User Stories are labelled as those. Primary in the acording Jira Parameter     \nInitial high-level acceptance test cases written and reviewed by PO test cases we aggreed later on    \nAll the information relevant to development is linked: other stories, relevant designs, confluence sources of information, other specs    \nGUI Views have been defined (in form of click-dummy) and discussed with users for implementation    \nProcess dependency / adaptations has been defined    \nOverall sequence diagram: https://wiki.telekom.de/pages/viewpage.action?spaceKey=B2BSOM&title=PBI+Process+Flow\n \n\nBusiness Scope:\nAs a user of the Solution Business, I need a infrastructure workflow tool in order to check my site specific infrastructure availability.\nFIB shell be used especially for our L and XL customers.\nThe infrastructure workflow Tool (FIB) shell support:\n- FIB supports the overall process for large customers for infrastructure expansion with fiber optics\n1: request fibe availability status\n2: Entry in technik database of interested parties\n3: Order removal, comply with HTN if necessary\n4: Order additional GT-TAs if necessary\n5: Order notifications/updates\n- FIB is a project management / rollout management tool with a focus on address and location mgmt for larger customers/many locations\n- FIB integrates into the existing application landscape and does not replace it (shell be possible to integrate from many systems, SAP CPQ; customer portal, Salesforce etc.)",
  "business_value": {},
  "assignee": "Patricia Glöß",
  "priority": "",
  "target_start": "2024-10-17",
  "target_end": "2025-01-08",
  "fix_versions": [
    "Q4_24"
  ],
  "acceptance_criteria": [
    "Build central location database for FIB to store customer's locations:\nCustomer's locations are stored according to a customer AGP/GP ID",
    "Customer's locations are stored according to a customer AGP/GP ID",
    "Locations in the database per customer can be viewed and added to a FIB project/offer \nCustomer's locations are shown according to a quote/oppty (if already set up)",
    "Customer's locations are shown according to a quote/oppty (if already set up)",
    "Locations can be added by the user in a fronted:\nmanually (via incrementell, KLS search or free text search)\nexcel Upload",
    "manually (via incrementell, KLS search or free text search)",
    "excel Upload",
    "For national Site a KLS validation is done. The KLS data (KLS ID, ONKZ, ASB, Google Maps)  is added accordingly. When locations are added uploaded, the KLS validation is done via the upload. If a national cannot be found within KLS, the location is added at the top of the location list (red)",
    "Excel Download of existing FIB Data can be done",
    "Added locations are checked for dublettes. A location is a dublette if following information are already available in the database.",
    "attributes of uploaded locations can be edited",
    "Filter and customize function is implemented on the GUI for FIB usability purpose",
    "0-100 locations - Upload 10 seconds",
    "100-1000 locations - Upload 1 Minutes",
    "1000-5.000 locations -  Upload 2 Minutes",
    "5000-10000 locations - Upload 3 Minutes",
    "10.000-15.000 locations -  Upload 5 Minutes"
  ],
  "components": [
    {
      "code": "SDN_O2B",
      "title": "SDN_O2B ValueStream Offer to Order"
    }
  ],
  "labels": [
    "FTTH_by_LE",
    "SDLA_VS_Configuration&Offer",
    "UX_Design"
  ],
  "realized_by": [],
  "child_issues": [],
  "attachments": [
    {
      "filename": "image-2024-09-05-08-39-51-120.png",
      "url": "https://jira.telekom.de/secure/attachment/4883536/image-2024-09-05-08-39-51-120.png",
      "mime_type": "image/png",
      "size": "51 kB",
      "date": "2024-09-05T08:39:51.287+02:00"
    },
    {
      "filename": "image-2024-09-05-08-40-35-227.png",
      "url": "https://jira.telekom.de/secure/attachment/4883537/image-2024-09-05-08-40-35-227.png",
      "mime_type": "image/png",
      "size": "32 kB",
      "date": "2024-09-05T08:40:36.008+02:00"
    },
    {
      "filename": "image-2024-09-05-08-40-54-985.png",
      "url": "https://jira.telekom.de/secure/attachment/4883538/image-2024-09-05-08-40-54-985.png",
      "mime_type": "image/png",
      "size": "40 kB",
      "date": "2024-09-05T08:40:55.112+02:00"
    },
    {
      "filename": "image-2024-09-05-08-41-13-311.png",
      "url": "https://jira.telekom.de/secure/attachment/4883539/image-2024-09-05-08-41-13-311.png",
      "mime_type": "image/png",
      "size": "45 kB",
      "date": "2024-09-05T08:41:13.469+02:00"
    },
    {
      "filename": "image-2024-09-05-08-41-39-200.png",
      "url": "https://jira.telekom.de/secure/attachment/4883540/image-2024-09-05-08-41-39-200.png",
      "mime_type": "image/png",
      "size": "65 kB",
      "date": "2024-09-05T08:41:39.364+02:00"
    },
    {
      "filename": "image-2024-09-05-08-42-32-849.png",
      "url": "https://jira.telekom.de/secure/attachment/4883541/image-2024-09-05-08-42-32-849.png",
      "mime_type": "image/png",
      "size": "24 kB",
      "date": "2024-09-05T08:42:33.009+02:00"
    }
  ]
}