{
  "key": "SDN-22284",
  "issue_type": "Epic",
  "title": "FIB: Usability Features",
  "status": "Closed",
  "description": "Description\nThe workflow in FIB should be supported by usability features.\n  Currently we are concentrating on the Workflow for the Golive. This consists of:\nAdding locations (via Excel and manually) \nautomatic KLS search for German locations\nautomatic initial Request to Preorder@Cloud for all locations with KLS ID \nmanual update for choosen locations possible\nRequest to TechPOM for locations in not planned/ area planned and receive events \nAutomatic PreOrder@cloud update for locations that TechPOM sends an change event for\nManually requested Change Log (Locations updated since) \n  This leads to the following needs for the UI and Usability functions:\n1 Filtering\nWhen locations are added, a filtering is possible in all columns of the table \nThe user can add a string in the filter field of a column and all locations (independent of the paging) are filtered for that string in that column\nthe filters can be used on top of each other to filter the locations further (so filter in different columns can be used together)\nwhen clicking on \"Clear Filter\" all filters are cleared \n2 Paging\nPaging is implemented according to FIGMA screens\n3 Correct uploaded locations (see FIGMA)\nAfter adding the locations in Excel upload, when in a location mandatory fields are missing or typos are in the location, the location is shown on top of the table\nmissing mandatory fields or typos lead to errorsymbols: \nif the country can not be solved, an errormessage is shown also for international addresses \notherwise international addresses (CountryCode != DE) are not validated  \nfor locations with countrycode DE the KLS validation is done\nWhen the user hovers over the errorsymbol (or over the magnifying glass [decision UX design] suggestions are shown to correct the typos\nfor country in order to find the countrycode\nFor DE addresses we use the suggestion mechanism (fuzzy search) from GAM to find the correct names of city, postcode, street, number \nWhen no suggestion can be shown, a hint is shown, then the user needs to open the manual editing and correct manually (using the KLS)  \nWhen the locations are corrected, they are not shown on top of the table any more, but are shown in the place where the FIB tool ID would sort the location to \n4 Adjust locations Table (see FIGMA)\nA function is offered (gearwheel icon) to adjust the table\nWhen the user clicks this icon, a popup opens\nin the popup the user can uncheck and check whole function blocks and single columns by unchecking and checking the line \nthe user can also move function blocks up and down by another icon\nwhen the user clicks on \"Save\" the changes are applied to the table (on both tables in the given Customer/ Project context)\nthe changes are still there when the user comes back with another customer/ Project context \n5 Change Log (see FIGMA)\nWhen the user logs into FIB and there are locations in the Customer Location list already,  a link to a \"Change Log\" is offered\nIf the user klicks on that, a popup opens that asks the user since when they want to see the changes \nthe user can add a date and all locations (in AGP or Customer) that are changed since this date are filtered and shown in the list \nThe user can leave this view by an \"X\"  or by \"Clear Filter\"\n      add compliance\nadd delivery type\nadd Job size\nadd fix version (if pulled)\nset target End date (if pulled)\n      DOR Status Comment\nAcceptance criteria are defined.  \nThe Epics is approved by system architects (done on Epic level). The appoval was done in develpoment circles with subject matter experts    \nThe Epics is prioritized within the backlog (WSJF Method)  \nThe Epics are understood by Dev Teams and estimated     \nThe Epics are documented within JIRA  \nDependencies are identified and there are no external dependencies that can´t be solved within the ART  \nNon-functional requirements (NFR) are identified.  \nSecurity and privacy approval required User Stories are labelled as those. Primary in the acording Jira Parameter     \nInitial high-level acceptance test cases written and reviewed by PO test cases we aggreed later on    \nAll the information relevant to development is linked: other stories, relevant designs, confluence sources of information, other specs    \nGUI Views have been defined (in form of click-dummy) and discussed with users for implementation  \nProcess dependency / adaptations has been defined    \n\nBusiness Scope:\nAs a user of the FIB tool I want the app to offer features to improve my usability",
  "business_value": {},
  "assignee": "Patricia Glöß",
  "priority": "",
  "target_start": "",
  "target_end": "",
  "fix_versions": [
    "Q1_25"
  ],
  "acceptance_criteria": [
    "AC1 It is possible to filter in all Columns of the FIB tool over the complete list for Customer or Quote, not only over one page.",
    "AC2 The paging is implemented acc. to UX requirements",
    "AC3 The user can show or hide the columns in the FIB Tool acc to FIGMA Screens",
    "AC4 The user can move complete blocks by moving the headline to the right or left according to FIGMA Screens",
    "AC5 Hints are added according to FIGMA Screens",
    "AC6 KLS Fuzzylogic is used for errors in DE-locations",
    "AC7 A Changelog (Changes since...) is offered to the user"
  ],
  "components": [
    {
      "code": "SDN_O2B",
      "title": "SDN_O2B ValueStream Offer to Order"
    }
  ],
  "labels": [
    "FTTH_by_LE"
  ],
  "realized_by": [],
  "child_issues": [],
  "attachments": []
}