{
  "key": "SDN-22448",
  "issue_type": "Epic",
  "title": "FIB: Design_expand requirements (Q1/25)",
  "status": "Closed",
  "description": "Description\nThe epic is collecting the design tasks that need to be done for the next steps of the FIB Tool development. The main topics and acting people are:\nAC1 Concept for user handling --> Patricia, Thomas, Carsten --> Concept for Golive roles and rights is clear, will be adjusted when the interface to SNow is done\nAC2 Finalize alignment on extensions for PreOrder@Cloud API, TechPOM Event Handling  --> Aleksei  \nAC3 Find and Review API that deliveres GFTAs on basis of GFAP --> Architectur Decision (GIGA Samir), resp. Thomas, no todo for BA yet \nAC4 Process Design for Selection of GFTA for the given project  --> Aleksei and Márk  --> finalization postponed to Q2 as currently found prerequisite (GIGA, Datendrehscheibe) is not correct any more and requirements are open  \nAC5 Migration Concept for locations added to Interest DB --> Arch or DEV Concept is in place, script is planned\nAC6 Tech Concept Integration B2BOC (underlay and rpk locations) --> DEV SDN-21256\nAC7 Clarify HTN / Einholung von Gestattungen process --> Thomas, Patricia \nAC8 Prepare Testcases for Golive Scope\nAC9 First alignment with SNow --> Thomas, Patricia, we will need someone from PANDA and SNow and maybe PANDAPOM  --> will move to next PI\n  General Description:\nThe \"FIB Tool\" (FTTH Infrastructure Building) has the target to support the provisioning of FTTH infrastructure for large enterprise customers. Its aim is to provide the status of fiber availability for different locations to the user who can then offer fiber to his/her customer for these locations. \nThe FIB tool will be integrated with the Integrated offer (B2BOC), but also provide an interface definition and API to be integrated to other Offering Tools within Deutsche Telekom Geschäftskunden (such as FLAMINGO ...). \nIn order to pursue the strategy for B2BOC to replace SAPCPQ as PANDA offer application, the FIB tool will be a new microservice application that substitute s the SAPCPQ internal Locations Functionality.\nIn this epic the requirements for the FIB tool itself are described on basis of the existing locations functionality. \nFor the Roadmap refer to https://wiki.telekom.de/x/cwCTkQ. Task of this epic is to describe and prepare the implementation planned for Q1/25. \n  Contacts:\nStream Lead: Alexander Walter\nBusiness: Bernd Frauenknecht, Enrico Dettmann (SGRK/SBU), SSE?  Thomas Heider\nPOM (Technic): Birol Arduc\nPreorder@Cloud: Uwe Schoon (AM), Stefan Kitschke\n  Guardrails for FIB Tool targets: \nFIB is a project management / rollout management tool with a focus on address and location mgmt for larger customers/many locations\nFIB integrates into the existing application landscape and does not replace it (shell be possible to integrate from many systems, FLAMINGO, customer portal, Salesforce etc.)  --> clarify who (user) is allowed to use the interface with what data (which AGP number o.ä., restrictions) \n  Planned Process for the FIB-Tool: \n1: request fiber availability status  -> Q1\n2: Entry in technik database of interested parties  -> prep in this epic\n3: Order removal, comply with HTN if necessary\n4: Order additional GT-TAs if necessary\n5: Order notifications/updates\n  The following implementation topics are currently planned for Q2, so they will be specified in Q1: \nConnection to B2BOC (to add imported locations to FIB)\nConnection to CPQ Product Configurators \nMigration of CPQ Locations (with regards to TechPOM) \nProvision of TFM Interface to access FIB from different applications (PANDA, Magenta Force etc) \n  For these topics the following todos are needed and part of this Epic\nUpdate Design, FIGMA Screens with integration with TechPOM \nUpdate Process Design if needed \nGenerate TMF Interface description for access to FIB Tool from different applications (PANDA, Magenta Force etc) \nConcept for user handling on basis of business reqirements in collaboration with the Architect on basis of Mars+ findings \nUpdate Design with roles and rights handling (what happens if someone is not allowed to do certail things in FIB) \nReview API for technical Integration TechPOM  (takeover from CPQ) \nEnhance API for Technical Integration TechPOM with an Event handling for responses per lineitem (new)\n  Prerequisite: \nTechPOM colleagues need to part of the concept for the event mechanism\nDecisions for the userhandling (which roles, rights do we need) are needed at the beginning of the PI \n  Dokumentation:\nWikipage:[ https://wiki.telekom.de/display/B2BSOM/FIB-Tool|https://wiki.telekom.de/display/B2BSOM/FIB-Tool]\nSharePoint: https://telekom.sharepoint.de/sites/B2B_OfferManagementSolution_all/Freigegebene%20Dokumente/Forms/AllItems.aspx?id=%2Fsites%2FB2B%5FOfferManagementSolution%5Fall%2FFreigegebene%20Dokumente%2FTeams%20und%20Tools%2FPanda%20Vega%2FFIB%20Tool%2FBusiness%20Requirements\n   out of scope: any implementation \n  Target Architecture for the complete process incl. FIB\n    DOR Status Comment\nAcceptance criteria are defined.  \nThe Epics is approved by system architects (done on Epic level). The appoval was done in develpoment circles with subject matter experts n.a.  \nThe Epics is prioritized within the backlog (WSJF Method)    \nThe Epics are understood by Dev Teams and estimated     \nThe Epics are documented within JIRA    \nDependencies are identified and there are no external dependencies that can´t be solved within the ART  \nNon-functional requirements (NFR) are identified. n.a.  \nSecurity and privacy approval required User Stories are labelled as those. Primary in the acording Jira Parameter  n.a.  \nInitial high-level acceptance test cases written and reviewed by PO test cases we aggreed later on n.a.  \nAll the information relevant to development is linked: other stories, relevant designs, confluence sources of information, other specs    \nGUI Views have been defined (in form of click-dummy) and discussed with users for implementation n.a.  \nProcess dependency / adaptations has been defined n.a  \nOverall sequence diagram: https://wiki.telekom.de/pages/viewpage.action?spaceKey=B2BSOM&title=PBI+Process+Flow\n \n\nBusiness Scope:\nThe epic creates the Requirements for the FIB Tool next steps.\n\nFIB shell be used especially for our L and XL customers as well as public, classified customers(?), M. (VBKZnummern aufschreiben)\nIn the 1st step FIB is prepared for customers that can be processed via D3 applications.\nFIB will be used by SSE, SBU, Services, Accountmanagement\nThe infrastructure workflow Tool (FIB) shell support:\n- FIB supports the overall process for large customers for infrastructure expansion with fiber optics\n1: Upload of mass data and create KLS ID\n2: request fibe availability status\n3: Entry in technik database of interested parties\n4: Quality Gate for state \"VVMongoning\"\n5: Anstoßen der HTN Erfassung\n6: Order removal, comply with HTN if necessary\n7: Order Bau in Standardbauweise oder additional GF-TAs if necessary\n8: Order notifications/updates\n- FIB is a project management / rollout management tool with a focus on address and location mgmt for larger customers/many locations\n- FIB integrates into the existing application landscape and does not replace it (shell be possible to integrate from many systems, SAP CPQ; customer portal, Salesforce etc.)",
  "business_value": {},
  "assignee": "Patricia Glöß",
  "priority": "",
  "target_start": "2025-01-23",
  "target_end": "2025-04-09",
  "fix_versions": [
    "Q1_25"
  ],
  "acceptance_criteria": [
    "AC1 Concept for user handling --> Patricia, Thomas, Carsten",
    "AC2 Finalize alignment on extensions for PreOrder@Cloud API --> Aleksei",
    "AC3 Find and Review API that deliveres GFTAs on basis of GFAP --> Architectur Decision, no todo for BA yet",
    "AC4 Process Design for Selection of GFTA for the given project  --> Aleksei and Márk",
    "AC5 Migration Concept for locations added to Interest DB --> Arch or DEV",
    "AC6 Tech Concept Integration B2BOC (underlay and rpk locations) --> DEV",
    "AC7 Clarify HTN / Einholung von Gestattungen process --> Thomas, Patricia",
    "AC8 Create inital testcases for Golive --> Vlad"
  ],
  "components": [
    {
      "code": "SDN_O2B",
      "title": "SDN_O2B ValueStream Offer to Order"
    }
  ],
  "labels": [
    "FTTH_by_LE",
    "SDLA_VS_Configuration&Offer",
    "UX_Design"
  ],
  "realized_by": [],
  "child_issues": [],
  "attachments": [
    {
      "filename": "image-2024-09-04-10-22-43-900.png",
      "url": "https://jira.telekom.de/secure/attachment/5068517/image-2024-09-04-10-22-43-900.png",
      "mime_type": "image/png",
      "size": "159 kB",
      "date": "2024-10-23T13:13:02.996+02:00"
    }
  ]
}