{
  "key": "TDGM-81",
  "issue_type": "Portfolio Epic",
  "title": "E-invoice (e-Rechnung) in Germany - CSB-MWL",
  "status": "In Requirements Scoping",
  "description": "Description\nCRM-T ist betroffen bzgl. dem Stream e-Rechnung für MWL Individualkunden über die Abrechnungskette MARS-CSB.\nAllgemeine Informationen zum Business Epic (BE)\nBusiness Epic Name/Bezeichnung E-invoice (e-Rechnung) in Germany - CSB-MWL\nBusiness Epic ID BEMABU-1961\nBusiness Epic Owner Kratzer, Ina \nSponsor/Tribe/Geschäftsbereich Claudia Buhne, BCC /GFGK     \n  Business Epic Nutzenstatement\nFür alle Customer Touchpoint Kunden,\ndie Leistungen, z.B. Contact Solutions Produkte, Servicenummern oder KI-Produkte von uns beziehen,\nist eine e-Rechnung nach gesetzlichen Vorgaben zu erstellen,\nwodurch die Leistungen w\nMVP Scope & Akzeptanzkriterien\nMVP Scope\n  In Scope / Akzeptanzkriterien\nDie e-Rechnung muss über die Prozessstrecke Individualmarkt über Mars → CSB entwickelt werden.\nDie erstellten e-Rechnungen muss für den Kunden über sein ReO- oder Nachfolge-Portal (MBSP) abrufbar sein\nDie e-Rechnung muss auf Wunsch dem Kunden per Mail zugeschickt werden können.\nDie e-Rechnung muss ab 1.1.2027 allen Customer Touchpoints Kunden bereit gestellt werden können.\nDabei gibt es derzeit folgende ToDo´s:\n CRM-T erfasst für MWL-Kunden die von der SEP verifizierten E-Mailadressen für Vertragspartner, Ansprechpartner und Rechnungsempfänger auf BKTO-Ebene\n CSB muss für MWL eine verifizierte E-Mail-Adresse und die buyer reference (Leitweg-ID) bei SEP abfragen können (per API/SSt) und empfangen können. Die verifizierte Mailadresse ist entsprechend abzulegen ODER TMF678 holt sich diese Daten direkt ab.\n CSB muss die neuen Logiken zur Rechnungscodezuordnung der e-Rechnung für MWL realisieren \n Die Schnittstelle CSB zu TMF678 Bill ist bzgl. MWL anzupassen – Rechnungsdaten müssen an TMF678 gesendet werden, dort wird die XML gebildet. Die XML und das PDF von CSB  müssen von TMF678 an das CSB Archiv zurückgeschickt werden.\n Die Schnittstelle CSB zu ReO MWL/MBSP (MSP) ist so anzupassen, dass das Rechnungs-PDF und die XML an ReO MWL/MBSP (MSP) übermittelt werden kann.\n ReO/MBSP muss die Schnittstelle mit XML und PDF von CSB empfangen und kundenindiziert ablegen können es wird evtl. eine Schnittstelle TESY-KIT und KIT-TESY notwendig um Updates von Kundendaten auszutauschen. Der Endkunde muss seine E-Mailadresse für Rechnungsempfänger auf BKTO-Ebene in MBSP eingeben können (um den Customer Service nicht zu überfordern).\nes wird ggf. eine Schnittstelle CRM-T - ZMKM notwendig um Updates von Kundendaten auszutauschen\n es wird ein ggf. ein Update der Schnittstelle CRM-T - TESY notwendig zum Austausch erweiterter Kundendaten\n ggf. ist eine SSt von ZMKM zur SEP oder einem Transfersystem erforderlich\nMussfelder für die e-Rechnung (buyer reference) und verifizierte E-Mailadressen für Rechnungsempfänger auf BKTO-Ebene können nicht über die Interimsprozesskette geliefert werden. Sie müssen auf einem anderen Weg an das Billing geliefert werden (s. Punkt 1).\nZur Zeit wird die angestrebte Architektur diskutiert.\nEs gibt noch Kunden, die eine Papierrechnung erhalten. Wie diese behandelt werden sollen, wollte im Projekt noch entschieden werden\nOut of Scope\nDer Aufbau eines neuen Kundenportals bzw. der Umzug in das neue Kundenportal MBSP ist nicht Gegenstand dieses EPICs.\n\nBusiness Scope:\nGesetzliche Vorgabe erfordert die Einführung der e-Rechnung für die Mars-CSB-Kette zum 1.1.2027\n\nGefährdet ist ein Umsatz von ca. 20,5 Mio. € (Annahme: 25% der Kunden verweigern die Annahme der Rechnung, da keine (korrekte) e-Rechnung gestellt wird)\n\nDetails: siehe Business-EPIC: https://jira.telekom.de/browse/BEMABU-1961",
  "business_value": {},
  "assignee": "Christian Borchert",
  "priority": "",
  "target_start": "2024-11-14",
  "target_end": "2025-10-31",
  "fix_versions": [],
  "acceptance_criteria": [
    "Vertragspartner\nAnsprechpartner beim Kunden\nRechnungsempfänger auf BKTO-Ebene",
    "Vertragspartner",
    "Ansprechpartner beim Kunden",
    "Rechnungsempfänger auf BKTO-Ebene"
  ],
  "components": [
    {
      "code": "BSS_CRMFN",
      "title": "BSS_CRMFN All Portfolio Epics that require action in the BSS Area \"Fixed\" have to have this component"
    }
  ],
  "labels": [
    "sen_incomplete"
  ],
  "realized_by": [
    {
      "key": "CRMFN-40093",
      "title": "CRMFN-40093",
      "summary": "eRechnungen \"eRechnung Individualmarkt\"",
      "url": "https://jira.telekom.de/browse/CRMFN-40093",
      "relation_type": "child"
    }
  ],
  "child_issues": [],
  "attachments": [
    {
      "filename": "E-Rechnung_Extrakt_CRM_2410.pptx",
      "url": "https://jira.telekom.de/secure/attachment/5131745/E-Rechnung_Extrakt_CRM_2410.pptx",
      "mime_type": "application/vnd.openxmlformats-officedocument.presentationml.presentation",
      "size": "224 kB",
      "date": "2024-11-14T16:10:23.759+01:00"
    },
    {
      "filename": "eRechnung.pptx",
      "url": "https://jira.telekom.de/secure/attachment/5131744/eRechnung.pptx",
      "mime_type": "application/vnd.openxmlformats-officedocument.presentationml.presentation",
      "size": "5.56 MB",
      "date": "2024-11-14T16:10:11.475+01:00"
    }
  ]
}